{
  "criteria": [
    "Understanding of Danger and Bullying Situations",
    "Articulation of the Importance of Reporting",
    "Identification of Appropriate Adults to Report To"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of what constitutes a dangerous or bullying situation.",
      "Student shows minimal understanding, with difficulty identifying clear examples of danger or bullying.",
      "Student identifies basic examples of dangerous and bullying situations but struggles with nuanced scenarios.",
      "Student accurately identifies most dangerous and bullying situations and understands the potential harm.",
      "Student demonstrates a strong understanding of a wide range of dangerous and bullying situations, including subtle forms.",
      "Student exhibits comprehensive understanding, including the ability to anticipate potential dangers and bullying scenarios, and recognizes the long-term impact."
    ],
    [
      "Student cannot articulate why reporting to an adult is important.",
      "Student vaguely mentions the need to report but does not provide a clear explanation of the benefits.",
      "Student explains that reporting can help, but lacks detail about the specific reasons why it's important.",
      "Student clearly articulates several reasons why reporting to an adult is important, such as safety and intervention.",
      "Student comprehensively explains the importance of reporting, including the potential for preventing escalation and supporting victims.",
      "Student persuasively articulates the ethical and practical reasons for reporting, emphasizing the responsibility of individuals to protect others and foster a safe environment."
    ],
    [
      "Student is unable to identify any appropriate adults to report to.",
      "Student identifies one or two adults but is unsure about their roles or responsibilities.",
      "Student identifies several adults but may not differentiate between their levels of authority or support.",
      "Student identifies a variety of appropriate adults, such as teachers, counselors, and family members.",
      "Student confidently identifies a wide range of appropriate adults and understands the specific roles each can play in providing help.",
      "Student demonstrates exceptional awareness of available resources and support systems, including community organizations and professionals, and can tailor reporting strategies based on the specific situation."
    ]
  ]
}