{
  "criteria": [
    "Effectiveness of refusal skills identified and explained for various personal-safety situations.",
    "Clarity and assertiveness in communication strategies when employing refusal skills.",
    "Ability to adapt refusal skills to different scenarios, considering potential consequences and varying levels of risk."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any refusal skills or provides skills that are inappropriate for personal-safety situations.",
      "Identifies one refusal skill that is somewhat related to personal-safety, but explanation is unclear or missing.",
      "Identifies a limited range of refusal skills (1-2) relevant to personal-safety situations with basic explanations.",
      "Identifies several refusal skills (3-4) relevant to personal-safety situations and provides adequate explanations for their use.",
      "Identifies a comprehensive range of refusal skills (4-5) applicable to various personal-safety situations, explaining their use clearly and effectively.",
      "Identifies a comprehensive and nuanced range of refusal skills applicable to diverse personal-safety situations. Explanations are insightful, demonstrating a deep understanding of their effectiveness and potential consequences."
    ],
    [
      "Demonstrates no understanding of clear and assertive communication or displays passive or aggressive communication.",
      "Struggles to communicate refusal skills clearly or assertively; communication may be confusing or hesitant.",
      "Communicates refusal skills with some clarity, but assertiveness is lacking or inconsistent.",
      "Communicates refusal skills clearly and with appropriate assertiveness in most scenarios.",
      "Consistently communicates refusal skills with clarity and confidence, adapting communication style to different personal-safety situations.",
      "Masterfully communicates refusal skills with exceptional clarity, confidence, and adaptability, demonstrating sophisticated strategies for de-escalation and self-protection."
    ],
    [
      "Unable to adapt refusal skills to different scenarios or consider potential consequences.",
      "Shows limited awareness of how refusal skills might need to be adjusted based on the situation.",
      "Recognizes that refusal skills may need to be adapted in different scenarios but struggles to provide specific examples.",
      "Adapts refusal skills to different scenarios with moderate success, considering some potential consequences.",
      "Effectively adapts refusal skills to a wide range of scenarios, demonstrating a strong understanding of potential consequences and levels of risk.",
      "Demonstrates expert-level adaptability in applying refusal skills to complex and high-risk scenarios. Displays exceptional foresight in considering potential consequences and creatively tailoring refusal strategies for optimal safety."
    ]
  ]
}