{
  "criteria": [
    "Identification of Influences",
    "Explanation of Mechanisms",
    "Application of Knowledge"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any influences of family and friends on health practices.",
      "The student identifies family or friends as influencing health practices, but does not differentiate between positive and negative practices.",
      "The student identifies family and friends as influencing health practices, correctly identifies either family OR friends influence on positive health practices, but lacks detail or clarity.",
      "The student identifies family and friends as influencing health practices, correctly identifies either family AND friends influence on positive health practices, providing specific examples of either of these influences.",
      "The student accurately explains how BOTH family AND friends influence positive health practices, providing detailed examples and demonstrating a clear understanding of the influences.",
      "The student comprehensively explains how family and friends influence positive health practices, providing nuanced examples, demonstrating a deep understanding of the influences, and offering insights into the dynamics of these relationships."
    ],
    [
      "The student does not explain how family and friends influence health practices.",
      "The student attempts to explain how family or friends influence health practices, but the explanation is unclear or inaccurate.",
      "The student provides a basic explanation of how family OR friends influence positive health practices, but lacks specific details or examples.",
      "The student explains how family AND friends influence positive health practices, providing specific examples of mechanisms such as role modeling or direct encouragement.",
      "The student clearly explains how family and friends influence positive health practices, providing detailed examples of mechanisms and demonstrating an understanding of the underlying processes.",
      "The student comprehensively explains how family and friends influence positive health practices, providing nuanced examples of mechanisms, demonstrating a deep understanding of the underlying processes, and offering insights into the complexities of social influence."
    ],
    [
      "The student does not apply their knowledge to real-life situations or examples.",
      "The student attempts to apply their knowledge to real-life situations or examples, but the application is unclear or inaccurate.",
      "The student applies their knowledge to a real-life situation or example, identifying how family OR friends influence positive health practices in that context.",
      "The student applies their knowledge to real-life situations or examples, identifying how family AND\/OR friends influence positive health practices in those contexts, and providing a brief analysis of the influences.",
      "The student applies their knowledge to real-life situations or examples, identifying how family and friends influence positive health practices in those contexts, and providing a detailed analysis of the influences and their impact.",
      "The student applies their knowledge to real-life situations or examples, identifying how family and friends influence positive health practices in those contexts, providing a comprehensive analysis of the influences and their impact, and offering insights into potential interventions or strategies for promoting positive health practices."
    ]
  ]
}