{
  "criteria": [
    "Understanding the Role of Sleep and Rest in Physical Health",
    "Understanding the Role of Sleep and Rest in Mental Health",
    "Understanding the Role of Sleep and Rest in Growth and Development"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of how sleep and rest contribute to physical health.",
      "The student shows minimal understanding, with significant misconceptions about the effects of sleep and rest on physical health.",
      "The student demonstrates a basic understanding, but the explanation is superficial and lacks detail. Some connections may be missing or unclear.",
      "The student demonstrates a satisfactory understanding, explaining how sleep and rest generally support physical health, but lacks specific examples or depth.",
      "The student demonstrates a strong understanding, clearly explaining the role of sleep and rest in physical health, including specific benefits and potential consequences of deficiency.",
      "The student demonstrates a comprehensive understanding, clearly and thoroughly explaining the role of sleep and rest in physical health, including specific benefits, consequences of deficiency, and the underlying biological mechanisms."
    ],
    [
      "The student demonstrates no understanding of how sleep and rest contribute to mental health.",
      "The student shows minimal understanding, with significant misconceptions about the effects of sleep and rest on mental health.",
      "The student demonstrates a basic understanding, but the explanation is superficial and lacks detail. Some connections may be missing or unclear.",
      "The student demonstrates a satisfactory understanding, explaining how sleep and rest generally support mental health, but lacks specific examples or depth.",
      "The student demonstrates a strong understanding, clearly explaining the role of sleep and rest in mental health, including specific benefits and potential consequences of deficiency.",
      "The student demonstrates a comprehensive understanding, clearly and thoroughly explaining the role of sleep and rest in mental health, including specific benefits, consequences of deficiency, and the underlying neurological mechanisms."
    ],
    [
      "The student demonstrates no understanding of how sleep and rest contribute to growth and development.",
      "The student shows minimal understanding, with significant misconceptions about the effects of sleep and rest on growth and development.",
      "The student demonstrates a basic understanding, but the explanation is superficial and lacks detail. Some connections may be missing or unclear.",
      "The student demonstrates a satisfactory understanding, explaining how sleep and rest generally support growth and development, but lacks specific examples or depth.",
      "The student demonstrates a strong understanding, clearly explaining the role of sleep and rest in growth and development, including specific benefits and potential consequences of deficiency.",
      "The student demonstrates a comprehensive understanding, clearly and thoroughly explaining the role of sleep and rest in growth and development, including specific benefits, consequences of deficiency, and the relevant hormonal processes."
    ]
  ]
}