{
  "criteria": [
    "Understanding the role of parents\/guardians as resources",
    "Identifying trusted adults beyond parents\/guardians",
    "Understanding the types of information parents\/guardians can provide"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not recognize parents, guardians, or other trusted adults as resources for information about growth and development.",
      "Student shows minimal recognition of parents, guardians, or other trusted adults as resources, but understanding is unclear or incomplete.",
      "Student acknowledges parents, guardians, or other trusted adults as potential resources but does not elaborate or provide specific examples.",
      "Student identifies parents, guardians, or other trusted adults as resources and provides a basic explanation of why they are trustworthy sources of information.",
      "Student clearly recognizes and explains the value of parents, guardians, or other trusted adults as reliable resources, providing specific examples.",
      "Student demonstrates a comprehensive understanding of the role and importance of parents, guardians, and other trusted adults as resources, articulating the nuances of their support in growth and development, and can seek out their guidance."
    ],
    [
      "Student fails to identify any trusted adults outside of parents or guardians.",
      "Student struggles to identify trusted adults beyond immediate family or provides inappropriate examples.",
      "Student identifies one or two trusted adults (e.g., teachers, counselors) but does not explain why they are trustworthy.",
      "Student identifies several trusted adults beyond parents\/guardians and provides a general explanation of their trustworthiness.",
      "Student thoughtfully identifies a range of trusted adults (e.g., coaches, mentors, religious leaders) and explains their specific qualifications as reliable sources.",
      "Student comprehensively identifies a diverse network of trusted adults and articulates the unique roles they play in providing guidance and support, demonstrating an ability to find suitable help."
    ],
    [
      "Student does not understand the types of information parents\/guardians or trusted adults can provide about growth and development.",
      "Student shows limited understanding of the information parents\/guardians can provide, with vague or inaccurate examples.",
      "Student lists a few types of information parents\/guardians can provide but lacks depth or clarity.",
      "Student identifies several relevant topics (e.g., puberty, relationships, mental health) that parents\/guardians can provide information about.",
      "Student clearly explains the range of information parents\/guardians can provide, offering specific examples and demonstrating an understanding of their expertise.",
      "Student demonstrates a sophisticated understanding of the types of information parents\/guardians can provide, recognizing their role in supporting overall well-being and identifying when to seek other types of expertise."
    ]
  ]
}