{
  "criteria": [
    "Identification of Benefits",
    "Understanding of Conflict Resolution Principles",
    "Application to Real-World Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any benefits of using nonviolent means to resolve conflicts.",
      "The student identifies one or two benefits but lacks detail or accuracy.",
      "The student identifies some benefits of using nonviolent means to resolve conflicts, but explanations are superficial.",
      "The student identifies several key benefits of using nonviolent means and provides a basic explanation for each.",
      "The student clearly identifies and explains multiple benefits of nonviolent conflict resolution, demonstrating a solid understanding.",
      "The student provides a comprehensive and insightful analysis of numerous benefits of nonviolent conflict resolution, showing a deep understanding and ability to apply this knowledge to various scenarios."
    ],
    [
      "The student demonstrates no understanding of conflict resolution principles.",
      "The student shows limited understanding of conflict resolution, with significant misconceptions.",
      "The student displays a basic awareness of conflict resolution principles but struggles to connect them to nonviolent methods.",
      "The student demonstrates a satisfactory understanding of conflict resolution principles and their relevance to nonviolent approaches.",
      "The student exhibits a strong grasp of conflict resolution principles and effectively explains how nonviolent means align with these principles.",
      "The student demonstrates mastery of conflict resolution principles, providing nuanced explanations of how nonviolent methods effectively address conflict dynamics."
    ],
    [
      "The student cannot apply nonviolent conflict resolution to real-world scenarios.",
      "The student struggles to apply nonviolent conflict resolution to scenarios, offering irrelevant or impractical solutions.",
      "The student attempts to apply nonviolent conflict resolution to scenarios but provides simplistic or unrealistic approaches.",
      "The student applies nonviolent conflict resolution to scenarios with reasonable effectiveness, suggesting plausible solutions.",
      "The student effectively applies nonviolent conflict resolution to diverse scenarios, offering well-reasoned and practical solutions.",
      "The student expertly applies nonviolent conflict resolution to complex scenarios, demonstrating creativity, adaptability, and a deep understanding of contextual factors."
    ]
  ]
}