{
  "criteria": [
    "Understanding of Chronic Diseases and Conditions",
    "Empathy and Sensitivity",
    "Practical Support Skills",
    "Communication and Advocacy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of common chronic diseases and conditions affecting students (e.g., asthma, allergies, diabetes, epilepsy).",
      "Shows limited awareness of chronic diseases and conditions and their impact on students.",
      "Displays basic knowledge of common chronic diseases and conditions, but struggles to explain their effects.",
      "Exhibits a solid understanding of several chronic diseases and conditions, including their common symptoms and management strategies.",
      "Demonstrates a comprehensive understanding of various chronic diseases and conditions, including triggers, symptoms, and appropriate support measures.",
      "Possesses an in-depth understanding of a wide range of chronic diseases and conditions, demonstrating expertise in identifying, understanding, and explaining their impact on students' lives."
    ],
    [
      "Displays a lack of empathy or sensitivity towards students with chronic diseases and conditions.",
      "Shows limited empathy and may make insensitive remarks or actions.",
      "Demonstrates some empathy but struggles to understand the challenges faced by students with chronic conditions.",
      "Exhibits empathy and sensitivity towards students with chronic diseases and conditions, acknowledging their unique needs.",
      "Consistently demonstrates empathy and understanding, offering support and encouragement to students with chronic conditions.",
      "Actively promotes inclusivity and understanding, advocating for the needs of students with chronic diseases and conditions with exceptional empathy and sensitivity."
    ],
    [
      "Unable to provide any practical support or assistance to students with chronic diseases and conditions.",
      "Offers minimal support or assistance, lacking confidence or knowledge of appropriate actions.",
      "Can provide basic support, such as reminding students to take medication or offering a listening ear.",
      "Offers practical support and assistance, such as helping students manage their symptoms or navigate school resources.",
      "Proactively provides comprehensive support, anticipating the needs of students with chronic conditions and offering assistance without prompting.",
      "Demonstrates exceptional skills in providing practical support, acting as a knowledgeable and reliable resource for students with chronic diseases and conditions, and empowering them to manage their health effectively."
    ],
    [
      "Does not communicate effectively or advocate for the needs of students with chronic diseases and conditions.",
      "Struggles to communicate with or advocate for students, lacking confidence or knowledge of appropriate strategies.",
      "Communicates basic information and advocates in simple terms, but struggles to address complex issues.",
      "Communicates effectively and advocates for the needs of students, collaborating with teachers, parents, and healthcare professionals.",
      "Articulates complex ideas clearly and persuasively, effectively advocating for policies and practices that support students with chronic diseases and conditions.",
      "Demonstrates exceptional communication and advocacy skills, serving as a powerful voice for students with chronic conditions, influencing policies and practices at the school and community levels."
    ]
  ]
}