{
  "criteria": [
    "Exploration of Stimuli for Movement",
    "Variety and Experimentation with Locomotor and Non-Locomotor Movements",
    "Understanding and Application of Dance Elements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding or attempt to explore movement inspired by any stimuli.",
      "Identifies a single stimulus but shows minimal effort in exploring related movements.",
      "Identifies a stimulus and attempts to explore movement but lacks depth or variety in the exploration.",
      "Explores movement inspired by a stimulus, showing some variety and connection to the source. Identifies the source.",
      "Demonstrates a clear exploration of movement inspired by a stimulus, showing good variety, creativity, and a solid connection to the source. Clearly identifies the source.",
      "Exhibits a sophisticated exploration of movement inspired by a stimulus, demonstrating a high level of creativity, nuanced understanding, and a profound connection to the source. Articulately identifies the source and its influence."
    ],
    [
      "Shows no understanding or attempt to explore locomotor or non-locomotor movements.",
      "Attempts locomotor or non-locomotor movements, but with no variety or experimentation.",
      "Shows limited variety in locomotor and non-locomotor movements with minimal experimentation of dance elements.",
      "Demonstrates a moderate variety of locomotor and non-locomotor movements, experimenting with a few elements of dance.",
      "Exhibits a good variety of locomotor and non-locomotor movements, experimenting with several elements of dance to create different effects.",
      "Displays a wide range of locomotor and non-locomotor movements, skillfully experimenting with various elements of dance to create innovative and expressive movement phrases."
    ],
    [
      "Demonstrates no awareness or application of dance elements (e.g., space, time, energy).",
      "Shows minimal awareness of dance elements with no clear application in movement.",
      "Recognizes dance elements but struggles to apply them effectively in movement exploration.",
      "Applies basic dance elements in movement exploration, showing a rudimentary understanding of their impact.",
      "Effectively manipulates dance elements in movement, demonstrating a solid understanding of their expressive potential.",
      "Masterfully integrates and manipulates dance elements to create highly expressive and nuanced movements, demonstrating a comprehensive understanding of their artistic possibilities."
    ]
  ]
}