{
  "criteria": [
    "Understanding of the Relationship Between Counting and Addition\/Subtraction",
    "Accuracy in Calculations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate any understanding of how counting relates to addition or subtraction. They cannot use counting strategies to solve simple addition or subtraction problems.",
      "The student shows minimal understanding of the relationship between counting and addition\/subtraction. They struggle to apply counting strategies and often arrive at incorrect answers.",
      "The student demonstrates a basic understanding of how counting can relate to addition and subtraction. They can sometimes use counting strategies to solve simple problems, but make frequent errors or require assistance.",
      "The student shows a solid understanding of the relationship between counting and addition\/subtraction. They can use counting strategies (e.g., counting on, counting back) to solve most addition and subtraction problems within 20, but may still make occasional errors.",
      "The student demonstrates a strong understanding of the relationship between counting and addition\/subtraction. They confidently and accurately use counting strategies to solve addition and subtraction problems within 20. They can explain their reasoning.",
      "The student demonstrates a comprehensive understanding of the relationship between counting and addition\/subtraction. They fluently and accurately use counting strategies to solve complex addition and subtraction problems within 20 and can apply this understanding to novel situations."
    ],
    [
      "The student consistently makes errors in addition and subtraction calculations, even with numbers less than 10. The student cannot calculate simple addition or subtraction problems.",
      "The student frequently makes errors in addition and subtraction calculations. Answers are often incorrect, even when using counting strategies. Is inconsistent in simple math equations.",
      "The student makes some errors in addition and subtraction calculations, but can sometimes arrive at the correct answer with assistance or by using counting strategies. Can successfully compute less than half of simple math problems.",
      "The student is mostly accurate in addition and subtraction calculations. The student can compute simple math problems but might need to double check their work for mistakes.",
      "The student is consistently accurate in addition and subtraction calculations within 20. Demonstrates a strong command of the base math skills.",
      "The student demonstrates mastery in addition and subtraction calculations, arriving at correct answers and showing prowess in more complicated math problems."
    ]
  ]
}