{
  "criteria": [
    "Identification of Responsible Family Member Characteristics",
    "Understanding of Impact on Family Dynamics",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No characteristics of a responsible family member are identified.",
      "Identifies one characteristic, but it is vague or unclear.",
      "Identifies two basic characteristics with limited explanation.",
      "Identifies three characteristics with some explanation and connection to family responsibility.",
      "Identifies four key characteristics with clear explanations and examples of how they relate to responsible family membership.",
      "Identifies five or more characteristics with detailed explanations, examples, and demonstrates a thorough understanding of their significance in a responsible family."
    ],
    [
      "Demonstrates no understanding of how responsible behavior impacts family dynamics.",
      "Shows minimal awareness of the impact on family relationships.",
      "Recognizes the basic impact on family, but lacks depth.",
      "Explains how responsible behavior generally affects family interactions.",
      "Provides specific examples of how responsible family member characteristics positively influence family dynamics and well-being.",
      "Offers a comprehensive analysis of the short-term and long-term impacts of responsible family member characteristics, showing insight into complex family dynamics."
    ],
    [
      "Unable to apply responsible family member characteristics to real-life scenarios.",
      "Attempts to apply characteristics to scenarios, but application is flawed or irrelevant.",
      "Applies characteristics to simple scenarios, but lacks detail.",
      "Applies characteristics to a variety of scenarios, demonstrating a general understanding.",
      "Provides well-reasoned applications of responsible family member characteristics to complex scenarios, showing an understanding of potential challenges.",
      "Critically analyzes complex scenarios and offers nuanced applications of responsible family member characteristics, demonstrating a high level of problem-solving and empathy."
    ]
  ]
}