{
  "criteria": [
    "Understanding the Importance of Communication",
    "Identifying Trusted Adults",
    "Explaining Potential Benefits"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate an understanding of why talking to parents or trusted adults is important.",
      "The student shows limited understanding, with vague or unclear explanations.",
      "The student identifies some reasons for communicating feelings but lacks depth.",
      "The student explains several reasons for talking to parents or trusted adults, showing a moderate level of understanding.",
      "The student clearly articulates the importance of discussing feelings with parents or trusted adults, providing detailed explanations.",
      "The student comprehensively explains the benefits of open communication with parents\/adults, including nuanced understanding of emotional support and guidance."
    ],
    [
      "The student is unable to identify any trusted adults to talk to.",
      "The student struggles to name trusted adults, with suggestions that may be inappropriate or unsafe.",
      "The student identifies one or two possible adults but does not explain why they are trustworthy.",
      "The student identifies several trusted adults and provides basic reasons for their trustworthiness.",
      "The student confidently names multiple trusted adults and clearly explains the qualities that make them appropriate for discussing feelings.",
      "The student thoughtfully considers different types of trusted adults and justifies their choices with insightful reasoning, demonstrating awareness of different support systems."
    ],
    [
      "The student cannot articulate any benefits of discussing feelings.",
      "The student mentions one potential benefit but struggles to explain it.",
      "The student lists a few possible benefits with limited elaboration.",
      "The student describes several benefits of talking about feelings, such as emotional support and problem-solving.",
      "The student thoroughly explains the benefits, including improved mental health, strengthened relationships, and better decision-making.",
      "The student provides a comprehensive analysis of the short-term and long-term benefits of discussing feelings, demonstrating a deep understanding of emotional well-being and resilience."
    ]
  ]
}