{
  "criteria": [
    "Identification of Family Changes",
    "Understanding the Impact of Changes",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of changes within families.",
      "The student identifies a single, basic change within families.",
      "The student identifies a few common changes within families but lacks detail.",
      "The student identifies several changes within families and provides some explanation.",
      "The student clearly identifies and explains various changes within families with supporting details.",
      "The student comprehensively identifies, explains, and provides insightful examples of diverse changes within families, demonstrating a deep understanding."
    ],
    [
      "The student does not demonstrate any understanding of the impact of family changes.",
      "The student vaguely mentions the impact of family changes without specific details.",
      "The student identifies some impacts of family changes, but explanations are superficial.",
      "The student explains several impacts of family changes on individuals or the family unit.",
      "The student thoroughly explains the various impacts of family changes, including emotional, social, and economic aspects.",
      "The student insightfully analyzes the complex and multifaceted impacts of family changes, demonstrating a comprehensive understanding of their consequences."
    ],
    [
      "The student cannot apply their understanding of family changes to real-life scenarios.",
      "The student struggles to relate family changes to real-life situations.",
      "The student provides basic examples of family changes in real-life scenarios.",
      "The student applies their understanding to analyze simple real-life scenarios involving family changes.",
      "The student skillfully applies their understanding to analyze complex real-life scenarios involving family changes, offering relevant insights.",
      "The student expertly applies their understanding to analyze intricate real-life scenarios involving family changes, offering nuanced and insightful perspectives."
    ]
  ]
}