{
  "criteria": [
    "Identification of Supportive Behaviors",
    "Understanding the Impact of Support",
    "Examples and Relevance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any positive ways that peers and family members show support, care, and appreciation.",
      "The student identifies only one limited or inaccurate way that peers and family members show support, care, and appreciation.",
      "The student identifies a few basic ways that peers and family members show support, care, and appreciation.",
      "The student identifies some positive ways that peers and family members show support, care, and appreciation with reasonable accuracy and detail.",
      "The student clearly identifies multiple positive ways that peers and family members show support, care, and appreciation with considerable accuracy and detail.",
      "The student comprehensively identifies and explains multiple positive ways that peers and family members show support, care, and appreciation, demonstrating a deep understanding."
    ],
    [
      "The student does not demonstrate an understanding of how supportive behaviors impact individuals.",
      "The student shows very limited understanding of how supportive behaviors impact individuals.",
      "The student demonstrates a basic understanding of how supportive behaviors can impact individuals.",
      "The student explains how supportive behaviors can positively impact individuals with some detail.",
      "The student clearly explains how supportive behaviors positively impact individuals, providing specific examples.",
      "The student insightfully explains how supportive behaviors foster emotional well-being, resilience, and healthy relationships, providing detailed examples."
    ],
    [
      "The student provides no examples or the examples provided are irrelevant.",
      "The student provides one example that is vague or only somewhat relevant.",
      "The student provides a couple of relevant examples with limited explanation.",
      "The student provides relevant examples and explains how they demonstrate support, care, or appreciation.",
      "The student provides well-explained and relevant examples, demonstrating clear connections to the skill's objective.",
      "The student provides insightful and highly relevant examples, demonstrating a nuanced understanding and application of the skill's objective."
    ]
  ]
}