{
  "criteria": [
    "Understanding of Friendship Commitments",
    "Articulation of Specific Actions",
    "Commitment to Personal Application"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of what it means to make a commitment to be a good friend.",
      "The student shows a very limited understanding of friendship commitments, with little to no specific examples.",
      "The student identifies some basic elements of friendship commitments but lacks depth and clarity in their descriptions.",
      "The student adequately describes several key commitments in a friendship, showing a general understanding.",
      "The student clearly and thoughtfully describes multiple commitments necessary for good friendships, providing specific and relevant examples.",
      "The student comprehensively and insightfully describes a wide range of commitments essential for strong friendships, demonstrating a nuanced and mature understanding, and offers proactive strategies for maintaining these commitments."
    ],
    [
      "The student is unable to articulate any specific actions related to being a good friend.",
      "The student struggles to name actions, and any suggestions are vague or unrealistic.",
      "The student provides one or two simple actions, but these are not well-explained or justified.",
      "The student lists several actions, explaining them with moderate clarity and relevance.",
      "The student details multiple actions, clearly explaining their importance in maintaining a good friendship.",
      "The student thoroughly and persuasively explains a comprehensive set of actions, demonstrating a deep understanding of their impact on friendship dynamics, and includes insightful examples."
    ],
    [
      "The student does not demonstrate any personal commitment to applying these actions in their own friendships.",
      "The student expresses no intention to improve their own friendships.",
      "The student identifies an element that applies to their personal friendships, but doesn't demonstrate its significance",
      "The student vaguely references their personal friendships, but doesn't demonstrate an understanding of its importance.",
      "The student clearly shows how they would apply these commitments to their own friendships, showing a willingness to improve.",
      "The student provides a detailed and reflective plan for incorporating friendship commitments into their own relationships, showing strong self-awareness and a proactive approach to fostering meaningful connections, while also demonstrating a strategy for dealing with failures."
    ]
  ]
}