{
  "criteria": [
    "Ability to analyze and interpret data from fossils to provide evidence of organisms and their environments.",
    "Understanding of how fossils provide evidence about organisms that lived long ago and the nature of their environments.",
    "Application of the concept of scale, proportion, and quantity to understand the timescale of observable phenomena related to fossils."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No attempt to analyze fossil data or connect it to past organisms and environments.",
      "Identifies fossils but struggles to interpret data or connect it to organisms and environments accurately.",
      "Analyzes fossil data with limited success, providing a basic connection to past organisms and environments, but lacks detail.",
      "Analyzes and interprets fossil data to provide evidence of organisms and environments, but with some gaps in understanding or detail.",
      "Effectively analyzes and interprets fossil data, providing clear evidence of the organisms and environments in which they lived. Demonstrates good understanding.",
      "Masterfully analyzes and interprets fossil data to provide comprehensive evidence of organisms and environments, demonstrating deep understanding and insightful connections."
    ],
    [
      "Demonstrates no understanding of how fossils relate to past life or environments.",
      "Shows a very basic awareness of fossils but cannot explain how they provide evidence.",
      "Understands that fossils provide some evidence, but struggles to articulate the specific information fossils offer about organisms and environments.",
      "Explains how fossils provide evidence about past organisms and environments, but lacks depth or specific examples.",
      "Clearly explains how fossils offer valuable evidence about the types of organisms that lived long ago and the characteristics of their environments.",
      "Demonstrates a comprehensive understanding of the evidence fossils provide, including detailed insights into the organisms and environments of the past."
    ],
    [
      "Does not apply the concept of scale to understand the timescale of fossil evidence.",
      "Struggles to relate the timescale of fossils to observable phenomena.",
      "Attempts to apply scale but demonstrates a limited understanding of the vast timescales involved in fossil formation and the evolution of life.",
      "Applies the concept of scale to understand the timescale of fossil evidence, but with some inaccuracies or simplifications.",
      "Effectively applies the concept of scale to explain the timescale of fossils and their relationship to observable phenomena, showing good proportional reasoning.",
      "Masterfully uses the concept of scale, proportion, and quantity to provide a nuanced understanding of the timescales associated with fossils and their significance in understanding life's history."
    ]
  ]
}