{
  "criteria": [
    "Understanding of Responsibility",
    "Examples and Application",
    "Clarity and Communication"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of responsibility within the family and community.",
      "Shows a limited understanding of responsibility, with difficulty explaining its importance.",
      "Displays a basic understanding of responsibility but struggles to provide specific examples.",
      "Exhibits a satisfactory understanding of responsibility and can provide some examples of its importance.",
      "Demonstrates a strong understanding of responsibility, providing clear and relevant examples of its importance within the family and community.",
      "Exhibits a comprehensive understanding of responsibility, articulating its importance with insightful examples and demonstrating a nuanced perspective."
    ],
    [
      "Unable to provide any examples of assuming responsibility.",
      "Provides irrelevant or unclear examples of assuming responsibility.",
      "Provides one basic example of assuming responsibility within either the family or community.",
      "Provides examples of assuming responsibility within both the family and community, but lacks detail.",
      "Provides clear and detailed examples of assuming responsibility within both the family and community, demonstrating a solid understanding of practical application.",
      "Provides insightful and nuanced examples of assuming responsibility within both the family and community, showcasing a deep understanding of practical application and potential impact."
    ],
    [
      "Responses are unclear and difficult to understand.",
      "Responses lack clarity and contain significant errors.",
      "Responses are somewhat clear but contain some errors.",
      "Responses are generally clear and understandable with few errors.",
      "Responses are clear, concise, and well-organized with minimal errors.",
      "Responses are articulate, insightful, and exceptionally well-organized, demonstrating excellent communication skills."
    ]
  ]
}