{
  "criteria": [
    "Understanding the concept of a healthy environment.",
    "Linking the healthy environment to personal health.",
    "Linking the healthy environment to community health.",
    "Demonstrating understanding of factors such as clean air, water, sanitation and access to green spaces."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate understanding of what constitutes a healthy environment.",
      "The student shows limited understanding of a healthy environment, with significant misconceptions.",
      "The student identifies some elements of a healthy environment but lacks depth in explanation.",
      "The student adequately describes a healthy environment, including several key components.",
      "The student thoroughly describes a healthy environment, detailing important factors and their impact.",
      "The student provides a comprehensive and nuanced description of a healthy environment, demonstrating deep understanding."
    ],
    [
      "The student fails to connect a healthy environment to personal health outcomes.",
      "The student struggles to make a connection between environment and personal health, offering vague statements.",
      "The student identifies a few ways a healthy environment affects personal health, but explanations are superficial.",
      "The student explains how a healthy environment contributes to personal health, providing concrete examples.",
      "The student clearly articulates the relationship between a healthy environment and personal health, giving well-supported explanations.",
      "The student expertly connects the concept of a healthy environment to personal health, showing a sophisticated understanding of the interconnectedness."
    ],
    [
      "The student does not demonstrate understanding of how a healthy environment impacts community health.",
      "The student shows a minimal connection between a healthy environment and the overall health of a community.",
      "The student identifies a few ways a healthy environment affects community health, but the explanations are basic.",
      "The student explains the impact of a healthy environment on community health, including specific examples.",
      "The student clearly and thoughtfully connects a healthy environment to community health, providing detailed examples and explanations.",
      "The student comprehensively connects a healthy environment to community health, demonstrating in-depth knowledge of factors affecting community well-being."
    ],
    [
      "The student fails to show understanding of factors that promote community health.",
      "The student shows limited understanding of factors that promote community health, with significant misconceptions.",
      "The student identifies some elements that promote community health but lacks depth in explanation.",
      "The student adequately describes several key components that promote community health.",
      "The student thoroughly describes a comprehensive set of key components that promote community health, detailing important factors and their impact.",
      "The student provides a comprehensive and nuanced description of factors that promote community health, demonstrating deep understanding."
    ]
  ]
}