{
  "criteria": [
    "Understanding of Individual Growth Differences",
    "Understanding of Developmental Differences",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding that individuals grow and develop at different rates.",
      "Shows a minimal understanding of individual growth differences, struggling to provide examples.",
      "Identifies that growth and development varies but provides limited explanations.",
      "Explains that individuals grow and develop differently, providing some examples.",
      "Clearly explains the concept of individual growth differences with relevant examples and demonstrates an understanding of potential factors.",
      "Provides a comprehensive explanation of individual growth differences, including detailed examples, factors influencing growth, and implications for health and well-being."
    ],
    [
      "Demonstrates no understanding that individuals develop at different rates.",
      "Shows a minimal understanding of individual developmental differences, struggling to provide examples.",
      "Identifies that development varies but provides limited explanations.",
      "Explains that individuals develop differently, providing some examples.",
      "Clearly explains the concept of individual developmental differences with relevant examples and demonstrates an understanding of potential factors.",
      "Provides a comprehensive explanation of individual developmental differences, including detailed examples, factors influencing development, and implications for health and well-being."
    ],
    [
      "Unable to apply the concept of individual differences in growth and development to real-life situations.",
      "Struggles to relate individual differences to real-life scenarios.",
      "Relates individual differences to simple real-life scenarios with limited detail.",
      "Applies the concept to real-life scenarios, explaining how individual differences impact these situations.",
      "Analyzes real-life scenarios in detail, demonstrating a clear understanding of how individual differences influence outcomes.",
      "Critically analyzes complex real-life scenarios, providing nuanced insights into the impact of individual differences and proposing strategies for promoting healthy development."
    ]
  ]
}