{
  "criteria": [
    "Clarity and Directness of Communication",
    "Respectfulness in Communication",
    "Assertiveness in Setting Boundaries",
    "Understanding of Personal Boundaries"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not attempt to communicate boundaries or does so unclearly.",
      "Attempts to communicate boundaries but is vague or confusing.",
      "Communicates boundaries with some clarity but may lack directness.",
      "Clearly and directly communicates personal boundaries most of the time.",
      "Consistently communicates personal boundaries clearly and directly.",
      "Expertly communicates personal boundaries with exceptional clarity and directness, leaving no room for misinterpretation."
    ],
    [
      "Communication is disrespectful or dismissive of others' feelings.",
      "Communication shows some respect but may occasionally be insensitive.",
      "Communicates boundaries respectfully in some instances but not consistently.",
      "Generally communicates personal boundaries respectfully.",
      "Consistently demonstrates respect for others while communicating boundaries.",
      "Models exceptional respect and empathy while assertively communicating boundaries, fostering positive interactions."
    ],
    [
      "Unable to assert personal boundaries; overly passive or aggressive.",
      "Struggles to assert boundaries; may be hesitant or easily swayed.",
      "Shows some assertiveness in setting boundaries but may waver under pressure.",
      "Assertively sets personal boundaries in most situations.",
      "Confidently and assertively sets and maintains personal boundaries.",
      "Masterfully and confidently asserts personal boundaries, empowering self and others while promoting healthy relationships."
    ],
    [
      "Demonstrates no understanding of personal boundaries.",
      "Shows limited understanding of what constitutes a personal boundary.",
      "Understands basic concepts of personal boundaries but struggles with application.",
      "Demonstrates a good understanding of personal boundaries and can identify them in various contexts.",
      "Displays a strong understanding of personal boundaries and their importance in healthy relationships.",
      "Exhibits a comprehensive understanding of personal boundaries, including nuances and complexities, and can articulate them effectively."
    ]
  ]
}