{
  "criteria": [
    "Understanding and recognition of individual differences",
    "Respectful communication and interaction",
    "Application of strategies to promote respect"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding or recognition of individual differences.",
      "Struggles to recognize or acknowledge individual differences; demonstrates limited awareness.",
      "Recognizes individual differences in a superficial manner; lacks depth in understanding.",
      "Demonstrates a basic understanding of individual differences and acknowledges their presence.",
      "Shows a comprehensive understanding of individual differences and their importance in various contexts.",
      "Exhibits an exceptional understanding of individual differences, demonstrating empathy and insight into diverse perspectives."
    ],
    [
      "Demonstrates disrespectful communication or interaction with individuals who are different.",
      "Displays occasional disrespect or insensitivity towards individual differences in communication or interaction.",
      "Communicates or interacts with individuals who are different in a neutral manner, without showing explicit respect or disrespect.",
      "Communicates and interacts with individuals who are different in a respectful and considerate manner.",
      "Actively promotes respectful communication and interaction with individuals who are different, fostering a positive environment.",
      "Serves as a role model for respectful communication and interaction, demonstrating exceptional sensitivity and inclusivity in all interactions."
    ],
    [
      "Unable to identify or apply any strategies to promote respect for individual differences.",
      "Struggles to identify or apply effective strategies to promote respect for individual differences.",
      "Identifies basic strategies to promote respect but struggles to apply them effectively.",
      "Applies appropriate strategies to promote respect for individual differences in various situations.",
      "Consistently applies effective strategies to promote respect for individual differences, adapting them to different contexts.",
      "Develops and implements innovative strategies to promote respect for individual differences, fostering a culture of inclusivity and understanding."
    ]
  ]
}