{
  "criteria": [
    "Ability to positively influence peers to show respect for others despite differences in growth and development.",
    "Understanding and application of strategies to promote respect and inclusivity.",
    "Sensitivity and empathy towards individual differences in growth and development."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not attempt to encourage peers or actively participates in disrespectful behavior.",
      "Student rarely encourages peers and occasionally participates in disrespectful behavior.",
      "Student sometimes encourages peers to show respect, but inconsistently and may occasionally display or condone disrespectful behavior.",
      "Student generally encourages peers to show respect, addressing blatant disrespect but overlooking subtler instances or not proactively promoting respect.",
      "Student consistently encourages peers to show respect and addresses most instances of disrespectful behavior, proactively promoting inclusivity.",
      "Student serves as a role model, consistently and effectively encouraging peers to show respect, proactively addressing disrespectful behavior and promoting a culture of inclusivity and understanding."
    ],
    [
      "Student shows no understanding of strategies to promote respect.",
      "Student demonstrates limited understanding of strategies to promote respect, with difficulty in applying them.",
      "Student can identify some strategies to promote respect, but struggles to apply them effectively.",
      "Student understands several strategies to promote respect and attempts to use them appropriately, but may need guidance.",
      "Student demonstrates a strong understanding of strategies and applies them effectively to promote respect and inclusivity.",
      "Student expertly understands and applies a wide range of strategies to promote respect, adapting approaches to different situations and mentoring others in their use."
    ],
    [
      "Student shows a lack of sensitivity or awareness towards individual differences.",
      "Student shows limited awareness of individual differences, with little demonstrated empathy.",
      "Student acknowledges individual differences but struggles to show empathy or understanding.",
      "Student generally shows sensitivity and empathy towards individual differences, but may occasionally overlook or misunderstand them.",
      "Student consistently shows sensitivity and empathy towards individual differences, actively promoting understanding among peers.",
      "Student demonstrates exceptional sensitivity and empathy, using their understanding of individual differences to create a supportive and inclusive environment for all."
    ]
  ]
}