{
  "criteria": [
    "Effectiveness of objecting to teasing based on personal characteristics.",
    "Clarity and articulation in expressing objections to teasing.",
    "Consistency in objecting to teasing across different contexts and relationships."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not object to teasing; seems unaffected or encourages it.",
      "Rarely objects to teasing and demonstrates discomfort or uncertainty when teased.",
      "Sometimes objects to teasing but struggles to articulate reasons or strategies effectively.",
      "Generally objects to teasing with simple reasoning, showing a basic understanding of why it's inappropriate.",
      "Consistently and clearly objects to teasing, providing sound reasons and demonstrating self-assurance.",
      "Skillfully and confidently objects to teasing, providing insightful explanations and strategies for handling such situations, while advocating for others."
    ],
    [
      "Unable to articulate any form of objection or express feelings about being teased.",
      "Objections are mumbled, unclear, or easily dismissed.",
      "Expresses objections but lacks clarity or coherence in reasoning.",
      "Clearly articulates objections using appropriate language and reasoning.",
      "Articulates objections with precision, using persuasive language and examples.",
      "Articulates objections eloquently and persuasively, demonstrating a sophisticated understanding of the impact of teasing and advocating for respectful communication."
    ],
    [
      "Never objects to teasing, regardless of the context or relationship with the teaser.",
      "Objects to teasing only in specific contexts or with certain individuals.",
      "Sometimes objects to teasing but shows inconsistency in application based on context or relationship.",
      "Generally objects to teasing consistently across different contexts and relationships.",
      "Consistently objects to teasing in all contexts and relationships, demonstrating a strong commitment to personal boundaries and respect.",
      "Proactively addresses teasing and promotes a culture of respect in various settings, consistently advocating for positive relationships and communication."
    ]
  ]
}