{
  "criteria": [
    "Understanding of Energy Transfer Mechanisms",
    "Observational Evidence and Data Collection",
    "Application of Scientific Practices"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of how energy can be transferred via sound, light, heat, or electric currents.",
      "The student identifies some methods of energy transfer but lacks a clear explanation of how they work.",
      "The student identifies energy transfer methods (sound, light, heat, electric currents) and provides a basic explanation of one.",
      "The student explains how energy transfers through two different methods, providing relevant details and examples.",
      "The student clearly explains how energy is transferred through at least three different methods, providing clear examples and showing understanding of the underlying principles.",
      "The student comprehensively explains energy transfer through sound, light, heat, and electric currents with detailed examples and demonstrates a deep understanding of the principles at play. They may also include nuanced observations."
    ],
    [
      "The student provides no observational evidence or data related to energy transfer.",
      "The student offers limited or irrelevant observations that do not support the concept of energy transfer.",
      "The student makes some observations related to energy transfer, but the data is limited or poorly presented.",
      "The student provides organized observations that offer basic evidence of energy transfer in at least one form.",
      "The student provides clear and well-organized observations providing evidence of energy transfer through multiple mediums.",
      "The student conducts thorough observations and presents data in a clear, organized manner, providing strong evidence to support claims about energy transfer in multiple forms.  Data is detailed and insightful."
    ],
    [
      "The student does not demonstrate any scientific practices related to planning or carrying out investigations.",
      "The student attempts to plan or carry out an investigation but lacks focus or a clear methodology.",
      "The student demonstrates a basic understanding of scientific practices by attempting to make observations related to energy transfer.",
      "The student demonstrates appropriate scientific practices such as planning and making observations, to gather evidence for explaining energy transfer.",
      "The student effectively uses planning and observational skills to gather and analyze data, leading to a strong explanation of energy transfer.",
      "The student skillfully applies scientific practices, including careful planning, detailed observations, and rigorous analysis, to provide compelling evidence and nuanced explanations of energy transfer."
    ]
  ]
}