{
  "criteria": [
    "Demonstrates awareness of personal space and boundaries.",
    "Demonstrates verbal and non-verbal resistance strategies.",
    "Demonstrates escape and evasion techniques.",
    "Demonstrates knowledge of resources and reporting procedures."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not understand personal space or boundaries; cannot identify inappropriate touching or abduction attempts.",
      "Shows limited awareness of personal space; struggles to identify inappropriate touching or abduction attempts.",
      "Identifies personal space and can recognize some instances of inappropriate touching or abduction attempts with prompting.",
      "Consistently recognizes personal space and can identify most instances of inappropriate touching or abduction attempts.",
      "Demonstrates a strong understanding of personal space and can accurately identify inappropriate touching or abduction attempts, explaining the reasoning.",
      "Exemplifies a comprehensive understanding of personal space, boundaries, and potential threats; can educate others on recognizing and avoiding dangerous situations."
    ],
    [
      "Unable to verbalize or physically demonstrate any resistance strategies.",
      "Can verbalize a resistance strategy with significant prompting, but cannot physically demonstrate it.",
      "Can verbalize one or two basic resistance strategies and attempt to physically demonstrate them, but lacks confidence or effectiveness.",
      "Can clearly verbalize several resistance strategies (e.g., saying 'no,' yelling for help) and physically demonstrate basic techniques (e.g., creating distance).",
      "Confidently verbalizes and physically demonstrates a variety of resistance strategies appropriate for different scenarios, adapting to the situation.",
      "Masterfully applies verbal and non-verbal resistance strategies with adaptability and authority; can train others effectively."
    ],
    [
      "Unable to describe or demonstrate any escape or evasion techniques.",
      "Can describe an escape technique with prompting, but unable to physically demonstrate it.",
      "Describes and attempts basic escape techniques (e.g., running away), but lacks practical application or awareness of surroundings.",
      "Can describe and demonstrate multiple escape techniques (e.g., running, seeking help) and shows some awareness of surroundings.",
      "Demonstrates effective escape and evasion techniques, utilizing surroundings for cover and adapting strategies based on the situation.",
      "Shows mastery of escape and evasion tactics, using advanced techniques and environmental awareness to ensure safety."
    ],
    [
      "Unaware of any resources or reporting procedures for inappropriate touching or abduction.",
      "Knows of one resource with prompting, but is unsure of reporting procedures.",
      "Can name a resource and attempt to describe reporting procedures, but lacks detail or accuracy.",
      "Identifies multiple resources (e.g., trusted adults, hotlines) and describes basic reporting procedures.",
      "Clearly identifies several resources and explains comprehensive reporting procedures, including legal options.",
      "Possesses extensive knowledge of resources and reporting procedures, can advocate for others, and actively promotes awareness."
    ]
  ]
}