{
  "criteria": [
    "Identification of Advertising Strategies",
    "Analysis of Persuasive Techniques",
    "Understanding of Target Audience",
    "Critical Evaluation of Health Consequences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any advertising strategies used for alcohol, tobacco, or other drugs.",
      "Student identifies only one advertising strategy with limited accuracy.",
      "Student identifies a few advertising strategies but demonstrates a superficial understanding.",
      "Student identifies several advertising strategies with reasonable accuracy and understanding.",
      "Student accurately identifies and describes multiple advertising strategies used for alcohol, tobacco, and other drugs.",
      "Student comprehensively identifies and explains a wide range of advertising strategies, demonstrating a sophisticated understanding of their use."
    ],
    [
      "Student does not recognize any persuasive techniques used in advertising.",
      "Student vaguely mentions one or two persuasive techniques.",
      "Student identifies some persuasive techniques but struggles to explain their impact.",
      "Student adequately identifies and explains how several persuasive techniques are used.",
      "Student effectively analyzes how various persuasive techniques are employed to influence behavior.",
      "Student expertly dissects the persuasive techniques, offering nuanced insights into their psychological impact and effectiveness."
    ],
    [
      "Student does not consider the role of the target audience in advertising.",
      "Student mentions the target audience but does not explain its relevance.",
      "Student identifies the target audience for some advertisements but lacks depth in explanation.",
      "Student generally understands how advertising is tailored to specific target audiences.",
      "Student clearly explains how advertising strategies are designed to appeal to particular target audiences.",
      "Student demonstrates a deep understanding of how advertising strategies are precisely tailored to resonate with and influence specific target audiences, including consideration of demographics and psychological factors."
    ],
    [
      "Student does not address the potential health consequences of using advertised substances.",
      "Student briefly mentions health consequences without providing specific details.",
      "Student acknowledges some health consequences but does not fully explore them.",
      "Student discusses several health consequences associated with the use of advertised substances.",
      "Student critically evaluates the potential health consequences and provides well-supported arguments.",
      "Student thoroughly examines the health consequences, including long-term effects, and provides insightful analysis supported by credible evidence."
    ]
  ]
}