{
  "criteria": [
    "Identification of Media Violence Influence",
    "Explanation of Health Behavior Impact",
    "Application of Concepts to Real-World Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any influence of media violence on health behavior.",
      "The student identifies media violence but does not accurately describe its influence on health behavior.",
      "The student identifies and describes the influence of media violence on health behavior with limited detail.",
      "The student identifies and clearly describes the influence of media violence on health behavior, providing some examples.",
      "The student thoroughly describes the influence of media violence on health behavior, providing relevant and detailed examples.",
      "The student comprehensively analyzes the influence of media violence on health behavior, providing insightful examples and demonstrating a nuanced understanding."
    ],
    [
      "The student does not explain how violence in media and technology affects health behavior.",
      "The student attempts to explain the impact of media violence on health behavior but demonstrates significant inaccuracies or misunderstandings.",
      "The student provides a basic explanation of how media violence can impact health behavior with some gaps in understanding.",
      "The student clearly explains how media violence can impact various aspects of health behavior, providing a few supporting details.",
      "The student thoroughly explains how media violence can impact multiple aspects of health behavior, providing specific examples and supporting details.",
      "The student provides a comprehensive and insightful explanation of how media violence impacts health behavior, including long-term and indirect effects, supported by detailed evidence."
    ],
    [
      "The student does not apply concepts related to media violence and health behavior to real-world scenarios.",
      "The student attempts to apply concepts to real-world scenarios but struggles to make relevant connections.",
      "The student applies concepts to real-world scenarios with limited accuracy or detail.",
      "The student applies concepts to real-world scenarios effectively, providing relevant examples and clear explanations.",
      "The student applies concepts to real-world scenarios with strong analytical skills, providing detailed examples and insightful observations.",
      "The student skillfully applies concepts to complex real-world scenarios, demonstrating a sophisticated understanding of the relationship between media violence and health behavior."
    ]
  ]
}