{
  "criteria": [
    "Identification of Trusted Adults",
    "Understanding of Reporting Procedures",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student is unable to identify any trusted adults or provides inaccurate information.",
      "Student identifies only one potential trusted adult but struggles to explain why they are trustworthy.",
      "Student identifies a couple of trusted adults but provides limited reasons for their trustworthiness.",
      "Student identifies multiple trusted adults with some explanation of their roles and trustworthiness, but lacks depth.",
      "Student identifies several trusted adults, providing clear explanations of their roles and trustworthiness in the context of safety.",
      "Student confidently and comprehensively identifies a diverse range of trusted adults, detailing their roles, trustworthiness, and specific ways they can help in dangerous situations, demonstrating a strong understanding of support systems."
    ],
    [
      "Student demonstrates no understanding of how or when to report dangerous situations.",
      "Student shows a vague understanding of reporting, but cannot articulate specific steps.",
      "Student identifies one or two basic steps in the reporting process but misses key elements.",
      "Student outlines several steps for reporting but may lack clarity or completeness.",
      "Student describes a clear and logical process for reporting dangerous situations to trusted adults.",
      "Student articulates a comprehensive and nuanced understanding of reporting procedures, including when, how, and why to report, demonstrating an understanding of potential barriers and solutions."
    ],
    [
      "Student cannot apply knowledge to hypothetical scenarios.",
      "Student struggles to apply knowledge to real-life scenarios, providing irrelevant or nonsensical responses.",
      "Student provides a partially correct response to real-life scenarios, but lacks depth or understanding.",
      "Student demonstrates an adequate understanding of how to apply knowledge to real-life scenarios involving potential harm.",
      "Student accurately applies knowledge to various real-life scenarios, identifying appropriate trusted adults and reporting steps.",
      "Student confidently and thoughtfully applies knowledge to complex and nuanced real-life scenarios, demonstrating a deep understanding of how to ensure safety and well-being for themselves and others."
    ]
  ]
}