{
  "criteria": [
    "Identifying Risks and Pressures",
    "Demonstrating Refusal Strategies",
    "Understanding Consequences",
    "Seeking Support and Alternatives"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Fails to identify any risks or pressures associated with gang involvement.",
      "Identifies minimal risks or pressures, with limited understanding.",
      "Identifies some risks and pressures, but explanation lacks depth.",
      "Identifies several risks and pressures, providing a satisfactory explanation.",
      "Clearly identifies and explains various risks and pressures, demonstrating a good understanding.",
      "Comprehensively identifies and analyzes risks and pressures, demonstrating a thorough and insightful understanding."
    ],
    [
      "Unable to demonstrate any refusal skills or strategies.",
      "Demonstrates minimal refusal skills; strategies are weak or inappropriate.",
      "Demonstrates some refusal skills, but application is inconsistent.",
      "Demonstrates adequate refusal skills with reasonable effectiveness.",
      "Demonstrates strong and effective refusal skills in various scenarios.",
      "Demonstrates exceptional refusal skills, adapting strategies thoughtfully and persuasively."
    ],
    [
      "Shows no understanding of the potential consequences of gang involvement.",
      "Shows limited awareness of potential consequences.",
      "Identifies some consequences, but understanding is superficial.",
      "Understands several potential consequences of gang involvement.",
      "Clearly understands and articulates a range of consequences, both short-term and long-term.",
      "Demonstrates a comprehensive understanding of the multifaceted consequences, including legal, social, and personal impacts."
    ],
    [
      "Does not identify or suggest any sources of support or alternative activities.",
      "Suggests limited sources of support or alternatives, but they are vague or impractical.",
      "Identifies some sources of support and alternative activities, but lacks detail.",
      "Presents several relevant sources of support and alternative activities.",
      "Clearly presents and explains multiple sources of support and constructive alternative activities.",
      "Demonstrates proactive planning by identifying a robust network of support and engaging alternative activities to avoid gang involvement."
    ]
  ]
}