{
  "criteria": [
    "Identification of Bullying and Harassment:",
    "Understanding Consequences on Victims:",
    "Understanding Consequences on Bullies:",
    "Discussion of Preventative Measures:"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any forms of bullying or harassment.",
      "Identifies only one form of bullying or harassment.",
      "Identifies a couple of forms of bullying and harassment with limited accuracy.",
      "Identifies several forms of bullying and harassment accurately.",
      "Clearly identifies multiple forms of bullying and harassment, providing specific examples.",
      "Comprehensively identifies various forms of bullying and harassment, including cyberbullying, physical, and emotional forms, with detailed examples."
    ],
    [
      "Shows no understanding of the consequences of bullying and harassment on victims.",
      "Demonstrates a minimal understanding of the consequences on victims.",
      "Describes some consequences of bullying and harassment on victims, but lacks depth.",
      "Explains several consequences of bullying and harassment on victims with reasonable clarity.",
      "Clearly articulates significant consequences of bullying and harassment on victims, including psychological and emotional impacts.",
      "Thoroughly analyzes the short-term and long-term consequences of bullying and harassment on victims, including detailed psychological, emotional, and social impacts."
    ],
    [
      "Shows no understanding of the consequences of bullying and harassment on bullies themselves.",
      "Demonstrates a minimal understanding of the consequences on bullies.",
      "Describes some consequences of bullying and harassment on bullies, but lacks depth.",
      "Explains several consequences of bullying and harassment on bullies with reasonable clarity.",
      "Clearly articulates significant consequences of bullying and harassment on bullies, including legal and social impacts.",
      "Thoroughly analyzes the short-term and long-term consequences of bullying and harassment on bullies, including detailed legal, social, and personal impacts."
    ],
    [
      "Does not discuss any preventative measures against bullying and harassment.",
      "Mentions one or two basic preventative measures.",
      "Discusses a few preventative measures with limited detail.",
      "Explains several preventative measures against bullying and harassment with reasonable detail.",
      "Clearly describes various preventative measures, including strategies for intervention and support.",
      "Provides a comprehensive analysis of multiple preventative measures, including school policies, community programs, and individual strategies, demonstrating a deep understanding of effective prevention techniques."
    ]
  ]
}