{
  "criteria": [
    "Understanding of Healthy Eating Principles",
    "Application of Knowledge to Personal Food Choices",
    "Planning and Goal Setting for Healthy Eating",
    "Reflection and Self-Assessment"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of basic healthy eating principles.",
      "Shows limited understanding of healthy eating, with significant misconceptions.",
      "Displays some understanding of healthy eating principles, but struggles to apply them to personal choices.",
      "Demonstrates a general understanding of healthy eating, and can identify some healthy food options.",
      "Exhibits a strong understanding of healthy eating principles, including the importance of balanced meals and portion control.",
      "Shows comprehensive understanding of healthy eating principles, including macronutrients, micronutrients, and their impact on overall health."
    ],
    [
      "Unable to identify any personal food choices that align with healthy eating.",
      "Identifies one or two healthy choices but struggles to explain why they are healthy.",
      "Can identify some healthy food choices and explain them but struggles to apply this knowledge regularly.",
      "Applies knowledge of healthy eating to make some positive personal food choices.",
      "Consistently applies knowledge of healthy eating to make informed and healthy personal food choices.",
      "Proactively seeks out and incorporates healthy food choices into their daily diet, demonstrating a commitment to personal well-being."
    ],
    [
      "Shows no evidence of planning or goal setting related to healthy eating.",
      "Attempts to set goals, but they are unrealistic or not specific.",
      "Sets basic goals for healthy eating but lacks a clear plan for achieving them.",
      "Develops a reasonable plan with specific goals for incorporating more healthy foods into their diet.",
      "Creates a well-defined plan with specific, measurable, achievable, relevant, and time-bound (SMART) goals for healthy eating.",
      "Independently develops a comprehensive and sustainable plan for healthy eating, incorporating SMART goals, strategies for overcoming obstacles, and methods for tracking progress."
    ],
    [
      "Does not reflect on personal eating habits or the impact of food choices.",
      "Provides superficial reflections on eating habits without identifying areas for improvement.",
      "Reflects on personal eating habits and identifies some areas for improvement.",
      "Critically assesses personal eating habits, identifying both strengths and weaknesses, and proposes reasonable adjustments.",
      "Routinely reflects on their eating habits, tracks progress toward goals, and makes adjustments to their plan as needed.",
      "Demonstrates a sophisticated understanding of the connection between food choices, overall well-being, and long-term health outcomes through consistent reflection, self-assessment, and adaptation."
    ]
  ]
}