{
  "criteria": [
    "Demonstrates understanding of escape strategies for inappropriate touching",
    "Demonstrates understanding of escape strategies for attempted abduction",
    "Application of escape strategies to real-world scenarios (role-playing, hypothetical situations)"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not demonstrate any understanding of escape strategies.",
      "Demonstrates a minimal understanding of escape strategies; may confuse strategies or provide inaccurate information.",
      "Demonstrates a basic understanding of escape strategies but struggles to articulate them clearly.",
      "Demonstrates a satisfactory understanding of escape strategies, explaining them adequately.",
      "Demonstrates a strong understanding of escape strategies, explaining them clearly and accurately.",
      "Demonstrates a comprehensive understanding of escape strategies, explaining them clearly, accurately, and with insightful detail."
    ],
    [
      "Does not demonstrate any understanding of escape strategies.",
      "Demonstrates a minimal understanding of escape strategies; may confuse strategies or provide inaccurate information.",
      "Demonstrates a basic understanding of escape strategies but struggles to articulate them clearly.",
      "Demonstrates a satisfactory understanding of escape strategies, explaining them adequately.",
      "Demonstrates a strong understanding of escape strategies, explaining them clearly and accurately.",
      "Demonstrates a comprehensive understanding of escape strategies, explaining them clearly, accurately, and with insightful detail."
    ],
    [
      "Unable to apply escape strategies to any scenarios.",
      "Struggles to apply escape strategies, even with guidance.",
      "Can apply escape strategies to simple scenarios with some assistance.",
      "Can apply escape strategies to a variety of scenarios with minor issues.",
      "Confidently and accurately applies escape strategies to complex scenarios.",
      "Demonstrates exceptional ability to adapt and apply escape strategies to novel and challenging scenarios, providing nuanced solutions."
    ]
  ]
}