{
  "criteria": [
    "Understanding of the Dangers of Substance Use",
    "Effectiveness in Encouraging Others",
    "Advocacy and Promotion of a Healthy Lifestyle"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the risks associated with alcohol, tobacco, and other drugs.",
      "Shows a limited awareness of the dangers, with significant misconceptions.",
      "Understands some basic risks but lacks depth in knowledge about the various health and social consequences.",
      "Displays a solid understanding of the health and social risks linked to substance use.",
      "Exhibits a comprehensive understanding of the short-term and long-term risks, including addiction and mental health impacts.",
      "Demonstrates exceptional knowledge and can articulate the nuanced risks of substance use, including the impact on brain development and societal issues."
    ],
    [
      "Does not attempt to encourage others or inadvertently promotes substance use.",
      "Attempts to discourage others but uses ineffective or harmful strategies.",
      "Offers basic encouragement but lacks persuasive arguments or tailored advice.",
      "Provides clear and supportive encouragement, using factual information and empathy.",
      "Demonstrates strong communication skills and offers personalized strategies to help others avoid substance use.",
      "Serves as a role model and employs highly effective, compassionate strategies to empower others to make healthy choices, tailoring advice to individual needs and circumstances."
    ],
    [
      "Does not advocate for a substance-free lifestyle.",
      "Mentions the importance of healthy choices but does not actively promote them.",
      "Participates in limited activities promoting a substance-free lifestyle.",
      "Actively promotes a healthy, substance-free lifestyle through personal actions and encouraging peers.",
      "Engages in advocacy efforts within the school or community to raise awareness about the benefits of avoiding substance use.",
      "Leads and organizes initiatives to create a supportive environment that discourages substance use and empowers others to make healthy choices, demonstrating leadership and commitment."
    ]
  ]
}