{
  "criteria": [
    "Identification of Inspiration Sources",
    "Development and Manipulation of Movement Elements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any sources of inspiration for choreography or provides irrelevant responses.",
      "The student identifies one source of inspiration, but the connection to choreography is unclear or superficial.",
      "The student identifies at least two sources of inspiration, with a basic understanding of their potential use in choreography.",
      "The student identifies several sources of inspiration (e.g., music, text, images) and explains how they could be used to generate choreographic ideas.",
      "The student identifies a variety of sources of inspiration and provides specific examples of how they can be transformed into movement for artistic expression.",
      "The student demonstrates a deep understanding of diverse inspiration sources, offering insightful and original ideas for their application in choreography, showcasing innovative potential."
    ],
    [
      "The student fails to develop a movement problem or manipulate dance elements effectively.",
      "The student develops a vague movement problem and attempts to manipulate one or two dance elements with limited success.",
      "The student defines a movement problem and manipulates a few dance elements (e.g., time, space, energy) to explore potential solutions.",
      "The student clearly defines a movement problem and effectively manipulates multiple dance elements to find a creative solution, demonstrating some awareness of artistic expression.",
      "The student expertly manipulates a wide range of dance elements to create a compelling and artistic solution to the movement problem, showing a clear understanding of choreographic principles.",
      "The student demonstrates exceptional creativity and skill in manipulating dance elements to solve a complex movement problem, resulting in a highly refined and artistically expressive choreographic solution."
    ]
  ]
}