{
  "criteria": [
    "Understanding of Puberty and Physical Development Variation",
    "Explanation of Normal Development",
    "Application of Knowledge to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the variability in puberty and physical development.",
      "Demonstrates a minimal understanding of the variability in puberty and physical development, with significant misconceptions.",
      "Demonstrates a basic understanding of the variability in puberty and physical development, but struggles to explain specific examples.",
      "Demonstrates a satisfactory understanding of the variability in puberty and physical development, providing some examples.",
      "Demonstrates a strong understanding of the variability in puberty and physical development, providing clear and accurate examples.",
      "Demonstrates a comprehensive understanding of the variability in puberty and physical development, providing insightful examples and explaining factors that contribute to individual differences."
    ],
    [
      "Unable to explain what constitutes normal physical development during puberty.",
      "Provides a very limited explanation of normal physical development during puberty, with significant inaccuracies.",
      "Provides a basic explanation of normal physical development during puberty, but struggles with details and nuances.",
      "Provides a satisfactory explanation of normal physical development during puberty, covering key aspects.",
      "Provides a clear and accurate explanation of normal physical development during puberty, demonstrating a solid understanding.",
      "Provides a comprehensive and nuanced explanation of normal physical development during puberty, addressing potential anxieties and misconceptions."
    ],
    [
      "Unable to apply knowledge of puberty and physical development to real-life scenarios or examples.",
      "Demonstrates difficulty applying knowledge of puberty and physical development to real-life scenarios; responses are often irrelevant or incorrect.",
      "Can apply knowledge of puberty and physical development to simple real-life scenarios, but struggles with more complex situations.",
      "Can apply knowledge of puberty and physical development to a variety of real-life scenarios with reasonable accuracy.",
      "Confidently applies knowledge of puberty and physical development to real-life scenarios, demonstrating sound judgment and understanding.",
      "Skillfully applies knowledge of puberty and physical development to complex and nuanced real-life scenarios, showing empathy and critical thinking."
    ]
  ]
}