{
  "criteria": [
    "Identification of Personal Hygiene Needs",
    "Explanation of the Importance of Hygiene Practices",
    "Application of Knowledge to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any personal hygiene needs associated with puberty.",
      "The student identifies one basic personal hygiene need associated with puberty.",
      "The student identifies some personal hygiene needs, but with limited detail or accuracy.",
      "The student identifies several personal hygiene needs associated with puberty with reasonable detail and accuracy.",
      "The student comprehensively identifies most personal hygiene needs associated with puberty with good detail and accuracy.",
      "The student comprehensively and accurately identifies personal hygiene needs associated with puberty, demonstrating a thorough understanding."
    ],
    [
      "The student does not explain the importance of any hygiene practices.",
      "The student offers a minimal explanation of the importance of one hygiene practice.",
      "The student provides a limited explanation of the importance of some hygiene practices, lacking depth.",
      "The student explains the importance of several hygiene practices associated with puberty, with some depth and clarity.",
      "The student clearly and thoroughly explains the importance of most hygiene practices, demonstrating a good understanding of their impact.",
      "The student articulately and comprehensively explains the importance of hygiene practices associated with puberty, demonstrating a deep understanding of their impact on health and well-being."
    ],
    [
      "The student does not apply knowledge to any real-life scenarios.",
      "The student attempts to apply knowledge to a real-life scenario but with limited success.",
      "The student applies knowledge to simple real-life scenarios, but with some inaccuracies or omissions.",
      "The student applies knowledge to a range of real-life scenarios related to personal hygiene during puberty, with reasonable accuracy.",
      "The student effectively applies knowledge to complex real-life scenarios, demonstrating a strong understanding of how to maintain personal hygiene during puberty.",
      "The student skillfully applies knowledge to various complex real-life scenarios, offering insightful and practical advice on maintaining optimal personal hygiene during puberty."
    ]
  ]
}