{
  "criteria": [
    "Understanding of Environmental Responsibility",
    "Explanation of Environmental Impact",
    "Advocacy and Promotion of Environmental Stewardship"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the responsibility individuals have in protecting the environment.",
      "The student shows a limited understanding, primarily mentioning obvious issues like littering without deeper engagement.",
      "The student identifies some responsibilities but struggles to explain why they are important or how they impact the environment.",
      "The student adequately explains individual responsibilities and provides some reasons for their importance, but lacks depth.",
      "The student clearly articulates individual responsibilities, providing well-reasoned explanations and examples of their impact on environmental preservation.",
      "The student demonstrates a comprehensive understanding, explaining responsibilities in detail and offering innovative solutions for environmental protection with clear reasoning."
    ],
    [
      "The student fails to connect individual actions to the health and preservation of the environment.",
      "The student vaguely mentions environmental impact but cannot provide specific examples or connections.",
      "The student identifies some environmental impacts but struggles to explain the cause-and-effect relationship between individual actions and these impacts.",
      "The student accurately explains the impact of individual actions on the environment, providing basic cause-and-effect relationships.",
      "The student thoroughly explains the impact of various individual behaviors on the environment, providing specific and detailed examples with clear cause-and-effect analysis.",
      "The student provides an insightful and detailed explanation of environmental impacts, including nuanced cause-and-effect relationships and proposing preventative strategies. They also demonstrate foresight regarding long-term impacts."
    ],
    [
      "The student does not demonstrate any capacity or willingness to promote environmental stewardship.",
      "The student shows a basic awareness but does not actively suggest ways to encourage others to protect the environment.",
      "The student identifies some methods for promoting environmental protection but does not fully develop their ideas or explain how to implement them.",
      "The student suggests practical ways to promote environmental stewardship, explaining how these methods can be effective in encouraging responsible behavior.",
      "The student persuasively advocates for environmental stewardship, providing specific, actionable strategies that demonstrate a strong understanding of effective advocacy.",
      "The student passionately advocates for environmental stewardship, offering unique, comprehensive strategies and demonstrating exceptional leadership qualities and the potential to inspire widespread environmental action."
    ]
  ]
}