{
  "criteria": [
    "Understanding and Articulation of Personal Boundaries",
    "Recognition of Universal Right",
    "Application and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of personal boundaries or the right to establish them.",
      "Shows minimal understanding of personal boundaries; struggles to articulate the concept.",
      "Displays a basic understanding of personal boundaries but has difficulty explaining their importance or relevance.",
      "Demonstrates a clear understanding of personal boundaries and can explain their importance in some contexts.",
      "Exhibits a strong understanding of personal boundaries, clearly articulating their importance and providing relevant examples.",
      "Demonstrates a comprehensive understanding of personal boundaries, articulates their importance across various contexts, and demonstrates insightful application."
    ],
    [
      "Fails to recognize that everyone has the right to establish personal boundaries.",
      "Shows limited recognition that everyone has the right to establish personal boundaries; may express reservations or biases.",
      "Recognizes that everyone has the right to establish personal boundaries, but with limited conviction or understanding.",
      "Generally recognizes that everyone has the right to establish personal boundaries and can explain this right in simple terms.",
      "Strongly recognizes and supports the universal right to establish personal boundaries, articulating the importance of this right for all individuals.",
      "Demonstrates profound recognition and advocacy for the universal right to establish personal boundaries, promoting inclusivity and respect for individual autonomy in all situations."
    ],
    [
      "Unable to provide any examples or apply the concept of personal boundaries to real-life scenarios.",
      "Struggles to provide relevant examples of personal boundaries or their application.",
      "Provides limited or generic examples of personal boundaries with unclear application.",
      "Provides relevant examples of personal boundaries and their application in common scenarios.",
      "Provides insightful and diverse examples of personal boundaries, demonstrating their application in various situations.",
      "Demonstrates exceptional ability to apply the concept of personal boundaries to complex situations, offering nuanced and practical solutions."
    ]
  ]
}