{
  "criteria": [
    "Understanding the Physical Changes of Puberty",
    "Understanding the Emotional and Psychological Changes of Puberty",
    "Discusses the Effects of Puberty on Thoughts, Emotions and Behaviors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of physical changes during puberty.",
      "Identifies a few physical changes but lacks detail or accuracy.",
      "Describes some physical changes during puberty with basic accuracy.",
      "Explains several physical changes during puberty with good accuracy and detail.",
      "Comprehensively explains physical changes during puberty with thorough detail and accuracy, demonstrating a solid understanding.",
      "Masterfully explains physical changes during puberty with exceptional detail, accuracy, and insightful connections to overall health and well-being."
    ],
    [
      "Demonstrates no understanding of emotional or psychological changes during puberty.",
      "Identifies a few emotional or psychological changes but lacks detail or accuracy.",
      "Describes some emotional or psychological changes during puberty with basic accuracy.",
      "Explains several emotional and psychological changes during puberty with good accuracy and detail.",
      "Comprehensively explains emotional and psychological changes during puberty with thorough detail and accuracy, demonstrating a solid understanding.",
      "Masterfully explains emotional and psychological changes during puberty with exceptional detail, accuracy, and insightful connections to personal development and relationships."
    ],
    [
      "Makes no attempt to discuss effects of puberty on thoughts, emotions or behaviors.",
      "Briefly mentions effects of puberty on either thoughts, emotions, or behaviors, but lacks specifics.",
      "Offers a general discussion of the effects of puberty on thoughts, emotions, and behaviors.",
      "Provides a detailed discussion of how puberty affects thoughts, emotions, and behaviors.",
      "Illustrates understanding and demonstrates insight into how changes during puberty affect thoughts, emotions, and behaviors.",
      "Demonstrates a sophisticated understanding of the impact of puberty on thoughts, emotions, and behaviors. Provides nuanced insights, potentially including personal reflections or connections to broader societal trends."
    ]
  ]
}