{
  "criteria": [
    "Identification of Advertising Techniques",
    "Explanation of Influence on Choices",
    "Use of Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any advertising or marketing techniques.",
      "The student identifies one or two advertising or marketing techniques with limited accuracy.",
      "The student identifies some common advertising or marketing techniques with moderate accuracy.",
      "The student accurately identifies common advertising and marketing techniques used in food and beverage advertising.",
      "The student accurately identifies a variety of advertising and marketing techniques, including subtle methods, used in food and beverage advertising.",
      "The student expertly identifies a wide range of advertising and marketing techniques and can provide examples of their use in different food and beverage contexts."
    ],
    [
      "The student does not explain how advertising or marketing influences food and beverage choices.",
      "The student offers a vague or inaccurate explanation of how advertising or marketing can influence choices.",
      "The student provides a basic explanation of how advertising and marketing influence choices, but lacks depth.",
      "The student explains how advertising and marketing techniques can influence food and beverage choices with reasonable detail.",
      "The student clearly explains how advertising and marketing techniques influence food and beverage choices, including psychological and emotional appeals.",
      "The student comprehensively explains how advertising and marketing techniques manipulate and influence food and beverage choices, including a nuanced understanding of target demographics."
    ],
    [
      "The student provides no examples of advertising or marketing techniques.",
      "The student provides one irrelevant or inaccurate example.",
      "The student provides one relevant example, but it is not well-explained.",
      "The student provides two relevant examples to support their explanations.",
      "The student provides multiple clear and relevant examples that effectively support their explanations.",
      "The student provides a diverse range of compelling examples and analyzes their impact on consumer behavior."
    ]
  ]
}