{
  "criteria": [
    "Identification of Trusted Adults",
    "Understanding of the Role of Trusted Adults",
    "Recognition of Diverse Trusted Adults"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any trusted adults or resources for information about puberty.",
      "Student identifies one potential adult resource but does not explain why they are trustworthy or a good source of information.",
      "Student identifies at least one trusted adult (parent, guardian, or other) but provides a vague or unclear explanation as to why they are trustworthy.",
      "Student identifies at least two trusted adults (parents, guardians, or other) and offers a somewhat clear reason for considering them as trustworthy resources.",
      "Student clearly identifies at least two trusted adults (parents, guardians, and\/or other trusted adults) and provides a clear and reasonable explanation for considering them trustworthy resources for puberty information.",
      "Student clearly identifies multiple trusted adults and provides a detailed and insightful explanation for considering them reliable resources for puberty information, demonstrating an understanding of the importance of trusted sources."
    ],
    [
      "Student demonstrates no understanding of why trusted adults are important resources for information about puberty.",
      "Student vaguely mentions the importance of trusted adults but provides no specific reasons related to puberty information.",
      "Student lists at least one reason why trusted adults may be valuable resources for puberty information.",
      "Student lists at least two reasons why trusted adults may be valuable resources for puberty information, such as their experience or knowledge.",
      "Student clearly explains several reasons why parents, guardians, and other trusted adults are important resources for puberty information, including their experience, knowledge, and support.",
      "Student provides a comprehensive explanation of the role of trusted adults in providing accurate and supportive information about puberty, demonstrating a mature understanding of responsible decision-making."
    ],
    [
      "The student fails to identify a diverse range of trusted adults, focusing on one type of figure.",
      "The student suggests an expanded list of trusted adults but with a simplistic point of view.",
      "The student suggests parents or guardians as the only source of information.",
      "The student begins to see beyond parents and guardians and can explain why more people are considered in their list.",
      "The student can list at least three different types of adults that would be considered trusted with a complete and reasonable point of view.",
      "The student provides a list of more than three trusted adults including parents, guardians, other relatives, teachers, counselors, religious figures, etc. with a deep insight as to why they might be considered trusted."
    ]
  ]
}