{
  "criteria": [
    "Identification of Influences",
    "Communication Skills",
    "Strategies for Dealing with Influences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any influences from peers or media on food choices and physical activity.",
      "Identifies limited influences from peers or media on food choices and physical activity, lacking detail or accuracy.",
      "Identifies some influences from peers or media on food choices and physical activity, with basic explanations.",
      "Identifies several influences from peers and media on food choices and physical activity, providing clear examples.",
      "Identifies a wide range of influences from peers and media on food choices and physical activity, offering detailed explanations and relevant examples.",
      "Comprehensively identifies and analyzes diverse influences from peers and media, demonstrating a nuanced understanding of their impact on food choices and physical activity with insightful examples."
    ],
    [
      "Demonstrates no effective communication skills in addressing peer or media influences.",
      "Demonstrates limited communication skills; struggles to articulate thoughts or ideas related to peer or media influences.",
      "Demonstrates basic communication skills; can express simple ideas related to peer or media influences but lacks clarity or confidence.",
      "Demonstrates effective communication skills; clearly articulates thoughts and ideas related to peer or media influences, showing confidence.",
      "Demonstrates highly effective communication skills; persuasively articulates thoughts and ideas, adapting communication style to different audiences.",
      "Demonstrates exceptional communication skills; masterfully communicates complex ideas with clarity and confidence, effectively influencing others and fostering constructive dialogue."
    ],
    [
      "Does not suggest any strategies for dealing with negative peer or media influences.",
      "Suggests ineffective or inappropriate strategies for dealing with negative peer or media influences.",
      "Suggests basic strategies for dealing with negative peer or media influences, but lacks detail or practicality.",
      "Suggests realistic and relevant strategies for dealing with negative peer or media influences, providing clear explanations.",
      "Suggests a variety of effective strategies for dealing with negative peer or media influences, adapting strategies to different situations and audiences.",
      "Develops innovative and highly effective strategies for dealing with negative peer or media influences, demonstrating a deep understanding of behavior change techniques."
    ]
  ]
}