{
  "criteria": [
    "Understanding and expressing healthy friendship dynamics.",
    "Understanding and expressing attraction in a healthy and respectful manner.",
    "Understanding and expressing affection in a healthy and respectful manner."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of healthy friendship dynamics.",
      "Struggles to identify or express components of healthy friendships.",
      "Identifies some aspects of healthy friendships, like sharing or spending time together, but doesn't express further.",
      "Describes qualities of healthy friendships such as respect, communication, and trust.",
      "Explains and provides examples of key components of healthy friendships and gives some examples.",
      "Demonstrates a thorough understanding of healthy friendships, including communication, respect, trust, boundaries, and mutual support with multiple examples."
    ],
    [
      "Demonstrates no understanding of healthy attraction.",
      "Struggles to define or express attraction in an appropriate way.",
      "Acknowledges attraction but struggles to articulate respectful expression.",
      "Describes ways to express attraction that are generally respectful, but lacks detail.",
      "Explains respectful ways to express attraction, considering consent and boundaries with examples.",
      "Demonstrates comprehensive understanding, articulating nuanced and respectful expressions of attraction, emphasizing consent, and emotional intelligence."
    ],
    [
      "Demonstrates no understanding of healthy affection.",
      "Struggles to define or express affection in an appropriate way.",
      "Acknowledges affection but struggles to articulate respectful expression.",
      "Describes ways to express affection that are generally respectful, but lacks detail.",
      "Explains respectful ways to express affection, considering consent and boundaries with examples.",
      "Demonstrates comprehensive understanding, articulating nuanced and respectful expressions of affection, emphasizing consent, and emotional intelligence."
    ]
  ]
}