{
  "criteria": [
    "Identifying Health Choices: Demonstrates the ability to recognize personal choices impacting health.",
    "Applying Decision-Making Process: Employs a structured approach to evaluate health choices.",
    "Promoting Health: Demonstrates how choices promote personal, environmental, and community health."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any personal choices related to health or demonstrates no understanding of the concept.",
      "Identifies one or two personal choices that may impact health but lacks detail or clarity.",
      "Identifies some personal choices affecting health, but explanation is superficial and lacks depth.",
      "Identifies several personal choices affecting health, providing a basic explanation of their impact.",
      "Clearly identifies various personal choices affecting personal, environmental, and community health with detailed explanations.",
      "Exemplifies a comprehensive understanding by identifying numerous personal choices and thoroughly explaining their impact on personal, environmental, and community health, including potential long-term consequences."
    ],
    [
      "Does not apply any decision-making process to evaluate health choices.",
      "Attempts to apply a decision-making process but demonstrates minimal effort or understanding.",
      "Applies a basic decision-making process with limited analysis of potential outcomes.",
      "Applies a decision-making process to evaluate health choices, considering some relevant factors.",
      "Skillfully applies a comprehensive decision-making process, thoroughly evaluating various factors and potential outcomes related to health choices.",
      "Masterfully utilizes a sophisticated decision-making process, critically evaluating all factors and potential outcomes, demonstrating foresight in anticipating long-term impacts and adapting strategies accordingly."
    ],
    [
      "Fails to demonstrate how personal choices can promote health.",
      "Shows a minimal understanding of how personal choices relate to promoting health.",
      "Describes some ways personal choices can promote health, but lacks specificity.",
      "Explains how personal choices can promote personal health with some reference to environmental or community health.",
      "Clearly explains how personal choices promote personal, environmental, and community health with supporting evidence.",
      "Provides a nuanced and insightful explanation of how personal choices significantly promote personal, environmental, and community health, integrating innovative strategies and considering diverse perspectives."
    ]
  ]
}