{
  "criteria": [
    "Understanding of Personal Boundaries",
    "Identification of Boundary Types",
    "Importance of Boundaries for Healthy Relationships"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of personal boundaries or their importance.",
      "Student shows a minimal understanding of personal boundaries but struggles to explain their importance.",
      "Student identifies personal boundaries but provides a limited description of their importance.",
      "Student describes personal boundaries and their importance, but lacks depth or specific examples.",
      "Student thoroughly describes personal boundaries and clearly explains their importance with relevant examples.",
      "Student comprehensively describes personal boundaries, articulates their importance with insightful examples, and demonstrates an advanced understanding of their impact on relationships and well-being."
    ],
    [
      "Student cannot identify any types of personal boundaries.",
      "Student identifies only one type of personal boundary with limited accuracy.",
      "Student identifies a few types of personal boundaries but struggles with clear definitions.",
      "Student identifies several types of personal boundaries and provides basic definitions.",
      "Student accurately identifies and defines various types of personal boundaries (e.g., physical, emotional, intellectual).",
      "Student expertly identifies, defines, and provides nuanced examples of various types of personal boundaries, demonstrating a sophisticated understanding."
    ],
    [
      "Student fails to recognize the connection between personal boundaries and healthy relationships.",
      "Student vaguely mentions the connection between boundaries and relationships but lacks clarity.",
      "Student identifies that boundaries can impact relationships, but does not clearly explain how.",
      "Student explains how personal boundaries contribute to healthy relationships with limited detail.",
      "Student clearly explains how personal boundaries promote respect, trust, and communication in healthy relationships.",
      "Student insightfully analyzes the crucial role of personal boundaries in fostering and maintaining healthy, fulfilling relationships, including specific examples of positive outcomes."
    ]
  ]
}