{
  "criteria": [
    "Understanding of Sun's Harmful Effects",
    "Application of Protective Strategies",
    "Consistency and Awareness of Protective Measures"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the sun's harmful effects (e.g., sunburn, skin cancer, premature aging).",
      "Shows limited awareness of the sun's harmful effects, with significant misconceptions.",
      "Identifies some of the sun's harmful effects but lacks depth in understanding.",
      "Understands the common harmful effects of the sun and can explain them generally.",
      "Demonstrates a strong understanding of the sun's harmful effects, including specific examples and long-term consequences.",
      "Exhibits comprehensive knowledge of the sun's harmful effects, including different types of UV radiation and their impact on the skin and body."
    ],
    [
      "Does not identify any strategies to protect against the sun's harmful effects.",
      "Suggests ineffective or inappropriate protective strategies.",
      "Identifies one or two basic protective strategies (e.g., sunscreen) but lacks detail.",
      "Lists several common protective strategies (e.g., sunscreen, hats, sunglasses) but may not apply them correctly.",
      "Explains and applies multiple protective strategies effectively, including proper use of sunscreen and appropriate clothing.",
      "Demonstrates consistent and correct application of comprehensive protective strategies, including seeking shade and planning outdoor activities during low UV index times."
    ],
    [
      "Shows no intention to use protective measures regularly.",
      "Expresses reluctance or disinterest in using protective measures.",
      "Acknowledges the importance of protective measures but does not demonstrate consistent use.",
      "Indicates an intention to use protective measures regularly but may forget or skip them occasionally.",
      "Consistently uses protective measures when exposed to the sun and actively seeks information about UV levels.",
      "Advocates for the consistent use of protective measures among peers and family members, emphasizing the long-term benefits and promoting sun safety."
    ]
  ]
}