{
  "criteria": [
    "Understanding of Physical Changes: Demonstrates comprehension of the physical changes occurring during puberty and their impact on the body.",
    "Personal Hygiene Practices: Actively engages in and explains the importance of maintaining personal hygiene during puberty.",
    "Emotional and Social Development: Demonstrates an awareness of the emotional and social challenges during puberty and employs healthy coping strategies.",
    "Healthy Relationships: Understands the importance of healthy relationships during puberty and demonstrates respectful communication skills."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the physical changes during puberty.",
      "Demonstrates minimal understanding of physical changes, with significant misconceptions.",
      "Displays basic understanding of some physical changes but lacks depth.",
      "Exhibits satisfactory understanding of most physical changes and their effects.",
      "Shows a strong understanding of physical changes, including less common developments.",
      "Demonstrates comprehensive understanding of all physical changes during puberty and can explain their implications in detail."
    ],
    [
      "Does not engage in personal hygiene practices or understand their importance.",
      "Rarely engages in personal hygiene practices, with limited understanding of their importance.",
      "Engages in some personal hygiene practices but inconsistently or without full understanding.",
      "Regularly engages in personal hygiene practices and understands their importance.",
      "Consistently engages in thorough personal hygiene practices and can explain the health benefits.",
      "Models and promotes excellent personal hygiene practices, explaining the benefits and demonstrating proper techniques."
    ],
    [
      "Shows no awareness of emotional and social challenges during puberty.",
      "Displays minimal awareness of emotional and social changes, with limited coping strategies.",
      "Recognizes some emotional and social challenges but struggles to manage them effectively.",
      "Understands and manages most emotional and social challenges with reasonable effectiveness.",
      "Exhibits strong emotional and social awareness and effectively employs healthy coping strategies.",
      "Demonstrates exceptional emotional and social intelligence, providing support to peers and advocating for mental well-being."
    ],
    [
      "Does not understand the importance of healthy relationships or demonstrate respectful communication skills.",
      "Demonstrates minimal understanding of healthy relationships, with ineffective communication skills.",
      "Displays basic understanding of some aspects of healthy relationships but struggles with consistent respectful communication.",
      "Understands the importance of healthy relationships and demonstrates reasonably respectful communication skills.",
      "Shows a strong understanding of healthy relationships and consistently communicates respectfully.",
      "Models and promotes healthy relationships, demonstrating exceptional communication skills and empathy."
    ]
  ]
}