{
  "criteria": [
    "Understanding of Healthy Eating and Physical Activity Guidelines",
    "Ability to Encourage Healthy Eating and Increased Physical Activity",
    "Promotion of Opportunities at School and in the Community"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of healthy eating guidelines or the importance of physical activity.",
      "Demonstrates a limited understanding of healthy eating or physical activity guidelines.",
      "Demonstrates a basic understanding of healthy eating and physical activity guidelines, but struggles to apply them.",
      "Demonstrates a satisfactory understanding of healthy eating and physical activity guidelines and can apply them in some situations.",
      "Demonstrates a strong understanding of healthy eating and physical activity guidelines and can apply them effectively in various situations.",
      "Demonstrates a comprehensive understanding of healthy eating and physical activity guidelines and can apply them effectively and creatively in various situations."
    ],
    [
      "Shows no initiative to encourage healthy eating or physical activity.",
      "Makes minimal attempts to encourage healthy eating or physical activity.",
      "Occasionally encourages healthy eating or physical activity, but lacks consistency.",
      "Regularly encourages healthy eating and physical activity among peers and in the community.",
      "Actively promotes healthy eating and physical activity through various initiatives.",
      "Leads and inspires others to adopt healthy eating habits and increase physical activity opportunities."
    ],
    [
      "Does not contribute to promoting healthy opportunities at school or in the community.",
      "Participates passively in promoting healthy opportunities at school or in the community.",
      "Occasionally participates in promoting healthy opportunities at school or in the community.",
      "Actively participates in promoting existing healthy opportunities and suggests new ones.",
      "Leads initiatives to create and promote healthy opportunities at school and in the community.",
      "Develops and implements innovative programs to promote healthy eating and increased physical activity opportunities with measurable impact."
    ]
  ]
}