{
  "criteria": [
    "Understanding of Environmental Pollution:",
    "Ability to Encourage Others:",
    "Practical Application of Knowledge:"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of what constitutes pollution or its impact on the environment.",
      "Shows a minimal understanding of pollution, with difficulty identifying different types and their sources.",
      "Displays a basic understanding of pollution and can identify some common types, but struggles to explain the effects.",
      "Exhibits a clear understanding of various types of pollution and their effects on the environment and human health.",
      "Demonstrates a comprehensive understanding of pollution, including its systemic impacts and the interconnectedness of environmental issues.",
      "Shows exceptional understanding, including nuances of pollution impacts, and can articulate complex relationships between pollution and ecological balance."
    ],
    [
      "Does not attempt to encourage others to minimize pollution.",
      "Attempts to encourage others but does so ineffectively or without clear messaging.",
      "Encourages others through basic methods, like reminders, but lacks persuasive techniques or specific examples.",
      "Encourages others using various techniques, providing relevant examples and explaining the importance of minimizing pollution.",
      "Actively and effectively encourages others by tailoring messages to different audiences and using persuasive strategies.",
      "Serves as a role model in encouraging others, creating innovative campaigns, and demonstrating exceptional leadership in pollution minimization efforts."
    ],
    [
      "Does not demonstrate any actions that minimize pollution in practical situations.",
      "Shows minimal effort in applying knowledge to minimize pollution; actions are infrequent or inconsistent.",
      "Applies some knowledge to minimize pollution, but the actions are limited and not consistently maintained.",
      "Regularly applies knowledge to minimize pollution in various situations, adapting behavior and making conscious choices.",
      "Consistently and effectively applies knowledge, taking proactive steps to reduce pollution in personal and community settings.",
      "Initiates and leads efforts to apply knowledge on a broader scale, creating projects and inspiring community-wide change in pollution minimization."
    ]
  ]
}