{
  "criteria": [
    "Demonstrates the ability to identify and utilize diverse stimuli for choreographic inspiration.",
    "Effectively constructs and solves movement problems to generate original choreographic content.",
    "Exploration and experimentation with movement vocabulary"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No identifiable stimuli are used or the source is irrelevant to the choreographic task.",
      "Identifies a single source of inspiration, but demonstrates little understanding of its potential for movement generation.",
      "Utilizes one source effectively or multiple sources superficially, showing a basic understanding of their connection to movement.",
      "Integrates a few stimuli effectively, demonstrating a moderate understanding of how different sources can inform choreographic choices.",
      "Skillfully combines multiple stimuli, showing a strong understanding of how diverse sources enrich choreographic content.",
      "Masterfully synthesizes a wide range of stimuli, innovatively transforming sources into compelling and original movement ideas, demonstrating deep insight."
    ],
    [
      "Does not attempt to construct or solve movement problems, or the attempts are completely irrelevant.",
      "Attempts to construct a movement problem, but the solution is unclear or undeveloped.",
      "Constructs a simple movement problem and offers a basic solution, but lacks complexity or originality.",
      "Develops several movement problems and presents adequate solutions, demonstrating a reasonable grasp of choreographic principles.",
      "Creates complex and engaging movement problems, providing thoughtful and inventive solutions that enhance the choreographic idea.",
      "Innovatively designs challenging movement problems and executes exceptional solutions, resulting in highly original and sophisticated choreographic content."
    ],
    [
      "No exploration of movement vocabulary is evident.",
      "Limited exploration of movement; vocabulary is basic and unvaried.",
      "Some exploration of movement is evident; vocabulary is somewhat varied but lacks depth.",
      "Adequate exploration of movement; vocabulary is varied and demonstrates some creativity.",
      "Thorough exploration of movement; vocabulary is highly varied and demonstrates creativity and risk-taking.",
      "Extensive and innovative exploration of movement; vocabulary is highly original and demonstrates exceptional creativity and risk-taking."
    ]
  ]
}