{
  "criteria": [
    "Understanding of the specific health benefits associated with avoiding tobacco in the environment.",
    "Awareness of the broader environmental and societal benefits of tobacco-free policies.",
    "Ability to articulate the benefits of tobacco-free environment to different audiences."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the health benefits of a tobacco-free environment.",
      "Identifies one or two vague health benefits with little explanation.",
      "Lists a few health benefits (e.g., reduced lung cancer risk) but lacks detail or specific examples.",
      "Explains several health benefits of a tobacco-free environment, such as reduced respiratory issues and improved air quality, providing basic details.",
      "Clearly explains multiple health benefits, including specific examples and some quantitative data (e.g., statistics on reduced asthma rates).",
      "Provides a comprehensive and nuanced explanation of numerous health benefits, including long-term impacts and supporting data. Demonstrates a deep understanding of the science behind the benefits."
    ],
    [
      "Shows no awareness of environmental or societal benefits.",
      "Mentions only the personal health benefits, with no regard for the larger context.",
      "Vaguely mentions an environmental or societal benefit, but does not elaborate.",
      "Identifies one or two environmental or societal benefits (e.g., reduced litter, cost savings) with a brief explanation.",
      "Clearly explains several environmental and societal benefits, such as reduced pollution and decreased healthcare costs, with specific examples.",
      "Presents a thorough analysis of the wide-ranging environmental and societal impacts of tobacco-free policies, including economic, ecological, and social justice aspects."
    ],
    [
      "Is unable to express any benefits of tobacco-free environment.",
      "Struggles to articulate any benefits and presents them unclearly.",
      "States the benefits, but the explanation lacks coherence and is difficult to follow.",
      "Explains the benefits in a way that is understandable, using correct terminology.",
      "Communicates the benefits clearly and effectively to different audiences, using examples and data.",
      "Presents a sophisticated and persuasive articulation of the benefits, tailoring their message to different audiences and anticipating counterarguments."
    ]
  ]
}