{
  "criteria": [
    "Understanding the Stages of Drug Dependence and Addiction",
    "Explaining the Effects of Drugs on the Adolescent Brain",
    "Connecting Stages of Addiction to Effects on the Brain"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the stages of drug dependence and addiction.",
      "The student can name a stage of the cycle, but does not understand it or the order it exists in.",
      "The student identifies some stages of drug dependence and addiction with limited accuracy, showing a fragmented understanding of the process.",
      "The student accurately describes several stages of drug dependence and addiction, demonstrating a moderate understanding of the cyclical nature of addiction.",
      "The student comprehensively explains most stages of drug dependence and addiction with a clear understanding of the cyclical progression and related factors.",
      "The student demonstrates an expert understanding of all stages of drug dependence and addiction, clearly articulating the cyclical progression, related factors, and potential variability among individuals."
    ],
    [
      "The student does not discuss the effects of drugs on the adolescent brain.",
      "The student mentions that drugs might affect the brain, but does not elaborate on the effects.",
      "The student identifies one or two effects of drugs on the adolescent brain with limited explanation.",
      "The student accurately explains several effects of drugs on the adolescent brain, demonstrating a general understanding of neurological impact.",
      "The student comprehensively explains multiple effects of drugs on the adolescent brain, demonstrating a clear understanding of specific neurological impacts and potential long-term consequences.",
      "The student demonstrates an expert understanding of the complex effects of drugs on the adolescent brain, detailing specific neurological impacts, long-term consequences, and the heightened vulnerability of the adolescent brain compared to adults."
    ],
    [
      "The student does not attempt to connect the stages of drug dependence with its effect on the brain.",
      "The student attempts to make a connection between stage and effect, but demonstrates an innacurate understanding.",
      "The student makes superficial connections between stages of drug dependence and the effects on the adolescent brain, but lacks depth and detail.",
      "The student connects specific stages of drug dependence with corresponding effects on the adolescent brain, demonstrating a moderate understanding of the relationship between addiction progression and neurological changes.",
      "The student clearly and accurately connects most stages of drug dependence with detailed effects on the adolescent brain, demonstrating a strong understanding of how addiction progression leads to specific neurological changes and potential long-term damage.",
      "The student expertly connects all stages of drug dependence with comprehensive explanations of the effects on the adolescent brain, demonstrating a sophisticated understanding of the complex interplay between addiction, neurological changes, individual variability, and potential for recovery."
    ]
  ]
}