{
  "criteria": [
    "Understanding of Alternatives",
    "Application to Real-Life Scenarios",
    "Clarity and Communication"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of positive alternatives to alcohol, tobacco, and other drug use.",
      "Identifies one or two alternatives with limited explanation or understanding.",
      "Identifies a few alternatives, but explanations are superficial and lack depth.",
      "Identifies several alternatives with some explanation of their positive impact, but may lack detail.",
      "Clearly identifies multiple positive alternatives and explains their benefits with reasonable detail and accuracy.",
      "Comprehensively identifies a wide range of positive alternatives, thoroughly explaining their benefits and demonstrating a deep understanding of their impact."
    ],
    [
      "Unable to apply alternatives to real-life scenarios or situations involving substance use.",
      "Attempts to apply alternatives to scenarios, but the application is unrealistic or ineffective.",
      "Applies alternatives to scenarios with limited success or understanding of the potential outcomes.",
      "Applies alternatives to scenarios with reasonable success, demonstrating some understanding of the potential impact.",
      "Effectively applies alternatives to various scenarios, demonstrating a clear understanding of their positive impact and potential outcomes.",
      "Masterfully applies alternatives to complex and diverse scenarios, demonstrating a profound understanding of their positive impact, potential outcomes, and nuanced considerations."
    ],
    [
      "Responses are unclear, disorganized, and difficult to understand.",
      "Responses are somewhat clear but lack organization and coherence.",
      "Responses are generally clear but may contain some ambiguity or lack of focus.",
      "Responses are clear and organized, effectively communicating the identified alternatives and their benefits.",
      "Responses are exceptionally clear, concise, and well-organized, effectively communicating the identified alternatives and their benefits with sophistication.",
      "Responses are exceptionally articulate, persuasive, and insightful, demonstrating mastery of communication skills in conveying the identified alternatives and their benefits."
    ]
  ]
}