{
  "criteria": [
    "Understanding the Physiological Effects of Substance Use on Physical Activity",
    "Understanding the Impact on Athletic Performance",
    "Application to Real-World Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of how alcohol, tobacco, or other drugs affect physical activity.",
      "Student identifies at least one substance (alcohol, tobacco, or other drugs) and vaguely mentions its impact on physical activity with no specific details.",
      "Student identifies at least two substances and generally describes their effects on physical activity (e.g., 'makes you tired').",
      "Student identifies at least two substances and provides somewhat specific effects on physical activity, such as reduced endurance or impaired coordination.",
      "Student identifies alcohol, tobacco, and other drugs, detailing specific physiological effects on physical activity, such as decreased cardiovascular function, muscle weakness, or impaired reaction time.",
      "Student comprehensively identifies alcohol, tobacco, and other drugs, detailing specific physiological effects on physical activity and explains the underlying biological mechanisms. Demonstrates understanding of performance impacts."
    ],
    [
      "Student does not make any connection between substance use and athletic performance.",
      "Student vaguely mentions that substance use is 'bad' for athletic performance without providing reasons.",
      "Student identifies at least one area of athletic performance (e.g., speed, strength) and relates it to substance use in a general way.",
      "Student describes how specific substances impact specific areas of athletic performance (e.g., tobacco reduces lung capacity affecting endurance).",
      "Student provides a detailed explanation of how alcohol, tobacco, and\/or other drugs can impair various aspects of athletic performance, with specific examples.",
      "Student comprehensively discusses how substance use affects multiple facets of athletic performance, including acute and chronic effects. Student provides alternative and suggests ways to mitigate these effects."
    ],
    [
      "Student does not apply their knowledge to real-world scenarios or examples.",
      "Student provides a very general example of substance use affecting someone's physical activity without specific details.",
      "Student offers an example of how substance use could affect physical activity, but the connection is not fully explained.",
      "Student provides a relevant example of how alcohol, tobacco, or other drugs affect physical activity in a specific situation (e.g., sports, exercise).",
      "Student uses multiple examples to demonstrate how alcohol, tobacco, and\/or other drugs impair physical activity, considering various factors like intensity and duration.",
      "Student analyzes scenarios with depth, discussing the short-term and long-term consequences of substance use on physical activity and suggesting ways to prevent or mitigate those consequences. Goes beyond provided material."
    ]
  ]
}