{
  "criteria": [
    "Understanding the concept of emotional awareness",
    "Ability to articulate the benefits of emotional awareness",
    "Application of emotional awareness in real-life scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of emotional awareness or its importance.",
      "The student shows a minimal understanding of emotional awareness, struggling to define it or explain its relevance.",
      "The student can define emotional awareness but provides a limited explanation of its importance.",
      "The student adequately defines emotional awareness and explains its importance in basic terms.",
      "The student clearly defines emotional awareness and explains its importance with relevant examples.",
      "The student provides a comprehensive definition of emotional awareness, thoroughly explains its importance, and offers insightful examples and connections."
    ],
    [
      "The student cannot articulate any benefits of being aware of one's emotions.",
      "The student struggles to name any benefits of emotional awareness, or the benefits mentioned are vague and unclear.",
      "The student can name one or two basic benefits of emotional awareness.",
      "The student can articulate several benefits of emotional awareness, such as improved relationships or stress management.",
      "The student clearly articulates multiple benefits of emotional awareness, providing specific examples and explanations for each.",
      "The student provides a detailed and nuanced explanation of the various benefits of emotional awareness, demonstrating a deep understanding of its impact on personal well-being and relationships."
    ],
    [
      "The student cannot apply the concept of emotional awareness to any real-life scenarios.",
      "The student struggles to connect emotional awareness to real-life situations or provides irrelevant examples.",
      "The student can provide a simple example of how emotional awareness might be relevant in a real-life situation.",
      "The student provides a relevant example of how emotional awareness can be applied in a real-life scenario, explaining its potential impact.",
      "The student describes multiple scenarios where emotional awareness is important, analyzing the potential outcomes in each case.",
      "The student demonstrates a sophisticated understanding of how emotional awareness applies to a variety of complex real-life situations, providing insightful analysis and practical strategies."
    ]
  ]
}