{
  "criteria": [
    "Understanding of Emotional Changes: Demonstrates comprehension of the various emotional changes that occur during adolescence.",
    "Factors Influencing Emotions: Discusses the factors that can influence emotions during adolescence, such as social, hormonal, and environmental influences.",
    "Strategies for Managing Emotions: Suggests healthy strategies for managing emotions during adolescence, such as communication, coping mechanisms, and self-care."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of emotional changes during adolescence.",
      "Identifies one or two emotional changes inaccurately.",
      "Identifies a few emotional changes with limited accuracy and detail.",
      "Accurately identifies several emotional changes during adolescence, providing some detail.",
      "Clearly and accurately explains multiple emotional changes during adolescence with good detail and examples.",
      "Provides a comprehensive and insightful explanation of various emotional changes during adolescence, including nuanced understanding and relevant examples."
    ],
    [
      "Does not discuss any factors influencing emotions during adolescence.",
      "Mentions one factor with no explanation.",
      "Identifies one or two factors with limited explanation.",
      "Discusses a few factors that can influence emotions, providing some explanation.",
      "Clearly explains several factors influencing emotions during adolescence, providing relevant details.",
      "Provides a comprehensive analysis of the factors influencing emotions during adolescence, demonstrating a nuanced understanding of their impact."
    ],
    [
      "Does not suggest any strategies for managing emotions.",
      "Suggests one strategy with no explanation.",
      "Suggests one or two strategies with limited explanation.",
      "Discusses a few strategies for managing emotions, providing some explanation.",
      "Clearly explains several healthy strategies for managing emotions during adolescence, providing relevant details.",
      "Provides a comprehensive and insightful overview of healthy strategies for managing emotions during adolescence, including practical examples and rationale."
    ]
  ]
}