{
  "criteria": [
    "Identification of Internal Influences",
    "Explanation of Effects",
    "Examples and Relevance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No internal influences are identified or the response is irrelevant.",
      "Identifies only one internal influence vaguely or with limited accuracy.",
      "Identifies 2 internal influences but descriptions lack depth or clarity.",
      "Identifies 3 internal influences with reasonable accuracy and some detail.",
      "Identifies at least 4 internal influences accurately and provides clear descriptions.",
      "Identifies multiple (5+) relevant internal influences, providing insightful and comprehensive descriptions of their effects on substance use decisions."
    ],
    [
      "Does not explain how internal influences affect substance use, or explanation is inaccurate.",
      "Offers a minimal explanation of how internal influences affect substance use; lacks clarity or depth.",
      "Explains how some internal influences affect substance use, but connections are superficial.",
      "Clearly explains how several internal influences can affect decisions about alcohol, tobacco, and other drugs.",
      "Provides detailed explanations of how various internal influences impact substance use choices, demonstrating a solid understanding.",
      "Offers nuanced and insightful explanations of the complex ways internal influences affect substance use, including potential interactions between different influences."
    ],
    [
      "No examples are provided, or examples are not relevant to internal influences.",
      "Provides one example that is somewhat relevant but lacks explanation.",
      "Provides a couple of examples that are generally relevant to internal influences.",
      "Offers examples that clearly illustrate how internal influences can impact substance use decisions.",
      "Uses specific and relevant examples to effectively demonstrate the impact of internal influences on substance use.",
      "Provides compelling and insightful examples that highlight the significant role of internal influences in substance use decisions, showing a deep understanding of the topic."
    ]
  ]
}