{
  "criteria": [
    "Understanding the Impact on Personal Safety",
    "Understanding the Impact on Relationships",
    "Understanding the Impact on School Success and Future Goals",
    "Analysis of Impaired Judgment"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how alcohol or marijuana affects personal safety.",
      "Shows a limited understanding of how alcohol or marijuana affects personal safety with significant misconceptions.",
      "Identifies some effects of alcohol or marijuana on personal safety, but explanations are superficial.",
      "Explains several effects of alcohol or marijuana on personal safety with reasonable clarity and accuracy.",
      "Clearly explains multiple effects of alcohol or marijuana on personal safety, providing specific examples and demonstrating a solid understanding.",
      "Provides a comprehensive analysis of the various ways alcohol or marijuana impacts personal safety, including long-term consequences and nuanced situations."
    ],
    [
      "Demonstrates no understanding of how alcohol or marijuana affects relationships with friends and family.",
      "Shows a limited understanding of how alcohol or marijuana affects relationships with friends and family with significant misconceptions.",
      "Identifies some effects of alcohol or marijuana on relationships, but explanations are superficial.",
      "Explains several effects of alcohol or marijuana on relationships with reasonable clarity and accuracy.",
      "Clearly explains multiple effects of alcohol or marijuana on relationships, providing specific examples and demonstrating a solid understanding.",
      "Provides a comprehensive analysis of the various ways alcohol or marijuana impacts relationships, including the effects on trust, communication, and support systems."
    ],
    [
      "Demonstrates no understanding of how alcohol or marijuana affects school success and attainment of present and future goals.",
      "Shows a limited understanding of how alcohol or marijuana affects school success and attainment of present and future goals with significant misconceptions.",
      "Identifies some effects of alcohol or marijuana on school success and future goals, but explanations are superficial.",
      "Explains several effects of alcohol or marijuana on school success and future goals with reasonable clarity and accuracy.",
      "Clearly explains multiple effects of alcohol or marijuana on school success and future goals, providing specific examples and demonstrating a solid understanding.",
      "Provides a comprehensive analysis of the various ways alcohol or marijuana impacts school success and future goals, including the effects on academic performance, career opportunities, and personal development."
    ],
    [
      "Fails to recognize the concept of impaired judgment related to alcohol or marijuana use.",
      "Shows a limited awareness of impaired judgment but struggles to connect it to specific effects or scenarios.",
      "Identifies impaired judgment as a factor but provides limited explanation of how it affects decisions and behaviors.",
      "Explains how impaired judgment results from alcohol or marijuana use and offers some examples of its consequences.",
      "Clearly articulates how impaired judgment affects decision-making in various contexts, providing detailed examples of its impact on safety, relationships, and goals.",
      "Offers a sophisticated analysis of the cognitive and emotional processes underlying impaired judgment, demonstrating a deep understanding of its complex effects on behavior and decision-making."
    ]
  ]
}