{
  "criteria": [
    "Identification of Marketing and Advertising Techniques",
    "Analysis of Role Model Influence",
    "Understanding Effects on ATOD Use"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student fails to identify any marketing or advertising techniques used in the promotion of alcohol, tobacco, or other drugs.",
      "Student identifies one marketing or advertising technique but struggles to explain it or its purpose.",
      "Student identifies a couple of marketing or advertising techniques but provides limited explanation of their use.",
      "Student identifies several common marketing and advertising techniques used to promote alcohol, tobacco, or other drugs.",
      "Student clearly identifies and explains multiple marketing and advertising techniques, providing relevant examples.",
      "Student comprehensively identifies, explains, and provides insightful examples of various marketing and advertising techniques and their persuasive strategies."
    ],
    [
      "Student does not discuss the use of role models in advertising or their potential influence on substance use.",
      "Student mentions role models but does not explain their influence.",
      "Student provides a limited explanation of how role models can influence substance use.",
      "Student explains how role models are used in marketing and advertising to influence behaviors related to alcohol, tobacco, and other drugs.",
      "Student analyzes the impact of role models, including potential positive and negative effects on choices related to substance use.",
      "Student critically evaluates the strategic use of role models in marketing, explaining the psychological and social factors that amplify their influence."
    ],
    [
      "Student demonstrates no understanding of how marketing and advertising influence alcohol, tobacco, and other drug (ATOD) use.",
      "Student shows a basic awareness but does not connect specific techniques to ATOD use.",
      "Student makes general connections between marketing\/advertising and ATOD use but lacks detail.",
      "Student explains how specific marketing and advertising techniques can promote or encourage ATOD use.",
      "Student thoroughly explains the cause-and-effect relationship between marketing\/advertising techniques and the potential for increased ATOD use.",
      "Student synthesizes information to expertly explain and predict the impact of marketing strategies on ATOD use, considering various audience vulnerabilities and long-term consequences."
    ]
  ]
}