{
  "criteria": [
    "Identification of Situations Requiring Help",
    "Understanding the Importance of Trusted Adults",
    "Ability to Identify Trusted Adults",
    "Discussion of potential barriers and solutions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any situations where seeking help from a trusted adult is necessary.",
      "The student identifies one situation vaguely where seeking help might be necessary.",
      "The student identifies a few situations where seeking help from a trusted adult is generally necessary, but lacks specifics.",
      "The student clearly identifies several situations where seeking help from a trusted adult is necessary, providing some specific examples.",
      "The student comprehensively identifies a variety of situations where seeking help from a trusted adult is crucial, offering detailed examples and demonstrating a clear understanding.",
      "The student expertly identifies a broad range of complex situations where seeking help is vital, providing insightful examples and demonstrating nuanced understanding and critical thinking."
    ],
    [
      "The student does not demonstrate any understanding of why seeking help from trusted adults is important.",
      "The student vaguely mentions that seeking help from adults is sometimes a good idea.",
      "The student identifies one or two basic reasons why seeking help from trusted adults is important, such as safety.",
      "The student explains several reasons why seeking help from trusted adults is important, including safety, guidance, and emotional support.",
      "The student thoroughly explains the multifaceted importance of seeking help from trusted adults, providing detailed reasons and showing a strong grasp of the concept.",
      "The student provides an insightful and comprehensive analysis of the importance of seeking help from trusted adults, demonstrating a nuanced understanding and critical thinking about the benefits and potential impacts."
    ],
    [
      "The student cannot identify any trusted adults or does not understand what a trusted adult is.",
      "The student identifies an adult but does not explain why they are considered trustworthy.",
      "The student identifies one or two adults they could trust and gives a superficial reason (e.g., 'they are nice').",
      "The student identifies several adults they could trust and provides reasonable explanations based on characteristics like reliability, experience, and caring nature.",
      "The student thoughtfully identifies a range of adults they could trust and provides insightful explanations based on specific qualities and past experiences, demonstrating a clear understanding of trust.",
      "The student expertly evaluates the concept of trust, identifying numerous trustworthy adults and articulating sophisticated reasons based on ethical considerations, past behaviors, and nuanced understanding of interpersonal dynamics."
    ],
    [
      "The student does not acknowledge any barriers to seeking help.",
      "The student vaguely mentions that it might be hard to ask for help sometimes.",
      "The student identifies one or two potential barriers to seeking help, such as fear or embarrassment.",
      "The student discusses several potential barriers to seeking help and suggests basic solutions, such as practicing asking for help.",
      "The student analyzes multiple barriers to seeking help and proposes well-thought-out solutions, demonstrating a comprehensive understanding of the challenges involved.",
      "The student critically evaluates the complex interplay of barriers to seeking help and offers innovative, context-sensitive solutions, demonstrating exceptional insight and problem-solving skills."
    ]
  ]
}