{
  "criteria": [
    "Understanding the Importance of Reporting",
    "Understanding Legal and Ethical Obligations",
    "Demonstrates Understanding of Peer Influence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of why reporting a found weapon is important.",
      "Shows minimal awareness of the importance of reporting a found weapon.",
      "Identifies some reasons why reporting a found weapon is important, but lacks detail.",
      "Explains several reasons why reporting a found weapon is important with reasonable detail.",
      "Clearly explains the importance of immediately reporting a found weapon, including potential consequences of not reporting.",
      "Provides a comprehensive explanation of the importance of immediately reporting a found weapon, including legal and ethical considerations, and potential impact on school safety and community well-being."
    ],
    [
      "Shows no awareness of legal or ethical obligations related to reporting a found weapon.",
      "Demonstrates limited awareness of legal or ethical considerations.",
      "Identifies that there are legal or ethical obligations, but cannot explain them.",
      "Explains some legal and\/or ethical obligations related to reporting.",
      "Clearly explains both legal and ethical obligations, referencing relevant EC Section 49330 or similar.",
      "Provides a comprehensive explanation of legal and ethical obligations, citing specific regulations and discussing the rationale behind them, while also discussing possible ramifications for not reporting."
    ],
    [
      "Fails to recognize peer influence.",
      "Minimally understands the impact of peer influence.",
      "Identifies some aspects of peer influence, but lacks the ability to explain it clearly",
      "Explains the concept of peer influence and can relate it to the importance of reporting.",
      "Clearly explains the impact of peer influence in a situation where a peer has a weapon and the importance of reporting, despite potential peer pressure.",
      "Offers a sophisticated explanation of peer influence, discussing the challenges of reporting, strategies for overcoming pressure, and the responsibility to prioritize safety over loyalty."
    ]
  ]
}