{
  "criteria": [
    "Clarity and Effectiveness of Verbal Communication",
    "Application of Refusal Skills",
    "Awareness of Context and Situational Factors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of verbal communication skills. Unable to articulate any strategy for avoiding situations involving substance use.",
      "Demonstrates a limited understanding of verbal communication. Struggles to articulate strategies and the strategy provided are not very effective.",
      "Demonstrates some understanding of verbal communication. Can articulate basic strategies but they may not be fully effective or appropriate for all situations.",
      "Demonstrates a satisfactory understanding of verbal communication. Articulates clear and appropriate strategies for avoiding situations involving substance use, but may lack confidence in delivery.",
      "Demonstrates a strong understanding of verbal communication. Effectively articulates and confidently delivers well-reasoned strategies for avoiding situations involving substance use.",
      "Demonstrates an exceptional understanding of verbal communication. Articulates and confidently delivers highly effective, nuanced, and adaptable strategies for avoiding situations involving substance use, demonstrating leadership and influencing skills."
    ],
    [
      "Does not demonstrate any refusal skills or ability to say 'no' to peer pressure related to substance use.",
      "Demonstrates a basic awareness of refusal skills but struggles to apply them effectively in simulated scenarios.",
      "Can identify some refusal skills and attempts to use them, but may be inconsistent or easily swayed by peer pressure.",
      "Demonstrates consistent use of refusal skills in various scenarios, showing an ability to resist peer pressure related to substance use.",
      "Demonstrates confident and assertive use of refusal skills, adapting strategies to different social situations and peer dynamics.",
      "Masterfully applies refusal skills with exceptional confidence and adaptability, acting as a positive role model and influencing peers to make healthy choices."
    ],
    [
      "Shows no awareness of how context or situational factors influence substance use.",
      "Demonstrates a limited awareness of contextual factors, struggling to identify how specific situations can increase the risk of substance use.",
      "Recognizes some common situations where substance use may occur but lacks a deeper understanding of the underlying factors.",
      "Demonstrates a good understanding of how context and situational factors influence substance use, and can anticipate potential risks.",
      "Demonstrates a strong awareness of context and situational factors, and proactively identifies strategies to mitigate risks associated with substance use.",
      "Demonstrates exceptional awareness of context and situational factors, using this knowledge to create comprehensive and personalized prevention strategies, and educating others about potential risks."
    ]
  ]
}