{
  "criteria": [
    "Identification of Bullying and Harassment: Correctly identifies what constitutes bullying and harassment according to established definitions and distinguishes between different forms.",
    "Application of Decision-Making Process: Demonstrates a structured decision-making process in determining strategies to respond to bullying and harassment.",
    "Appropriateness of Strategies: Selects strategies that are appropriate and effective for the specific bullying or harassment situation.",
    "Consideration of Consequences: Assesses the potential consequences of chosen strategies on all parties involved.",
    "Ethical Considerations: Demonstrates ethical reasoning in selecting and implementing strategies, respecting the rights and dignity of all individuals involved."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not demonstrate understanding of bullying or harassment.",
      "Shows limited understanding, struggles to identify bullying or harassment.",
      "Identifies basic forms of bullying and harassment but misses nuances.",
      "Accurately identifies most forms of bullying and harassment, including subtle cues.",
      "Demonstrates a thorough understanding of bullying and harassment, including cyberbullying and other modern forms.",
      "Exhibits expert understanding, differentiates complex scenarios, and recognizes the underlying power dynamics in bullying and harassment situations."
    ],
    [
      "No decision-making process is evident; responses appear random or impulsive.",
      "Attempts a decision-making process but lacks structure or clarity.",
      "Follows a basic decision-making process but misses key steps or considerations.",
      "Applies a decision-making process effectively, considering various factors and stakeholders.",
      "Demonstrates a comprehensive decision-making process, weighing pros and cons of different strategies.",
      "Masterfully applies a nuanced decision-making process, adapting strategies to specific contexts and demonstrating foresight."
    ],
    [
      "Strategies are inappropriate and may escalate the situation.",
      "Strategies are poorly chosen and unlikely to be effective.",
      "Chooses strategies that may be partially effective but are not the best fit for the situation.",
      "Selects appropriate strategies that align with the nature of the bullying or harassment.",
      "Demonstrates excellent judgment in selecting strategies that address the root causes of the issue.",
      "Strategically innovates and adapts responses, demonstrating a deep understanding of conflict resolution and de-escalation techniques."
    ],
    [
      "Does not consider consequences of chosen strategies.",
      "Shows limited awareness of potential consequences.",
      "Acknowledges some consequences but misses important implications.",
      "Thoroughly considers the potential consequences of strategies on victims, bystanders, and perpetrators.",
      "Evaluates both short-term and long-term consequences, demonstrating a holistic understanding.",
      "Anticipates unintended consequences and proactively adjusts strategies to maximize positive outcomes and minimize harm."
    ],
    [
      "Demonstrates unethical reasoning or disregard for others' rights.",
      "Shows limited awareness of ethical considerations.",
      "Attempts to consider ethics but makes questionable choices.",
      "Demonstrates ethical reasoning and respects the rights of all individuals.",
      "Actively promotes ethical behavior and addresses power imbalances.",
      "Champions ethical decision-making and advocates for systemic change to prevent bullying and harassment."
    ]
  ]
}