{
  "criteria": [
    "Understanding the Impact of Violence on Goal Achievement",
    "Clarity and Depth of Explanation",
    "Use of Examples and Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not demonstrate an understanding of how violence affects personal goals.",
      "Shows minimal awareness of the connection between violence and its potential impact on achieving personal goals.",
      "Identifies a limited number of ways violence can affect personal goal achievement with little detail.",
      "Describes several ways violence can negatively affect the achievement of personal goals with some supporting details.",
      "Explains in detail how violence can hinder or prevent the achievement of personal goals, providing specific examples.",
      "Provides a comprehensive analysis of how violence fundamentally undermines the possibility of achieving personal goals, illustrating the discussion with relevant and insightful examples."
    ],
    [
      "Explanation is unclear or irrelevant.",
      "Explanation lacks clarity and depth; reasoning is superficial.",
      "Explanation is understandable but lacks depth; reasoning is somewhat developed.",
      "Explanation is clear and reasonably detailed; reasoning is well-developed.",
      "Explanation is very clear, detailed, and insightful; reasoning is thorough and well-supported.",
      "Explanation is exceptionally clear, detailed, and insightful; reasoning is sophisticated, nuanced, and compelling."
    ],
    [
      "Provides no relevant examples or evidence.",
      "Provides minimal or irrelevant examples.",
      "Provides some relevant examples but lacks detail or explanation.",
      "Effectively uses relevant examples and explains their significance.",
      "Uses a variety of compelling examples and evidence to support claims.",
      "Masterfully integrates diverse and insightful examples and evidence to construct a persuasive argument."
    ]
  ]
}