{
  "criteria": [
    "Identification of Triggers",
    "Application of Self-Control Techniques",
    "Understanding of Physiological Responses",
    "Communication Skills During Conflict"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any personal triggers for anger.",
      "Identifies one trigger for anger.",
      "Identifies a few triggers for anger, but lacks detail.",
      "Identifies several triggers for anger with some detail.",
      "Clearly identifies most personal triggers for anger with specific examples.",
      "Comprehensively identifies a wide range of personal triggers for anger with detailed examples and insights."
    ],
    [
      "Unable to demonstrate any self-control techniques.",
      "Attempts one self-control technique but is ineffective.",
      "Applies a couple of self-control techniques with limited success.",
      "Applies several self-control techniques with moderate success in managing anger.",
      "Effectively uses a variety of self-control techniques to manage and reduce anger.",
      "Masterfully employs a comprehensive range of self-control techniques, adapting them effectively to different situations and demonstrating exceptional emotional regulation."
    ],
    [
      "Shows no understanding of how anger affects the body.",
      "Shows minimal awareness of physical reactions to anger.",
      "Identifies a few basic physical responses to anger.",
      "Describes several common physical responses to anger with some accuracy.",
      "Demonstrates a solid understanding of various physical responses to anger and their impact.",
      "Exhibits an in-depth understanding of the complex physiological responses to anger, including the interplay of hormones, neural pathways, and physical symptoms."
    ],
    [
      "Uses aggressive or avoidant communication when angry.",
      "Attempts to communicate, but struggles to express needs clearly.",
      "Communicates basic needs and feelings when angry, but with some difficulty.",
      "Expresses needs and feelings clearly and respectfully when angry.",
      "Communicates needs and feelings effectively, using assertive and empathetic language during conflict.",
      "Demonstrates exceptional communication skills during conflict, using nuanced language, active listening, and collaborative problem-solving to de-escalate tension and foster understanding."
    ]
  ]
}