{
  "criteria": [
    "Understanding of Gang Involvement Risks",
    "Identification of Positive Alternatives",
    "Application of Coping and Refusal Skills"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the risks associated with gang involvement.",
      "Demonstrates minimal awareness of gang involvement risks, such as legal or safety concerns.",
      "Identifies some risks of gang involvement but lacks depth or specific examples.",
      "Explains several risks associated with gang involvement, including legal, social, and personal safety issues.",
      "Thoroughly explains the risks of gang involvement with specific examples and consequences.",
      "Demonstrates a comprehensive understanding of the multifaceted risks of gang involvement, including long-term impacts on life opportunities."
    ],
    [
      "Unable to identify any positive alternatives to gang involvement.",
      "Identifies one or two vague alternatives to gang involvement.",
      "Lists a few positive alternatives to gang involvement, but with limited explanation.",
      "Describes several positive alternatives to gang involvement, such as sports, clubs, or community service.",
      "Explains various positive alternatives to gang involvement and how they can provide similar benefits (belonging, purpose).",
      "Offers a wide range of positive alternatives, tailored to different interests and needs, with a clear understanding of their benefits and accessibility."
    ],
    [
      "Does not demonstrate any coping or refusal skills in the context of gang pressure.",
      "Shows a limited understanding of how to cope with or refuse gang pressure.",
      "Describes basic coping or refusal skills, but not applied effectively to hypothetical situations.",
      "Applies coping and refusal skills in simple scenarios related to gang pressure.",
      "Effectively uses coping and refusal skills in various complex scenarios involving gang influence.",
      "Demonstrates advanced coping and refusal strategies, adapting techniques to different situations and confidently asserting personal boundaries against gang pressure."
    ]
  ]
}