{
  "criteria": [
    "Identification of Conflict Resolution Strategies",
    "Application of Nonviolent Communication",
    "Analysis of Conflict Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any conflict resolution strategies or identifies strategies that are not relevant.",
      "The student identifies one conflict resolution strategy with limited accuracy.",
      "The student identifies two conflict resolution strategies with some accuracy.",
      "The student identifies three conflict resolution strategies with reasonable accuracy.",
      "The student identifies four conflict resolution strategies accurately and appropriately.",
      "The student identifies multiple conflict resolution strategies accurately, demonstrating a comprehensive understanding."
    ],
    [
      "The student does not demonstrate an understanding of nonviolent communication principles.",
      "The student attempts to apply nonviolent communication but struggles with key components (e.g., empathy, clear expression).",
      "The student applies some elements of nonviolent communication, but inconsistently or with limited effectiveness.",
      "The student generally applies nonviolent communication techniques appropriately in conflict scenarios.",
      "The student effectively uses nonviolent communication to address conflict, showing empathy and clear expression.",
      "The student skillfully and consistently uses nonviolent communication, fostering understanding and de-escalation in complex conflict situations."
    ],
    [
      "The student fails to analyze conflict scenarios or provides irrelevant analysis.",
      "The student provides a superficial analysis of conflict scenarios, missing key elements.",
      "The student identifies some relevant aspects of conflict scenarios but lacks depth in analysis.",
      "The student analyzes conflict scenarios with reasonable detail, identifying causes and potential consequences.",
      "The student provides a thorough and insightful analysis of conflict scenarios, considering multiple perspectives.",
      "The student demonstrates exceptional analytical skills, providing a comprehensive understanding of complex conflict dynamics and potential solutions."
    ]
  ]
}