{
  "criteria": [
    "Demonstrates understanding of differences",
    "Exhibits respectful behavior",
    "Actively includes others",
    "Challenges stereotypes and biases"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no awareness or understanding of differences among individuals or groups.",
      "Shows minimal awareness of differences but does not demonstrate understanding.",
      "Acknowledges differences but struggles to explain them or their impact.",
      "Understands and explains some differences, but may oversimplify or rely on stereotypes.",
      "Clearly understands and explains a variety of differences and their impact on individuals and groups.",
      "Demonstrates a sophisticated understanding of differences, including their nuances and complexities, and can articulate their significance in various contexts."
    ],
    [
      "Consistently displays disrespectful or discriminatory behavior towards those who are different.",
      "Occasionally displays disrespectful behavior or language towards those who are different.",
      "Generally respectful, but may make unintentional insensitive remarks or actions.",
      "Consistently displays respectful behavior towards those who are different.",
      "Proactively demonstrates respect and empathy towards individuals from diverse backgrounds.",
      "Serves as a role model for respectful and inclusive behavior, actively challenging and addressing instances of disrespect or discrimination."
    ],
    [
      "Actively excludes or isolates individuals who are different from oneself.",
      "Does not actively include others and may passively exclude those who are different.",
      "Sometimes includes others, but may not fully engage or value their contributions.",
      "Regularly includes others in activities and conversations, making an effort to be welcoming.",
      "Proactively seeks out opportunities to include and engage individuals from diverse backgrounds, valuing their unique perspectives.",
      "Champions inclusivity and creates opportunities for all individuals to participate and contribute, fostering a sense of belonging and community."
    ],
    [
      "Reinforces stereotypes and biases through words or actions.",
      "Unaware of personal stereotypes and biases.",
      "Recognizes some stereotypes and biases but struggles to challenge them.",
      "Actively challenges stereotypes and biases when they are observed.",
      "Consistently challenges stereotypes and biases and encourages others to do the same.",
      "Actively works to dismantle systemic stereotypes and biases, advocating for equity and social justice."
    ]
  ]
}