{
  "criteria": [
    "Understanding the Risks: Demonstrates comprehension of the physical, social, and psychological risks associated with alcohol, tobacco, and other drug use.",
    "Identifying Alternatives: Ability to identify and propose positive alternatives to substance use, such as hobbies, sports, and social activities.",
    "Decision-Making Skills: Demonstrates the ability to make informed decisions about substance use, considering personal values and potential consequences."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the risks associated with substance use.",
      "Identifies very few risks, with significant misunderstandings.",
      "Recognizes some risks, but lacks depth in understanding the consequences.",
      "Understands many of the risks associated with substance use, including short-term and long-term effects.",
      "Thoroughly understands the risks, providing specific examples and demonstrating a clear grasp of the consequences on physical and mental health.",
      "Exhibits comprehensive understanding of risks, including statistical data and nuanced effects on individuals and communities; can articulate the risks clearly and persuasively."
    ],
    [
      "Unable to identify any positive alternatives to substance use.",
      "Suggests one or two alternatives, but they are not well-developed or realistic.",
      "Identifies a few alternatives but struggles to explain how they can effectively replace substance use.",
      "Proposes several relevant alternatives with some explanation of their benefits.",
      "Clearly identifies a range of effective and appealing alternatives, providing a strong rationale for each.",
      "Demonstrates creativity and insight in suggesting alternatives, tailoring them to different situations and individual needs; can effectively advocate for these alternatives."
    ],
    [
      "Shows no evidence of considering personal values or consequences when making decisions.",
      "Makes decisions based on limited information, with little regard for personal values or potential consequences.",
      "Considers some consequences, but does not fully integrate personal values into the decision-making process.",
      "Weighs potential consequences and personal values when making decisions about substance use.",
      "Consistently makes informed decisions, clearly articulating how personal values and potential consequences influenced the choice.",
      "Exhibits mature and ethical decision-making skills, demonstrating a deep understanding of personal values and a commitment to responsible choices; can analyze complex scenarios and make well-reasoned judgments."
    ]
  ]
}