{
  "criteria": [
    "Understanding of Safe Behaviors: Demonstrates knowledge of specific safe behaviors (seatbelt use, helmet use, mouth guard use) and the reasons behind them.",
    "Encouragement and Communication: Effectively encourages others to adopt safe behaviors through communication and positive reinforcement.",
    "Application and Advocacy: Actively applies knowledge of safe behaviors in real-life situations and advocates for their adoption in the community."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of safe behaviors or their importance.",
      "Identifies one safe behavior but struggles to explain its importance.",
      "Identifies two safe behaviors but provides limited explanation of their importance.",
      "Identifies all three safe behaviors and provides a basic explanation of their importance.",
      "Clearly explains all three safe behaviors and provides a detailed explanation of their importance, including relevant statistics or examples.",
      "Demonstrates a comprehensive understanding of safe behaviors and their importance, and can articulate the potential consequences of not practicing them."
    ],
    [
      "Does not attempt to encourage others or actively discourages safe behaviors.",
      "Attempts to encourage others but uses ineffective or negative communication strategies.",
      "Encourages others using basic communication but lacks enthusiasm or persuasive arguments.",
      "Encourages others using clear and positive communication, providing some reasoning for safe behaviors.",
      "Effectively encourages others with persuasive communication, tailored to the audience and situation, using positive reinforcement.",
      "Serves as a role model for safe behaviors, and inspires others to adopt safe practices through passionate and effective communication, providing compelling reasons and addressing potential concerns."
    ],
    [
      "Does not demonstrate application of safe behaviors or advocacy for their adoption.",
      "Demonstrates limited application of safe behaviors in personal situations but does not advocate for others.",
      "Applies safe behaviors in some personal situations but shows minimal advocacy for others.",
      "Consistently applies safe behaviors in personal situations and occasionally advocates for their adoption by others.",
      "Actively applies safe behaviors in personal situations and advocates for their adoption in the community through peer influence and positive reinforcement.",
      "Serves as a leader in promoting safe behaviors, organizing events and initiatives to raise awareness and encourage their adoption in the school and community."
    ]
  ]
}