{
  "criteria": [
    "Demonstrates active listening and respectful communication with individuals of diverse backgrounds.",
    "Contributes to creating a positive and inclusive school environment.",
    "Demonstrates an understanding of the impact of stereotypes and biases on individuals and communities."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not listen or communicate respectfully with others. Shows no awareness of individual differences.",
      "Student occasionally listens and communicates respectfully, but inconsistencies are noted. Shows limited awareness of individual differences.",
      "Student generally listens and communicates respectfully, but some improvements are needed. Shows basic awareness of individual differences.",
      "Student consistently listens and communicates respectfully with individuals of diverse backgrounds. Shows good awareness of individual differences.",
      "Student actively listens and communicates respectfully, demonstrating empathy and understanding towards individuals of diverse backgrounds. Shows thorough awareness of individual differences.",
      "Student expertly listens and communicates respectfully, advocating for inclusivity and understanding among individuals of diverse backgrounds. Champions respect for individual differences and promotes a welcoming environment."
    ],
    [
      "Student's actions detract from a positive school environment. May exhibit exclusionary behaviors.",
      "Student's actions sometimes contribute to a positive environment, but inconsistencies are noted. Minimal effort to include others.",
      "Student's actions generally contribute to a positive environment. Shows some effort to include others.",
      "Student consistently contributes to a positive and inclusive school environment. Actively includes others in activities.",
      "Student proactively promotes a positive and inclusive environment, initiating activities and conversations that foster understanding.",
      "Student serves as a role model for creating a positive and inclusive environment, inspiring others to embrace diversity and take action against exclusion."
    ],
    [
      "Student demonstrates no understanding of stereotypes and biases.",
      "Student demonstrates limited understanding of stereotypes and biases, with misconceptions evident.",
      "Student demonstrates basic understanding of stereotypes and biases, but may not fully grasp the impact.",
      "Student demonstrates a good understanding of stereotypes and biases and their impact on individuals and communities.",
      "Student demonstrates a thorough understanding of stereotypes and biases, able to analyze and explain their impact.",
      "Student demonstrates expert understanding of stereotypes and biases, actively challenging and working to dismantle them within the school community."
    ]
  ]
}