{
  "criteria": [
    "Understanding of Bullying: Demonstrates understanding of what constitutes bullying, including physical, verbal, social, and cyberbullying.",
    "Advocacy and Promotion: Actively promotes a bully-free environment through advocacy and awareness initiatives.",
    "Intervention and Support: Takes appropriate action to intervene in bullying situations and support victims."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of bullying or its various forms.",
      "Demonstrates a limited understanding of bullying, recognizing only one or two forms.",
      "Identifies bullying in its physical and verbal forms but struggles with social and cyberbullying.",
      "Recognizes most forms of bullying and can provide basic definitions.",
      "Exhibits a comprehensive understanding of bullying, including subtle forms and its impact.",
      "Demonstrates an expert understanding of bullying, including its various forms, motivations, and long-term effects on individuals and the community."
    ],
    [
      "Does not engage in any activities to promote a bully-free environment.",
      "Participates passively in anti-bullying initiatives when prompted.",
      "Occasionally speaks out against bullying or participates in awareness campaigns.",
      "Regularly advocates for a bully-free environment and actively promotes awareness.",
      "Leads or initiates anti-bullying campaigns and actively seeks to educate others.",
      "Champions a bully-free environment, develops and implements innovative strategies, and serves as a role model for others."
    ],
    [
      "Does not intervene or offer support in bullying situations.",
      "Reports bullying incidents to adults but does not offer direct support to victims.",
      "Intervenes in bullying situations when safe to do so and offers basic support to victims.",
      "Consistently intervenes in bullying situations, provides support to victims, and reports incidents to appropriate authorities.",
      "Demonstrates leadership in intervening in bullying situations, offers comprehensive support to victims, and advocates for their needs.",
      "Develops and implements strategies to prevent bullying, empowers victims, and fosters a culture of empathy and support."
    ]
  ]
}