{
  "criteria": [
    "Exploration of Stimuli",
    "Movement Vocabulary",
    "Relating Contrasting Ideas"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of stimuli and its potential use in choreography.",
      "Shows minimal awareness of stimuli and struggles to connect it to movement ideas.",
      "Identifies stimuli but has difficulty relating it to choreography in a meaningful way.",
      "Relates stimuli to choreography with some clarity, showing a basic understanding of the connection.",
      "Clearly relates stimuli to choreography, demonstrating a solid understanding of how to transform ideas into movement.",
      "Masterfully relates diverse stimuli to create innovative choreography, demonstrating a deep understanding of artistic expression through movement transformation."
    ],
    [
      "Exhibits no exploration of movement vocabulary.",
      "Shows limited exploration of movement vocabulary and struggles to transfer ideas into choreography.",
      "Explores a restricted range of movement vocabulary with limited success in transferring ideas.",
      "Explores a moderate range of movement vocabulary, showing some ability to transfer ideas into choreography.",
      "Demonstrates a broad movement vocabulary and effectively transfers ideas into choreography.",
      "Exhibits a sophisticated and diverse movement vocabulary, creatively transferring ideas into original and compelling choreography."
    ],
    [
      "No attempt to relate similar or contrasting ideas.",
      "Struggles to identify or relate similar or contrasting ideas.",
      "Identifies similar or contrasting ideas but does not clearly relate them to the choreography.",
      "Relates similar or contrasting ideas with basic connections to the choreography.",
      "Effectively relates similar or contrasting ideas to develop the choreography.",
      "Skillfully synthesizes similar or contrasting ideas, creating a rich and nuanced choreographic work."
    ]
  ]
}