{
  "criteria": [
    "Understanding of Healthy Expression",
    "Respect and Boundaries",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of healthy ways to express friendship, attraction, or affection.",
      "Shows a limited understanding of healthy expression, with significant misconceptions or inability to apply concepts.",
      "Displays a basic understanding of healthy expression but struggles with consistent application in different scenarios.",
      "Demonstrates a satisfactory understanding of healthy and respectful ways to express friendship, attraction, and affection.",
      "Exhibits a strong understanding of healthy expression, applying concepts effectively and demonstrating thoughtfulness.",
      "Shows a comprehensive understanding of healthy expression, consistently using respectful methods and demonstrating exceptional insight."
    ],
    [
      "Shows no respect for boundaries or others feelings when talking about friendship, attraction, or affection.",
      "Struggles to understand other's boundaries and has a difficult time regulating their emotions when expressing their feelings.",
      "Respect for other's boundaries is not consistent and they seem to miss nonverbal cues. Difficulty managing emotions.",
      "Consistently demonstrates respect for boundaries and others' feelings in their expressions of friendship, attraction, and affection.",
      "Demonstrates a high level of respect, navigating sensitive situations with thoughtfulness and awareness of other's feelings.",
      "Exceptional respect and ability to manage boundaries and others' feelings. Shows exceptional maturity and awareness."
    ],
    [
      "Cannot identify or apply healthy expression in any real-life scenarios.",
      "Struggles to apply healthy expression concepts to real-life scenarios, often misunderstanding situations.",
      "Can identify healthy expression in some scenarios but struggles to apply it consistently or appropriately.",
      "Appropriately applies healthy expression in most real-life scenarios, demonstrating understanding and thoughtfulness.",
      "Skillfully applies healthy expression in a variety of real-life scenarios, demonstrating adaptability and insight.",
      "Masterfully applies healthy expression in complex, real-life scenarios, demonstrating exceptional skill and understanding."
    ]
  ]
}