{
  "criteria": [
    "Identification of Risky Situations",
    "Application of Decision-Making Process",
    "Consideration of Consequences",
    "Development of Healthy Alternatives"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any risky social or dating situations.",
      "Identifies a risky situation, but explanation is unclear or inaccurate.",
      "Identifies a risky situation with a basic explanation.",
      "Identifies multiple risky situations with clear explanations.",
      "Identifies various risky situations with detailed and accurate explanations, demonstrating good understanding.",
      "Identifies a comprehensive range of risky situations with insightful and nuanced explanations, showing excellent understanding."
    ],
    [
      "Does not apply any decision-making process.",
      "Attempts to apply a decision-making process, but implementation is flawed or incomplete.",
      "Applies a basic decision-making process with some reasoning.",
      "Applies a structured decision-making process with clear reasoning and consideration of consequences.",
      "Applies a comprehensive decision-making process, thoroughly evaluating potential consequences and ethical considerations.",
      "Applies an advanced decision-making process with insightful evaluation of consequences, ethical considerations, and personal values, demonstrating critical thinking."
    ],
    [
      "Does not consider any consequences of risky situations.",
      "Mentions consequences, but they are vague or unrealistic.",
      "Considers basic consequences of risky situations.",
      "Considers a range of consequences, including short-term and long-term effects.",
      "Considers a comprehensive range of consequences, including physical, emotional, social, and legal implications.",
      "Considers consequences in a nuanced and insightful way, evaluating the potential impact on self and others, demonstrating exceptional foresight."
    ],
    [
      "Does not suggest any healthy alternatives.",
      "Suggests alternatives, but they are unrealistic or ineffective.",
      "Suggests basic healthy alternatives to risky situations.",
      "Suggests a range of healthy alternatives with clear reasoning.",
      "Suggests a comprehensive set of healthy alternatives, considering various factors and personal values.",
      "Suggests innovative and insightful healthy alternatives, demonstrating a deep understanding of personal safety and well-being."
    ]
  ]
}