{
  "criteria": [
    "Understanding of Consent",
    "Verbal Refusal Skills",
    "Non-Verbal Refusal Skills",
    "Strategies for Extricating from Uncomfortable Situations",
    "Assertiveness and Confidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of consent or healthy boundaries.",
      "Shows a limited understanding of consent, with some misconceptions.",
      "Identifies the basic concept of consent but struggles to articulate it clearly.",
      "Understands consent as an agreement between individuals, but lacks depth in explanation.",
      "Clearly explains consent and its importance in healthy relationships.",
      "Demonstrates a comprehensive understanding of consent, including enthusiastic consent, and its role in ethical interactions."
    ],
    [
      "Unable to articulate any verbal refusal strategies.",
      "Suggests ineffective or passive refusal strategies.",
      "Identifies a few basic verbal refusal strategies, but lacks confidence in delivery.",
      "Can articulate several verbal refusal strategies, such as saying 'no' directly.",
      "Demonstrates effective verbal refusal techniques, including assertive communication.",
      "Articulates a wide range of verbal refusal strategies, adapting communication style to different situations."
    ],
    [
      "Shows no awareness of non-verbal refusal strategies.",
      "Lists a few non-verbal cues but doesn't connect them to refusal.",
      "Identifies some non-verbal cues that indicate discomfort or refusal.",
      "Demonstrates understanding of non-verbal refusal strategies, like body language and facial expressions.",
      "Effectively uses non-verbal cues to communicate refusal clearly and confidently.",
      "Masterfully employs non-verbal communication, combining it with verbal strategies for a powerful message of refusal."
    ],
    [
      "Unable to describe any strategies for leaving an unwanted sexual situation.",
      "Suggests impractical or unsafe strategies.",
      "Identifies a few basic strategies, but lacks confidence in their effectiveness.",
      "Can describe several strategies for leaving an uncomfortable situation, such as using a code word.",
      "Demonstrates a range of strategies, including involving trusted adults or friends.",
      "Develops innovative and effective strategies for extricating from unwanted situations, while prioritizing safety and well-being."
    ],
    [
      "Demonstrates no assertiveness or confidence in refusal.",
      "Shows hesitation or uncertainty when suggesting refusal strategies.",
      "Displays some assertiveness but struggles to maintain it under pressure.",
      "Assertively communicates refusal strategies.",
      "Confidently and assertively communicates refusal, maintaining eye contact and using a firm tone.",
      "Embodies assertiveness, confidently communicating refusal while empowering others to do the same."
    ]
  ]
}