{
  "criteria": [
    "Understanding of Bullying Motivations",
    "Analysis of Social Dynamics",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of why some students are bullies.",
      "The student shows a very limited understanding of possible reasons why some students bully, with significant misconceptions.",
      "The student identifies one or two superficial reasons for bullying (e.g., 'to be mean') without deeper analysis.",
      "The student identifies a few common reasons for bullying (e.g., insecurity, peer pressure) but lacks detailed explanation or supporting evidence.",
      "The student evaluates several key motivations behind bullying (e.g., power imbalance, social status, learned behavior) with some supporting examples.",
      "The student provides a comprehensive evaluation of the complex motivations behind bullying, including psychological, social, and environmental factors, supported by relevant examples and insights."
    ],
    [
      "The student does not address the role of social dynamics in bullying.",
      "The student makes a vague or inaccurate statement about social dynamics related to bullying.",
      "The student mentions social dynamics (e.g., popularity) but doesn't connect it directly to the reasons for bullying.",
      "The student describes how social dynamics such as peer pressure or group mentality can contribute to bullying.",
      "The student analyzes the interplay of social dynamics, power structures, and individual motivations in bullying situations.",
      "The student critically evaluates the complex social systems that enable and perpetuate bullying, including bystander effect, social hierarchies, and cultural norms."
    ],
    [
      "The student provides no evidence or examples to support their evaluation.",
      "The student provides irrelevant or illogical examples.",
      "The student provides one general example without explanation.",
      "The student offers a couple of relevant examples to illustrate some reasons for bullying.",
      "The student supports their evaluation with multiple relevant examples and explains their connection to bullying motivations.",
      "The student uses diverse, compelling evidence (e.g., case studies, research findings) to thoroughly support their evaluation, demonstrating a nuanced understanding of the subject."
    ]
  ]
}