{
  "criteria": [
    "Understanding of HIV\/AIDS and its Impact",
    "Demonstrates Respect and Dignity",
    "Advocacy and Support"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of HIV\/AIDS or its impact on individuals and communities.",
      "Shows limited understanding of HIV\/AIDS and its impact, with significant misconceptions.",
      "Displays basic understanding of HIV\/AIDS, including transmission and prevention, but lacks depth.",
      "Demonstrates a solid understanding of HIV\/AIDS, including its impact on physical and mental health, as well as social stigma.",
      "Exhibits a comprehensive understanding of HIV\/AIDS, including its historical context, current research, and global impact.",
      "Demonstrates an exceptional understanding of HIV\/AIDS, including nuanced aspects of living with the disease, and can articulate complex issues related to stigma, discrimination, and access to care."
    ],
    [
      "Shows disrespect or insensitivity towards individuals living with HIV\/AIDS.",
      "Uses stigmatizing language or perpetuates harmful stereotypes about people living with HIV\/AIDS.",
      "Demonstrates a neutral attitude but doesn't actively promote respect for people living with HIV\/AIDS.",
      "Uses respectful language and avoids harmful stereotypes. Acknowledges the importance of treating individuals with HIV\/AIDS with dignity.",
      "Actively promotes respect and dignity for people living with HIV\/AIDS in their words and actions. Challenges stigma and discrimination.",
      "Serves as a role model for promoting respect and dignity, consistently advocating for the rights and well-being of individuals living with HIV\/AIDS. Demonstrates empathy and compassion in all interactions."
    ],
    [
      "Shows no interest in or willingness to support individuals living with HIV\/AIDS.",
      "Is aware of the issue but does not take any action to support those affected.",
      "Expresses willingness to help but lacks specific knowledge or skills to do so effectively.",
      "Can identify ways to support individuals living with HIV\/AIDS and promote awareness within their community.",
      "Actively advocates for policies and practices that support the rights and well-being of individuals living with HIV\/AIDS. Participates in fundraising or awareness campaigns.",
      "Leads initiatives to support individuals living with HIV\/AIDS, educates others about the disease, and advocates for systemic change to address stigma and discrimination."
    ]
  ]
}