{
  "criteria": [
    "Identification of Global Influences: Ability to identify and name various global factors influencing health.",
    "Description of Impact: How well the student describes the impact of global influences on personal and community health.",
    "Connection to Personal and Community Health: The ability to connect global influences to personal and community health outcomes.",
    "Use of Evidence and Examples: Use of supporting evidence or real-world examples to substantiate claims."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any global influences on health.",
      "Identifies one global influence on health, but lacks detail or accuracy.",
      "Identifies a few global influences on health with some accuracy, but lacks depth.",
      "Identifies several global influences on health with reasonable accuracy and some detail.",
      "Identifies most major global influences on health with good accuracy and detail.",
      "Thoroughly identifies and explains major global influences on health with excellent accuracy and insightful detail."
    ],
    [
      "Unable to describe the impact of global influences on health.",
      "Describes the impact vaguely or with significant inaccuracies.",
      "Provides a basic description of the impact of global influences, but lacks specifics.",
      "Describes the impact of global influences on health with reasonable clarity and some specific examples.",
      "Clearly describes the impact of global influences on health with specific and relevant examples.",
      "Clearly and insightfully describes the complex impacts of global influences on health, using specific and compelling examples."
    ],
    [
      "Does not connect global influences to personal or community health.",
      "Attempts to connect global influences to health, but the connection is unclear or illogical.",
      "Makes a superficial connection between global influences and personal\/community health.",
      "Connects global influences to personal and community health with some relevant examples.",
      "Clearly connects global influences to specific aspects of personal and community health, providing relevant details.",
      "Demonstrates a sophisticated understanding of how global influences intricately affect personal and community health, providing insightful analysis and examples."
    ],
    [
      "Provides no evidence or examples.",
      "Provides irrelevant or inaccurate evidence\/examples.",
      "Provides limited or weak evidence\/examples.",
      "Provides adequate evidence\/examples that support most claims.",
      "Provides strong and relevant evidence\/examples to support all claims effectively.",
      "Provides compelling and diverse evidence\/examples, demonstrating a mastery of the topic and persuasive argumentation."
    ]
  ]
}