{
  "criteria": [
    "Understanding the Importance of Lifelong Physical Activity",
    "Identifying Diverse Physical Activities Suitable for Different Stages of Life",
    "Planning for Personal Physical Activity Across a Lifetime"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the importance of physical activity for lifelong health.",
      "Student shows a limited understanding of why physical activity is important for lifelong health, with significant gaps in knowledge.",
      "Student identifies some benefits of physical activity for lifelong health but struggles to explain them clearly or provide examples.",
      "Student explains several benefits of physical activity for lifelong health, providing some examples of how it contributes to well-being.",
      "Student clearly and accurately explains multiple benefits of physical activity for lifelong health, providing detailed examples and demonstrating a solid understanding.",
      "Student comprehensively explains the numerous benefits of physical activity for lifelong health, providing insightful examples, demonstrating a deep understanding, and connecting it to overall well-being."
    ],
    [
      "Student is unable to identify any physical activities or suggests activities that are inappropriate or unsafe.",
      "Student struggles to name suitable physical activities and shows little awareness of how activities might need to change over time.",
      "Student can name a few physical activities but does not connect them to specific age groups or consider how activities might be adapted.",
      "Student identifies several physical activities suitable for different age groups, with some consideration of modifications.",
      "Student identifies a wide range of physical activities appropriate for different life stages, explaining modifications or considerations for each.",
      "Student expertly identifies a diverse range of physical activities suitable for all life stages, comprehensively explaining necessary modifications, and demonstrating creativity in adapting activities to individual needs and abilities."
    ],
    [
      "Student does not attempt to create a plan or states they are not interested in planning for future physical activity.",
      "Student creates a very basic plan with minimal detail and little consideration of personal interests or long-term goals.",
      "Student creates a plan with some details, but it lacks clear goals, realistic considerations, or adaptation for different life stages.",
      "Student creates a reasonable plan that includes goals and considers potential challenges, but lacks detail in terms of specific activities or adjustments for future life stages.",
      "Student creates a detailed and thoughtful plan with clear goals, realistic activities, and considerations for adjustments at different life stages. Includes strategies for overcoming potential barriers.",
      "Student designs a comprehensive, highly personalized plan with well-defined goals, a diverse range of activities, detailed strategies for overcoming barriers, and a creative approach to adapting the plan to all stages of life, showing a strong commitment to lifelong physical activity."
    ]
  ]
}