{
  "criteria": [
    "Understanding the definitions of violence, aggression, bullying, and harassment.",
    "Explaining the effects of violence, aggression, bullying, and harassment on physical health and safety.",
    "Explaining the effects of violence, aggression, bullying, and harassment on mental\/emotional health.",
    "Identifying and discussing prevention and intervention strategies."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not demonstrate understanding of any of the terms.",
      "Student demonstrates a basic understanding of one of the terms.",
      "Student demonstrates a basic understanding of two of the terms or a proficient understanding of one.",
      "Student demonstrates a proficient understanding of at least two terms.",
      "Student clearly understands the definitions of violence, aggression, bullying and harassment, and can distinguish between them.",
      "Student provides comprehensive and nuanced definitions of all terms, including relevant examples."
    ],
    [
      "Student does not explain any effects on physical health and safety.",
      "Student mentions one effect without providing details.",
      "Student mentions a few effects with limited detail.",
      "Student explains several effects of violence, aggression, bullying, and harassment on physical health and safety with some detail.",
      "Student thoroughly explains multiple effects of violence, aggression, bullying, and harassment on physical health and safety with supporting details.",
      "Student provides a detailed and insightful analysis of the complex effects of violence, aggression, bullying, and harassment on physical health and safety."
    ],
    [
      "Student does not explain any effects on mental\/emotional health.",
      "Student mentions one effect without providing details.",
      "Student mentions a few effects with limited detail.",
      "Student explains several effects of violence, aggression, bullying, and harassment on mental\/emotional health with some detail.",
      "Student thoroughly explains multiple effects of violence, aggression, bullying, and harassment on mental\/emotional health with supporting details.",
      "Student provides a detailed and insightful analysis of the complex effects of violence, aggression, bullying, and harassment on mental\/emotional health."
    ],
    [
      "Student does not identify any prevention or intervention strategies.",
      "Student identifies one strategy without discussing its effectiveness.",
      "Student identifies a few strategies with limited discussion of their effectiveness.",
      "Student identifies and discusses the effectiveness of several prevention and intervention strategies.",
      "Student thoroughly explains multiple prevention and intervention strategies, discussing their effectiveness with supporting details.",
      "Student provides a detailed and insightful analysis of various prevention and intervention strategies, evaluating their strengths and weaknesses in different contexts."
    ]
  ]
}