{
  "criteria": [
    "Identification of Influences: Accurately identifies culture, media, and other people as sources that shape perceptions.",
    "Analysis of Impact: Critically assesses the positive and negative impacts of these influences on individual and societal well-being.",
    "Personal Reflection and Application: Reflects on how personal perceptions are influenced and proposes strategies for promoting healthy attitudes and behaviors."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Fails to identify any influences on perceptions of body image, gender roles, sexuality, attractiveness, relationships, and sexual orientation.",
      "Identifies only one type of influence (e.g., media) without further elaboration or connection to specific perceptions.",
      "Identifies at least two types of influences but lacks depth in explaining how these influences shape perceptions.",
      "Identifies multiple influences and provides a basic explanation of how they shape perceptions related to the topics.",
      "Clearly identifies and explains how various influences shape perceptions, providing specific examples and demonstrating a good understanding.",
      "Provides a comprehensive analysis of how culture, media, and other people deeply influence perceptions, offering nuanced examples and critical insights."
    ],
    [
      "Does not analyze the impact of influences or makes irrelevant or inaccurate claims.",
      "Briefly mentions the impact of influences but lacks analysis or supporting details.",
      "Offers a limited analysis of either positive or negative impacts, but not both, with minimal supporting evidence.",
      "Analyzes both positive and negative impacts but may lack depth or strong evidence in some areas.",
      "Provides a well-supported analysis of both positive and negative impacts, demonstrating a clear understanding of their significance.",
      "Critically and comprehensively analyzes the complex impacts, offering insightful perspectives and well-supported evidence to demonstrate the depth of understanding."
    ],
    [
      "Shows no personal reflection or provides strategies that are unrealistic or irrelevant.",
      "Offers a superficial reflection with minimal connection to personal perceptions or proposes vague strategies.",
      "Reflects on personal perceptions and suggests strategies but lacks depth or feasibility.",
      "Provides a thoughtful reflection and proposes feasible strategies for promoting healthy attitudes and behaviors.",
      "Demonstrates a deep personal reflection and proposes well-developed, practical strategies with clear rationale.",
      "Presents an exceptionally insightful reflection, offering innovative and highly effective strategies for fostering positive change in attitudes and behaviors."
    ]
  ]
}