{
  "criteria": [
    "Understanding of Emotional Changes",
    "Explanation of Factors Influencing Emotions",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of emotional changes during adolescence.",
      "Provides a vague or inaccurate description of emotional changes during adolescence.",
      "Identifies some emotional changes during adolescence but lacks detail or accuracy.",
      "Describes emotional changes during adolescence with some detail and accuracy.",
      "Clearly and accurately describes several emotional changes during adolescence, providing relevant examples.",
      "Provides a comprehensive and insightful description of emotional changes during adolescence, including causes, effects, and coping strategies."
    ],
    [
      "Does not identify any factors influencing emotional changes.",
      "Mentions one or two factors with no explanation.",
      "Identifies a few factors influencing emotional changes with limited explanation.",
      "Explains how several factors, like hormonal changes, social pressures, or personal experiences, can influence emotions.",
      "Clearly explains the impact of various factors on emotional changes, providing examples and demonstrating an understanding of their interconnectedness.",
      "Provides an in-depth analysis of multiple factors influencing emotional changes, including psychological, social, and biological aspects, and their complex interactions."
    ],
    [
      "Unable to apply knowledge to real-life scenarios.",
      "Attempts to relate emotional changes to real-life situations, but explanation is unclear or irrelevant.",
      "Provides a basic example of how emotional changes might manifest in a real-life scenario.",
      "Describes how emotional changes could affect behavior or relationships in specific situations.",
      "Illustrates a clear understanding of how emotional changes affect individuals in real-life scenarios, offering constructive insights.",
      "Demonstrates a sophisticated understanding of the impact of emotional changes on various aspects of life, providing nuanced analysis and potential solutions for managing these changes effectively."
    ]
  ]
}