{
  "criteria": [
    "Effectiveness of Verbal Communication Skills in Preventing Risky Behaviors",
    "Effectiveness of Nonverbal Communication Skills in Preventing Risky Behaviors",
    "Application of Communication Skills in Realistic Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of verbal communication or its role in preventing sexual involvement, HIV, other STDs, and unintended pregnancy.",
      "Struggles to articulate the importance of verbal communication in preventing risky behaviors, with limited clarity.",
      "Identifies some verbal communication strategies but provides superficial explanations of their use in preventing risky behaviors.",
      "Clearly explains several verbal communication strategies (e.g., refusal skills, assertive communication) and their relevance in preventing risky behaviors.",
      "Demonstrates effective use and explanation of verbal communication skills, providing specific examples of how they can prevent risky behaviors in various scenarios.",
      "Masterfully articulates and demonstrates sophisticated verbal communication techniques, tailoring them effectively to diverse situations to prevent sexual involvement, HIV, other STDs, and unintended pregnancy."
    ],
    [
      "Demonstrates no understanding of nonverbal communication or its role in preventing sexual involvement, HIV, other STDs, and unintended pregnancy.",
      "Struggles to articulate the importance of nonverbal communication in preventing risky behaviors, with limited clarity.",
      "Identifies some nonverbal communication cues but provides superficial explanations of their use in preventing risky behaviors.",
      "Clearly explains several nonverbal communication strategies (e.g., body language, eye contact) and their relevance in preventing risky behaviors.",
      "Demonstrates effective understanding and explanation of nonverbal communication skills, providing specific examples of how they can prevent risky behaviors in various scenarios.",
      "Masterfully articulates and demonstrates sophisticated nonverbal communication techniques, tailoring them effectively to diverse situations to prevent sexual involvement, HIV, other STDs, and unintended pregnancy."
    ],
    [
      "Unable to apply communication skills to realistic scenarios related to sexual health and risky behaviors.",
      "Attempts to apply communication skills but struggles to adapt them effectively to realistic scenarios.",
      "Applies basic communication skills to some realistic scenarios, with limited success in achieving desired outcomes.",
      "Applies a range of communication skills effectively to various realistic scenarios, demonstrating understanding of context.",
      "Skillfully applies and adapts communication skills to complex and challenging scenarios, achieving positive outcomes in preventing risky behaviors.",
      "Exemplifies mastery in applying communication skills to a wide array of complex scenarios, demonstrating leadership and promoting responsible decision-making among peers."
    ]
  ]
}