{
  "criteria": [
    "Understanding the Physiological Effects of Alcohol and Drugs on Sexual Behavior",
    "Analyzing the Influence of Alcohol and Drugs on Sexual Decision-Making",
    "Recognizing the Impact on Sexual Health and Safety"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how alcohol and drugs affect sexual behavior.",
      "Shows a minimal understanding of how alcohol and drugs can alter sexual behavior.",
      "Identifies some physiological effects of alcohol and drugs on sexual behavior, but lacks detail.",
      "Explains several physiological effects of alcohol and drugs on sexual behavior, including impaired judgment and lowered inhibitions.",
      "Thoroughly explains the physiological effects of alcohol and drugs on sexual behavior, including changes in sensation, decision-making, and risk assessment.",
      "Demonstrates a comprehensive understanding of the physiological impacts, including long-term effects and how these substances interact with the body to influence sexual behavior and choices."
    ],
    [
      "Does not recognize the connection between substance use and sexual decision-making.",
      "Acknowledges a vague connection between alcohol\/drugs and sexual decisions, but provides no specifics.",
      "Describes how alcohol and drugs can lead to risky sexual behaviors, but lacks analysis.",
      "Analyzes how alcohol and drugs impair judgment, leading to increased risks such as unprotected sex or unwanted sexual advances.",
      "Critically analyzes the ways in which alcohol and drugs influence sexual decision-making, including consent, boundaries, and personal safety.",
      "Offers a nuanced analysis of the complex interplay between substance use, peer pressure, and personal values in the context of sexual decision-making, demonstrating insightful awareness."
    ],
    [
      "Shows no awareness of the relationship between alcohol\/drug use and sexual health or safety.",
      "Indicates a basic awareness that alcohol\/drugs might negatively affect sexual health and safety.",
      "Lists a few risks associated with alcohol\/drug use and sexual activity, such as STIs.",
      "Explains how alcohol and drugs increase the risk of STIs, unplanned pregnancies, and sexual assault.",
      "Evaluates the impact of alcohol and drugs on sexual health and safety, addressing both immediate and long-term consequences.",
      "Provides a comprehensive evaluation, including strategies for mitigating risks, promoting safer sexual behaviors, and seeking help when needed, showcasing a deep understanding of responsible decision-making."
    ]
  ]
}