{
  "criteria": [
    "Demonstrates understanding and respect for individual differences in discussions and activities.",
    "Actively listens to and values diverse perspectives and opinions.",
    "Demonstrates empathy and compassion towards individuals with different backgrounds and experiences."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no awareness or understanding of individual differences and diverse backgrounds; may exhibit disrespectful behavior.",
      "Demonstrates minimal awareness of individual differences; may occasionally show disrespect or insensitivity.",
      "Acknowledges individual differences but struggles to consistently demonstrate respect in interactions.",
      "Generally shows respect for individual differences and diverse backgrounds in most situations.",
      "Consistently demonstrates respect and understanding for individual differences, actively promoting inclusivity.",
      "Exemplifies respect for individual differences, acting as a role model and advocate for inclusivity and understanding within the classroom and beyond."
    ],
    [
      "Does not listen to or consider diverse perspectives; dismisses or ignores viewpoints different from their own.",
      "Rarely listens to diverse perspectives; shows limited engagement with viewpoints that differ from their own.",
      "Sometimes listens to diverse perspectives but struggles to understand or appreciate differing viewpoints.",
      "Listens to and considers diverse perspectives in most situations, showing an effort to understand.",
      "Actively listens to and values diverse perspectives, seeking to understand and appreciate different viewpoints.",
      "Demonstrates exceptional listening skills, actively seeking out and valuing diverse perspectives, fostering inclusive dialogue, and challenging their own biases."
    ],
    [
      "Shows no empathy or compassion towards individuals with different backgrounds; may exhibit insensitive or dismissive behavior.",
      "Demonstrates minimal empathy; struggles to understand or relate to the experiences of others.",
      "Occasionally shows empathy but lacks consistency in demonstrating compassion towards individuals with different backgrounds.",
      "Generally demonstrates empathy and compassion towards individuals with different backgrounds and experiences.",
      "Consistently demonstrates empathy and compassion, showing genuine concern for the well-being of others.",
      "Exemplifies empathy and compassion, actively supporting and advocating for individuals with diverse backgrounds and experiences, creating a welcoming and inclusive environment for all."
    ]
  ]
}