{
  "criteria": [
    "Understanding the Role of Witnesses and Bystanders",
    "Clarity and Accuracy of Explanation",
    "Examples and Application"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of how witnesses and bystanders can play a role in preventing violence.",
      "The student shows a minimal understanding, perhaps mentioning witnesses but not explaining their potential impact.",
      "The student identifies that witnesses can report dangerous situations, but provides limited detail.",
      "The student adequately explains how witnesses and bystanders can report dangerous situations, offering some examples.",
      "The student thoroughly explains the ways in which witnesses and bystanders can help prevent violence through reporting, giving clear and relevant examples.",
      "The student provides a comprehensive and insightful explanation, going beyond basic reporting to suggest proactive measures witnesses and bystanders can take, demonstrating a nuanced understanding of their roles."
    ],
    [
      "The explanation is unclear, inaccurate, or irrelevant to the topic.",
      "The explanation is difficult to understand and contains significant inaccuracies.",
      "The explanation is somewhat understandable but lacks clarity and contains some inaccuracies.",
      "The explanation is generally clear and accurate, but lacks detail or depth.",
      "The explanation is clear, accurate, and provides sufficient detail.",
      "The explanation is exceptionally clear, accurate, detailed, and demonstrates a strong command of the subject matter."
    ],
    [
      "No examples are provided.",
      "Provides an unclear or irrelevant example.",
      "Provides a vague or general example with a questionable level of relevance.",
      "Provides a relevant example that adequately illustrates the role of witnesses and bystanders.",
      "Provides well-developed and relevant examples that effectively illustrate the ways witnesses and bystanders can help prevent violence.",
      "Provides multiple, diverse, and insightful examples, demonstrating a deep understanding of how witnesses and bystanders can intervene in various scenarios."
    ]
  ]
}