{
  "criteria": [
    "Understanding of Marketing Techniques",
    "Analysis of Influence",
    "Evaluation of Effects on Use and Abuse"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of marketing techniques used to promote alcohol, tobacco, and other drugs.",
      "Shows a limited understanding of one or two marketing techniques.",
      "Identifies several marketing techniques but struggles to explain them clearly.",
      "Clearly explains several marketing techniques and how they are used.",
      "Provides a comprehensive explanation of various marketing techniques, including persuasive language and imagery.",
      "Offers a nuanced understanding of sophisticated marketing strategies, including targeted advertising and psychological manipulation."
    ],
    [
      "Fails to analyze the influence of marketing and advertising on substance use.",
      "Offers a basic analysis with limited supporting evidence.",
      "Analyzes the influence with some evidence, but connections are superficial.",
      "Provides a solid analysis of the influence of marketing and advertising, supported by relevant evidence.",
      "Presents a well-reasoned analysis that thoroughly explores the influence and impact of marketing on substance use.",
      "Presents a insightful and critical analysis, demonstrating an advanced understanding of how marketing contributes to substance use and abuse."
    ],
    [
      "Unable to evaluate the effects of marketing and advertising on alcohol, tobacco, and other drug use and abuse.",
      "Attempts to evaluate the effects, but provides little supporting information.",
      "Offers a limited evaluation of effects, mentioning a few potential consequences.",
      "Evaluates the effects with specific examples and demonstrates an understanding of potential consequences.",
      "Provides a comprehensive evaluation of the short-term and long-term effects of marketing on substance use and abuse.",
      "Critically evaluates the effects, offering insights into the complexities of addiction and the role of marketing in perpetuating harmful behaviors."
    ]
  ]
}