{
  "criteria": [
    "Identification of Cultural Influences",
    "Understanding of Media's Role",
    "Explanation of Impact"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any cultural influences on body image.",
      "Identifies one or two cultural influences with limited accuracy.",
      "Identifies some cultural influences (e.g., family traditions, ethnic norms) but lacks depth.",
      "Identifies several cultural influences on body image and provides basic explanations.",
      "Clearly identifies and explains multiple cultural influences on body image, demonstrating understanding of their impact.",
      "Provides a comprehensive analysis of diverse cultural influences on body image, including nuanced perspectives and insightful observations."
    ],
    [
      "Does not address the role of media in shaping body image.",
      "Mentions media but does not explain its influence.",
      "Describes media's role in portraying ideal body types with limited detail.",
      "Explains how media (e.g., social media, advertising) influences perceptions of body image.",
      "Analyzes the various ways media impacts body image, including specific examples and potential consequences.",
      "Critically evaluates the pervasive and often unrealistic portrayals of body image in media, offering informed insights into its psychological and social effects."
    ],
    [
      "No explanation of the impact of cultural and media influences on body image is given.",
      "Provides a vague or superficial explanation of the impact.",
      "Describes the impact of cultural and media influences with some generalities.",
      "Explains the impact of cultural and media influences on body image, including some specific examples.",
      "Analyzes the impact of cultural and media influences on body image, providing detailed examples and explanations.",
      "Critically evaluates the impact of cultural and media influences on body image, providing nuanced insights and demonstrating a comprehensive understanding of the topic."
    ]
  ]
}