{
  "criteria": [
    "Understanding the Importance of Reporting",
    "Identification of Appropriate Authorities and Trusted Adults",
    "Explanation of Legal and Ethical Implications"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of why reporting rape and sexual assault is important.",
      "Shows minimal understanding, with significant misconceptions about the reporting process.",
      "Displays basic understanding, mentioning one or two reasons for reporting but lacks depth.",
      "Explains several reasons for reporting, including personal safety and seeking justice, but with limited elaboration.",
      "Clearly articulates multiple reasons for reporting, highlighting the importance of safety, justice, and preventing future harm.",
      "Provides a comprehensive explanation of the multifaceted importance of reporting, including legal, ethical, and community health perspectives."
    ],
    [
      "Unable to identify any appropriate authorities or trusted adults to report to.",
      "Identifies one potential authority figure or trusted adult, but selection is questionable or inappropriate.",
      "Identifies a few authorities or trusted adults, but understanding of their roles is limited.",
      "Lists several appropriate authorities and trusted adults, such as police, counselors, and family members.",
      "Clearly identifies a range of appropriate authorities and trusted adults, explaining their specific roles and responsibilities in handling reports.",
      "Demonstrates a nuanced understanding of the different types of support and intervention offered by various authorities and trusted adults, tailoring the reporting decision to specific needs and circumstances."
    ],
    [
      "Shows no awareness of the legal or ethical considerations related to reporting rape and sexual assault.",
      "Demonstrates a vague or inaccurate understanding of legal or ethical issues.",
      "Mentions legal or ethical aspects but lacks specific details or clear understanding.",
      "Explains some of the legal rights of survivors and the ethical obligations of reporters, but with limited depth.",
      "Articulates the legal rights of survivors, the ethical duties of mandated reporters, and the consequences of not reporting, providing a well-rounded perspective.",
      "Analyzes the complex interplay of legal, ethical, and societal factors influencing reporting decisions, including issues of confidentiality, consent, and power dynamics."
    ]
  ]
}