{
  "criteria": [
    "Identification of Pressure Techniques",
    "Analysis of Motives Behind Pressure Techniques",
    "Understanding of Consequences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student cannot identify any techniques used to pressure someone into violent behavior or being a target.",
      "Student identifies one technique but struggles to explain how it applies to violent behavior.",
      "Student identifies two techniques but demonstrates limited understanding of their impact.",
      "Student identifies three techniques and provides a basic explanation of their connection to violent behavior.",
      "Student identifies four techniques and explains their connection to violent behavior with clear examples.",
      "Student identifies five or more techniques, thoroughly explains their connection to violent behavior, and provides insightful examples."
    ],
    [
      "Student does not attempt to analyze the motives behind the use of pressure techniques.",
      "Student offers a vague or inaccurate analysis of motives.",
      "Student identifies a potential motive but struggles to support it with evidence.",
      "Student identifies two motives and provides some supporting evidence.",
      "Student analyzes multiple motives and provides clear, relevant supporting evidence.",
      "Student provides a comprehensive analysis of various motives, demonstrating a deep understanding of the underlying psychology and social dynamics."
    ],
    [
      "Student shows no understanding of the potential consequences of succumbing to or resisting pressure.",
      "Student identifies one potential consequence but struggles to articulate its significance.",
      "Student identifies two consequences but demonstrates limited understanding of their impact.",
      "Student identifies three consequences and provides a basic explanation of their potential impact.",
      "Student identifies multiple consequences and explains their potential impact with clear examples.",
      "Student provides a comprehensive analysis of the potential consequences, demonstrating a nuanced understanding of the ripple effects of violent behavior."
    ]
  ]
}