{
  "criteria": [
    "Understanding of Abstinence as a Prevention Method",
    "Comparison to Other Prevention Methods",
    "Accuracy and Use of Supporting Information"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of abstinence as a method for preventing HIV, STDs, and pregnancy.",
      "The student shows a minimal understanding of abstinence and its role in preventing HIV, STDs, and pregnancy, with significant misconceptions.",
      "The student demonstrates a basic understanding of abstinence as a preventive measure but struggles to explain its effectiveness compared to other methods.",
      "The student adequately explains abstinence as a method for preventing HIV, STDs, and pregnancy, outlining some of its benefits.",
      "The student clearly and accurately analyzes abstinence as an effective method for prevention, providing supporting reasons and comparing it to other methods.",
      "The student comprehensively analyzes why abstinence is the most effective method for preventing HIV, STDs, and pregnancy, providing a detailed and nuanced explanation with supporting evidence."
    ],
    [
      "The student does not mention or compare abstinence to other methods of prevention.",
      "The student vaguely mentions other prevention methods but does not compare them to abstinence or inaccurately describes them.",
      "The student identifies other prevention methods but struggles to compare their effectiveness to abstinence.",
      "The student compares abstinence to other prevention methods, outlining some advantages and disadvantages of each.",
      "The student thoroughly compares abstinence to other prevention methods, highlighting the benefits of abstinence.",
      "The student expertly compares abstinence to other methods, analyzing the effectiveness, risks, and benefits of each to show why abstinence is the most effective choice."
    ],
    [
      "The student's explanation contains significant inaccuracies and lacks supporting information.",
      "The student's explanation contains several inaccuracies and limited supporting information.",
      "The student's explanation contains some inaccuracies and relies on limited supporting information.",
      "The student provides generally accurate information with some supporting details.",
      "The student provides accurate information with relevant and specific supporting details.",
      "The student provides accurate, detailed information with compelling and well-explained supporting evidence, demonstrating a mastery of the topic."
    ]
  ]
}