{
  "criteria": [
    "Understanding of Autonomy and Consent",
    "Knowledge of Legal and Ethical Implications",
    "Understanding of Power Dynamics and Coercion"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of individual autonomy or the concept of consent in sexual contact.",
      "Shows a limited understanding of autonomy and consent, with significant misconceptions.",
      "Displays a basic understanding of autonomy and consent, but struggles to articulate specific reasons for the right to refuse sexual contact.",
      "Explains autonomy and consent as reasons, but lacks depth or supporting details.",
      "Clearly explains individual autonomy and the necessity of consent as valid reasons for refusing sexual contact, providing some supporting details.",
      "Thoroughly explains individual autonomy and the necessity of consent, providing detailed reasoning and examples to support the right to refuse sexual contact."
    ],
    [
      "Shows no awareness of legal or ethical considerations related to sexual consent and refusal.",
      "Demonstrates minimal awareness of legal or ethical implications, with inaccuracies or gaps in understanding.",
      "Identifies legal or ethical implications, but struggles to explain their relevance to the right to refuse sexual contact.",
      "Explains simple legal and ethical implications of sexual consent and refusal.",
      "Clearly explains relevant legal and ethical considerations, such as laws against sexual assault and ethical principles of respect and bodily integrity.",
      "Provides a comprehensive explanation of legal and ethical implications, including specific laws, ethical frameworks, and the consequences of violating consent."
    ],
    [
      "Demonstrates no understanding of how power dynamics or coercion can affect the ability to refuse sexual contact.",
      "Shows limited awareness of power dynamics and coercion, with significant misconceptions.",
      "Recognizes that power dynamics and coercion exist, but struggles to explain how they undermine the right to refuse sexual contact.",
      "Explains that power dynamics and coercion make it hard to refuse sexual contact, but lacks depth or supporting details.",
      "Clearly explains how power dynamics (e.g., age, social status) and coercion (e.g., threats, manipulation) can compromise an individual's ability to freely refuse sexual contact.",
      "Provides a nuanced explanation of power dynamics and coercion, including specific examples and strategies for recognizing and addressing them in the context of sexual consent."
    ]
  ]
}