{
  "criteria": [
    "Understanding of EC Section 49330 and its implications.",
    "Ability to articulate the importance of reporting weapon possession.",
    "Understanding of procedures and responsibilities related to reporting weapon possession."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of EC Section 49330 or its implications regarding reporting weapon possession.",
      "Student shows minimal understanding of EC Section 49330; struggles to explain its basic purpose.",
      "Student demonstrates a partial understanding of EC Section 49330, but lacks detail or clarity in explaining its implications.",
      "Student adequately explains EC Section 49330 and its general implications for reporting weapon possession.",
      "Student clearly explains EC Section 49330, detailing its implications for safety and legal responsibilities.",
      "Student provides a comprehensive explanation of EC Section 49330, including its background, specific implications, and related legal and ethical considerations."
    ],
    [
      "Student cannot articulate any reasons why reporting weapon possession is important.",
      "Student offers vague or unclear reasons for reporting weapon possession.",
      "Student lists a few basic reasons for reporting weapon possession, but lacks elaboration.",
      "Student explains several relevant reasons for the importance of reporting weapon possession, such as safety and legal compliance.",
      "Student comprehensively explains the importance of reporting weapon possession, including ethical, legal, and safety considerations.",
      "Student demonstrates a nuanced understanding of the importance of reporting weapon possession, including potential consequences of not reporting and benefits of reporting in various scenarios."
    ],
    [
      "Student shows no awareness of the procedures or responsibilities associated with reporting weapon possession.",
      "Student has minimal awareness of reporting procedures or responsibilities.",
      "Student identifies some procedures or responsibilities, but displays gaps in knowledge.",
      "Student describes the basic procedures and responsibilities related to reporting weapon possession.",
      "Student clearly explains the procedures and responsibilities, including who to report to and the importance of accurate information.",
      "Student demonstrates comprehensive knowledge of reporting procedures and responsibilities, including relevant school policies and legal requirements, and can explain the potential consequences of failing to fulfill these responsibilities."
    ]
  ]
}