{
  "criteria": [
    "Identification of Risky Situations: The student's ability to recognize and articulate situations involving alcohol, tobacco, and other drugs that pose a risk to their health and well-being.",
    "Application of Refusal Skills: The student's ability to demonstrate and describe effective refusal strategies when faced with risky situations involving substance use.",
    "Application of Negotiation Skills: The student's ability to apply negotiation skills to avoid risky situations, particularly those involving peer pressure related to substance use.",
    "Understanding of Consequences: Demonstrates an understanding of the potential consequences of engaging in risky situations involving substance use."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any risky situations involving substance use.",
      "Identifies a risky situation but lacks detail or clarity.",
      "Identifies a few risky situations but misses key elements or provides superficial explanations.",
      "Identifies several risky situations involving substance use with reasonable clarity.",
      "Clearly identifies various risky situations involving substance use, providing specific details and showing good understanding.",
      "Insightfully identifies a comprehensive range of risky situations involving substance use, demonstrating excellent understanding and awareness."
    ],
    [
      "Unable to describe or demonstrate any refusal skills.",
      "Describes a refusal skill but it is vague or inappropriate for the situation.",
      "Describes a few refusal skills, but they are not always effective or well-explained.",
      "Demonstrates and describes several refusal skills that could be effective in specific situations.",
      "Confidently demonstrates and articulates a variety of effective refusal skills, tailored to different risky scenarios.",
      "Expertly demonstrates and explains a comprehensive set of refusal skills, adapting strategies for various complex and challenging situations."
    ],
    [
      "Does not demonstrate or describe any negotiation skills.",
      "Describes a negotiation skill but it is not relevant or effective in avoiding risky situations.",
      "Describes a few negotiation skills, but application is limited or unclear.",
      "Demonstrates and describes several negotiation skills that could be used to navigate risky situations involving substance use.",
      "Confidently demonstrates and articulates a range of negotiation skills, adapting strategies for different social pressures.",
      "Expertly demonstrates and explains a comprehensive set of negotiation skills, effectively navigating complex social dynamics and peer pressures."
    ],
    [
      "Shows no understanding of the potential consequences.",
      "Demonstrates minimal understanding of potential consequences.",
      "Identifies a few potential consequences, but lacks depth.",
      "Articulates several potential consequences of risky situations.",
      "Clearly explains a range of potential consequences, showing a good understanding of the risks.",
      "Insightfully analyzes the potential short-term and long-term consequences, demonstrating a comprehensive understanding of the risks and implications."
    ]
  ]
}