{
  "criteria": [
    "Accurately defines and differentiates between passive, aggressive, and assertive communication styles.",
    "Identifies the characteristics and impact of each communication style on relationships.",
    "Provides examples of situations and analyzes the appropriateness of using each communication style."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not define or differentiate between any communication styles.",
      "Attempts to define communication styles but shows significant confusion and inaccuracies.",
      "Provides basic definitions of the communication styles but struggles to differentiate effectively between them.",
      "Defines passive, aggressive, and assertive communication with some accuracy but may have minor misunderstandings.",
      "Clearly defines passive, aggressive, and assertive communication and accurately differentiates between them with supporting examples.",
      "Masterfully defines and differentiates between passive, aggressive, and assertive communication, providing insightful examples and demonstrating a comprehensive understanding of their nuances."
    ],
    [
      "Does not identify characteristics or the impact of any communication style.",
      "Attempts to identify characteristics and impacts but presents inaccurate or irrelevant information.",
      "Identifies a few basic characteristics and impacts with limited accuracy.",
      "Identifies some characteristics and impacts of each communication style, but the connection to relationships is superficial.",
      "Clearly identifies characteristics and explains the impact of each communication style on relationships with relevant examples.",
      "Demonstrates a deep understanding of the characteristics and impact of each communication style on relationships, providing insightful analysis and real-world applications."
    ],
    [
      "Does not provide examples or analyze the use of any communication style in any situation.",
      "Provides irrelevant or completely inappropriate examples and analyses.",
      "Provides examples that are vague or analyses that do not accurately correspond to the provided examples.",
      "Provides somewhat relevant examples and analyses but may contain inaccuracies or oversimplifications.",
      "Provides appropriate examples of situations and analyzes the suitability of each communication style with clear reasoning.",
      "Provides exceptional and nuanced examples of situations, expertly analyzing the appropriateness of each communication style with sophisticated reasoning and insight."
    ]
  ]
}