{
  "criteria": [
    "Understanding of Nutrient Density",
    "Practical Application in School Setting",
    "Communication and Advocacy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of what nutrient-dense foods are.",
      "Shows a limited understanding of nutrient-dense foods, struggles to identify examples.",
      "Identifies some nutrient-dense foods but lacks a clear understanding of why they are beneficial.",
      "Understands nutrient density and can identify examples, but struggles to explain the rationale behind promoting them in schools.",
      "Clearly understands and identifies nutrient-dense foods, explains the rationale for promoting them in schools, and recognizes potential challenges.",
      "Demonstrates a comprehensive understanding of nutrient density, advocates effectively for its importance in schools, and proposes solutions to potential challenges with detailed reasoning."
    ],
    [
      "Unable to suggest any practical ways to encourage nutrient-dense food choices in school.",
      "Suggests one impractical or unrealistic way to encourage nutrient-dense food choices.",
      "Suggests a few basic ways to encourage nutrient-dense food choices with limited consideration of feasibility.",
      "Suggests several reasonable ways to encourage nutrient-dense food choices in the school setting.",
      "Proposes well-thought-out and practical strategies to encourage nutrient-dense food choices, considering the school environment and student preferences.",
      "Develops innovative, practical, and comprehensive strategies to encourage nutrient-dense food choices, anticipates potential barriers, and provides solutions for successful implementation."
    ],
    [
      "Unable to communicate ideas about encouraging nutrient-dense food choices.",
      "Communicates ideas unclearly and without supporting evidence.",
      "Communicates ideas adequately but lacks persuasive arguments or supporting evidence.",
      "Communicates ideas clearly and provides some supporting evidence to encourage nutrient-dense food choices.",
      "Communicates ideas effectively and persuasively, using strong evidence and tailoring the message to the audience.",
      "Communicates ideas exceptionally well, inspiring others to prioritize nutrient-dense food choices through compelling arguments, creative communication methods, and proactive engagement."
    ]
  ]
}