{
  "criteria": [
    "Understanding the Importance of Physical Activity",
    "Identifying Opportunities for Physical Activity",
    "Supporting and Promoting Physical Activity"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the benefits of physical activity or the need to support it.",
      "Shows a limited understanding of the importance of physical activity.",
      "Understands some benefits of physical activity but struggles to connect it to school or community opportunities.",
      "Demonstrates a good understanding of the benefits of physical activity and its relevance to school and community.",
      "Shows a strong understanding of the importance of physical activity and its impact on overall health and well-being.",
      "Exhibits a comprehensive understanding of the multifaceted benefits of physical activity and advocates for its promotion."
    ],
    [
      "Unable to identify any opportunities for increased physical activity in school or the community.",
      "Identifies one or two basic opportunities for physical activity with prompting.",
      "Identifies a few opportunities for physical activity, but they are not well-developed or feasible.",
      "Identifies several relevant opportunities for physical activity in both school and community settings.",
      "Proposes multiple, well-thought-out opportunities for increasing physical activity that are tailored to the school and community.",
      "Develops innovative and comprehensive strategies for creating a culture of physical activity in the school and community."
    ],
    [
      "Does not offer any support or suggestions for promoting physical activity.",
      "Offers minimal support or suggestions for promoting physical activity.",
      "Suggests basic ways to support physical activity but lacks a clear plan.",
      "Provides concrete suggestions for supporting and promoting physical activity with some evidence of planning.",
      "Actively supports and promotes physical activity through creative initiatives and outreach.",
      "Leads and inspires others to support and promote physical activity, creating a lasting impact on the school and community."
    ]
  ]
}