{
  "criteria": [
    "Identification of Nonviolent Responses",
    "Understanding of Effectiveness",
    "Application to Personal Situations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of nonviolent responses to anger or upset feelings.",
      "The student identifies only one nonviolent response, but it is vague or poorly explained.",
      "The student identifies 2 nonviolent responses, but explanations lack depth or clarity.",
      "The student identifies 3 nonviolent responses with some explanation of how they can be used.",
      "The student identifies 4 nonviolent responses with clear explanations and examples of when they are appropriate.",
      "The student identifies multiple (5+) nonviolent responses with detailed explanations, examples, and demonstrates a comprehensive understanding of their application in various situations."
    ],
    [
      "The student does not attempt to assess the effectiveness of nonviolent responses.",
      "The student makes a weak attempt to assess the effectiveness of nonviolent responses with no justifications.",
      "The student provides a basic assessment of effectiveness for 1 response, but lacks justification or rationale.",
      "The student assesses the effectiveness of multiple responses, providing some justification for their assessment.",
      "The student assesses the effectiveness of several responses with clear and logical justification, considering different contexts.",
      "The student provides a thorough and nuanced assessment of the effectiveness of multiple responses, justifying their reasoning with well-supported arguments and considering various situational factors."
    ],
    [
      "The student does not connect the responses to personal situations or experiences.",
      "The student vaguely mentions a personal situation but doesn't explain how a nonviolent response could be applied.",
      "The student describes a personal situation and attempts to connect it to a nonviolent response, but the connection is unclear or superficial.",
      "The student effectively connects a personal situation to a specific nonviolent response, explaining how it could be used to manage anger or upset feelings.",
      "The student provides a detailed account of a personal situation and thoroughly explains how multiple nonviolent responses could be applied, considering potential challenges and outcomes.",
      "The student demonstrates exceptional insight by analyzing complex personal situations and identifying the most appropriate and effective nonviolent responses, justifying their choices with thoughtful reasoning and self-awareness."
    ]
  ]
}