{
  "criteria": [
    "Understanding the Correlation Between Weapons and Violence",
    "Application of Legal Definition of a Weapon",
    "Discussion on Seriousness of Violent Injuries"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student shows no understanding of how weapons increase the risk of violent injuries.",
      "The student demonstrates a minimal understanding, vaguely mentioning weapons and violence without clear connection.",
      "The student identifies that weapons can increase the risk of violence but does not explain how or why.",
      "The student explains that weapons increase risk due to their potential for harm, but lacks specific examples or details.",
      "The student clearly explains how the presence of weapons increases the risk of serious violent injuries, providing examples and reasoning.",
      "The student comprehensively explains the increased risk, providing detailed examples, discussing the psychological impact of weapons, and citing relevant data or studies."
    ],
    [
      "The student does not reference or acknowledge the legal definition of a weapon.",
      "The student vaguely mentions that there is a legal definition of a weapon without providing any details.",
      "The student refers to a legal definition but does not accurately describe it or apply it to the context of violence.",
      "The student demonstrates a basic understanding of the legal definition of a weapon and attempts to apply it, but with limited success.",
      "The student accurately describes the legal definition of a weapon (as per EC Section 49330 and the Glossary) and appropriately applies it when discussing the risk of violence.",
      "The student expertly integrates the legal definition of a weapon into their explanation, demonstrating a nuanced understanding of how legal classifications impact the discussion of violence and safety, and discussing the impact on schools."
    ],
    [
      "The student does not address the seriousness of violent injuries in relation to weapons.",
      "The student mentions injuries but does not convey an understanding of the potential long-term or severe consequences.",
      "The student acknowledges that violent injuries can be serious but provides no specific examples or details.",
      "The student describes some serious consequences of violent injuries, but the connection to the presence of weapons is not clearly articulated.",
      "The student effectively explains how the presence of weapons can lead to serious violent injuries, providing specific examples of potential consequences (e.g., long-term physical disabilities, psychological trauma).",
      "The student provides a comprehensive and insightful discussion of the range of serious violent injuries that can result from the presence of weapons, including physical, psychological, and societal impacts, and offers potential solutions or preventative measures."
    ]
  ]
}