{
  "criteria": [
    "Identification of Technology and Media Influences",
    "Analysis of Positive and Negative Impacts",
    "Application to Personal Health and Wellness"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any influences of technology and media on physical activity.",
      "Identifies one or two basic influences of technology or media on physical activity, but lacks detail or accuracy.",
      "Identifies some influences of technology and media on physical activity with limited detail and some inaccuracies.",
      "Identifies several influences of technology and media on physical activity with reasonable detail and accuracy.",
      "Clearly identifies multiple significant influences of technology and media on physical activity with good detail and accuracy.",
      "Thoroughly identifies and explains a wide range of influences of technology and media on physical activity with excellent detail and accuracy."
    ],
    [
      "Does not analyze the positive or negative impacts of technology and media on physical activity.",
      "Attempts to analyze positive or negative impacts, but lacks clarity or supporting evidence.",
      "Provides a superficial analysis of either positive or negative impacts of technology and media on physical activity.",
      "Analyzes both positive and negative impacts of technology and media on physical activity with some supporting evidence.",
      "Provides a clear and balanced analysis of the positive and negative impacts of technology and media on physical activity with relevant examples.",
      "Offers a comprehensive and insightful analysis of the positive and negative impacts of technology and media on physical activity, demonstrating a nuanced understanding."
    ],
    [
      "Does not connect the analysis of technology and media to personal health and wellness.",
      "Makes a weak or unclear connection between technology\/media and personal health and wellness.",
      "Briefly mentions the connection between technology\/media influences and personal health and wellness.",
      "Explains how technology and media influences can affect personal health and wellness with some specific examples.",
      "Clearly articulates how technology and media influences impact personal health and wellness, providing practical examples and considerations.",
      "Demonstrates a deep understanding of how technology and media influences significantly shape personal health and wellness, offering actionable strategies for promoting positive habits."
    ]
  ]
}