{
  "criteria": [
    "Identification of Healthy Relationship Characteristics",
    "Application of Decision-Making Process",
    "Analysis of Characteristics within a Relationship Scenario"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any characteristics of healthy relationships.",
      "The student identifies one characteristic of healthy relationships, but it is vague or inaccurate.",
      "The student identifies two characteristics of healthy relationships, but descriptions lack depth or clarity.",
      "The student identifies three characteristics of healthy relationships and provides basic descriptions for each.",
      "The student identifies four characteristics of healthy relationships and provides clear and accurate descriptions.",
      "The student identifies five or more characteristics of healthy relationships with detailed and insightful descriptions, demonstrating a comprehensive understanding."
    ],
    [
      "The student does not apply a decision-making process.",
      "The student attempts to apply a decision-making process, but it is incomplete or poorly executed.",
      "The student applies a decision-making process with limited effectiveness, missing key steps or considerations.",
      "The student applies a decision-making process that includes most key steps, but some areas are underdeveloped.",
      "The student applies a decision-making process thoroughly, considering various factors and potential outcomes.",
      "The student applies a decision-making process in a sophisticated manner, demonstrating critical thinking and nuanced understanding of the complexities of healthy relationships."
    ],
    [
      "The student does not attempt to analyze characteristics within a relationship scenario.",
      "The student attempts to analyze characteristics but demonstrates significant misunderstanding or inaccuracy.",
      "The student's analysis is superficial and lacks connection to the decision-making process or healthy relationship characteristics.",
      "The student provides a basic analysis connecting some characteristics to the scenario and decision-making process.",
      "The student offers a detailed analysis, clearly connecting healthy relationship characteristics to the decision-making process in the given scenario.",
      "The student provides a comprehensive and insightful analysis, demonstrating a deep understanding of the interplay between relationship characteristics, decision-making, and potential outcomes, with mature and critical thinking."
    ]
  ]
}