{
  "criteria": [
    "Understanding of Risk Factors",
    "Commitment to Avoidance Strategies",
    "Personal Reflection and Application"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of situations, people, or activities that could lead to violence or delinquency.",
      "Shows minimal awareness of potential risk factors for violence and delinquency.",
      "Identifies some risk factors but struggles to explain how they contribute to violence or delinquency.",
      "Identifies and explains several risk factors related to violence and delinquency with reasonable clarity.",
      "Clearly identifies and thoroughly explains various risk factors, demonstrating a solid understanding of their impact.",
      "Exhibits a comprehensive understanding of risk factors, providing nuanced explanations and insightful analysis."
    ],
    [
      "Expresses no commitment to avoiding risky situations or influences.",
      "Expresses a vague or inconsistent commitment to avoiding risky situations.",
      "States an intention to avoid risky situations but lacks specific strategies or plans.",
      "Identifies some avoidance strategies and expresses a general commitment to using them.",
      "Clearly articulates specific avoidance strategies and demonstrates a strong commitment to implementing them consistently.",
      "Develops a comprehensive plan for avoiding violence and delinquency, demonstrating proactive commitment and resilience."
    ],
    [
      "Shows no personal reflection on how violence or delinquency may affect their own life or community.",
      "Shows limited personal reflection and struggles to connect the issues to their own experiences.",
      "Identifies some personal connections to the issues but lacks depth and insight.",
      "Reflects on personal experiences and demonstrates an awareness of how violence or delinquency may impact them or their community.",
      "Articulates a clear understanding of personal vulnerability and proposes thoughtful strategies for resilience and support.",
      "Demonstrates deep personal reflection and profound insight into the complex factors that influence violence and delinquency, articulating a clear plan to promote positive change."
    ]
  ]
}