{
  "criteria": [
    "Understanding of Sexual Exploitation",
    "Explanation of Internet's Role in Sexual Exploitation",
    "Identification of Risks and Dangers Online"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of sexual exploitation or its forms.",
      "Student demonstrates a minimal understanding of sexual exploitation, lacking clarity or detail.",
      "Student shows a basic understanding of sexual exploitation but struggles to explain its various forms.",
      "Student adequately explains sexual exploitation and some of its forms, but with limited examples.",
      "Student clearly explains sexual exploitation and provides multiple examples of its forms with good detail.",
      "Student comprehensively explains sexual exploitation, providing a thorough understanding of its various forms and potential impacts."
    ],
    [
      "Student does not explain how the internet can be used for sexual exploitation.",
      "Student vaguely mentions the internet’s role but lacks specific details or examples.",
      "Student provides a limited explanation of how the internet can be used for sexual exploitation, but with unclear examples.",
      "Student explains some ways the internet can be used for sexual exploitation, providing a few relevant examples.",
      "Student clearly explains multiple ways the internet can be used for sexual exploitation, providing relevant and detailed examples.",
      "Student comprehensively explains various ways the internet facilitates sexual exploitation, including detailed examples and potential consequences."
    ],
    [
      "Student fails to identify any risks or dangers associated with online interactions related to sexual exploitation.",
      "Student vaguely identifies some online risks but lacks specific examples or explanations.",
      "Student identifies a few risks but struggles to explain their connection to sexual exploitation.",
      "Student identifies several risks and provides some explanation of their connection to sexual exploitation.",
      "Student clearly identifies and explains multiple risks and dangers associated with online interactions and their relation to sexual exploitation.",
      "Student comprehensively identifies and analyzes numerous risks and dangers associated with online interactions, providing a deep understanding of their connection to sexual exploitation and potential prevention strategies."
    ]
  ]
}