{
  "criteria": [
    "Identification of Risks and Consequences",
    "Application of Decision-Making Process",
    "Consideration of Alternatives and Strategies",
    "Personal Values and Influences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Fails to identify any risks or consequences associated with alcohol, tobacco, and other drug use.",
      "Identifies only one risk or consequence associated with alcohol, tobacco, and other drug use and does not give any specific details.",
      "Identifies some risks and consequences associated with alcohol, tobacco, and other drug use but lacks detail.",
      "Identifies several risks and consequences associated with alcohol, tobacco, and other drug use with reasonable detail.",
      "Identifies most risks and consequences associated with alcohol, tobacco, and other drug use with good detail and explanation.",
      "Identifies all relevant risks and consequences associated with alcohol, tobacco, and other drug use with thorough detail, providing clear and accurate explanations."
    ],
    [
      "Does not demonstrate any application of a decision-making process.",
      "Attempts to apply a decision-making process but demonstrates little understanding of the steps involved.",
      "Shows a basic understanding of the decision-making process but struggles to apply it to specific situations.",
      "Applies a decision-making process to avoid alcohol, tobacco, and other drugs in some situations, but not consistently.",
      "Consistently applies a decision-making process to avoid alcohol, tobacco, and other drugs in various situations, demonstrating a clear understanding of the process.",
      "Expertly applies a comprehensive decision-making process, adapting it effectively to complex and diverse situations involving alcohol, tobacco, and other drugs. Provides rationale."
    ],
    [
      "Does not consider any alternatives or strategies for avoiding substance use.",
      "Mentions one or two alternatives or strategies without explaining them.",
      "Identifies a few alternatives or strategies for avoiding substance use, but the explanations are superficial.",
      "Describes several alternatives or strategies for avoiding substance use with some level of detail.",
      "Discusses a variety of effective alternatives and strategies for avoiding substance use, explaining their benefits and drawbacks.",
      "Presents a comprehensive range of innovative and effective alternatives and strategies for avoiding substance use, tailored to specific situations and personal preferences. Provides deep explanations."
    ],
    [
      "Does not demonstrate any awareness of personal values or external influences.",
      "Briefly acknowledges the influence of personal values or external pressures.",
      "Recognizes the role of personal values and external influences in decision-making, but lacks deeper analysis.",
      "Analyzes how personal values and external influences might affect decisions related to substance use, considering both positive and negative impacts.",
      "Explores the complex interplay of personal values, peer pressure, media, and other factors in shaping decisions about alcohol, tobacco, and other drugs. Demonstrates in depth introspection.",
      "Demonstrates a profound understanding of the dynamic relationship between personal values, social norms, and persuasive tactics, using this knowledge to advocate for responsible choices and challenge harmful influences."
    ]
  ]
}