{
  "criteria": [
    "Identification of Internal Influences",
    "Analysis of External Influences",
    "Understanding of Interrelationships"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any internal influences on growth, development, relationships, or sexual behavior.",
      "The student identifies at least one internal influence but provides no analysis or explanation.",
      "The student identifies one or two internal influences with a basic, limited explanation of their impact.",
      "The student identifies several internal influences and provides a clear explanation of their impact on growth, development, relationships, or sexual behavior.",
      "The student comprehensively identifies multiple internal influences, providing a thorough explanation of their nuanced impact with relevant examples.",
      "The student expertly identifies and analyzes multiple internal influences, providing insightful explanations of their complex and nuanced impact on growth, development, relationships, and sexual behavior, demonstrating a sophisticated understanding."
    ],
    [
      "The student fails to identify or analyze any external influences.",
      "The student identifies at least one external influence but does not explain its impact.",
      "The student identifies one or two external influences and provides a superficial explanation of their impact.",
      "The student identifies multiple external influences and provides a clear explanation of their impact on growth, development, relationships, or sexual behavior.",
      "The student provides a comprehensive analysis of multiple external influences, explaining their varied impact and providing relevant examples.",
      "The student expertly analyzes the complex interplay of multiple external influences, providing insightful explanations of their nuanced impact on growth, development, relationships, and sexual behavior, demonstrating a sophisticated understanding."
    ],
    [
      "The student shows no understanding of how these influences interrelate.",
      "The student briefly mentions the connection between internal and external influences.",
      "The student describes a basic relationship between at least one internal and one external influence.",
      "The student explains how internal and external influences interact to affect one or more of the following: growth and development, relationships, and sexual behavior.",
      "The student provides a detailed explanation of how internal and external influences interact, using examples to support their analysis.",
      "The student expertly analyzes the intricate interrelationships between internal and external influences, providing nuanced insights and demonstrating a comprehensive understanding of their combined impact on growth, development, relationships, and sexual behavior."
    ]
  ]
}