{
  "criteria": [
    "Identification of Conflict Resolution Strategies",
    "Application to Real-Life Scenarios",
    "Understanding of Nonviolent Principles"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student is unable to identify any conflict resolution strategies.",
      "Student identifies one conflict resolution strategy, but it is poorly described or inappropriate for nonviolent conflict resolution.",
      "Student identifies two conflict resolution strategies with limited description or understanding.",
      "Student identifies three conflict resolution strategies, showing basic understanding and relevance to nonviolent conflict resolution.",
      "Student identifies four conflict resolution strategies with clear descriptions and explains how they contribute to nonviolent conflict resolution.",
      "Student identifies multiple conflict resolution strategies, providing detailed explanations and examples of how they effectively contribute to nonviolent conflict resolution in various situations."
    ],
    [
      "Student does not attempt to apply conflict resolution strategies to real-life scenarios.",
      "Student attempts to apply a strategy but the application is unrealistic or unsafe.",
      "Student applies strategies to scenarios with limited success or understanding of the outcomes.",
      "Student applies strategies to scenarios with moderate success, showing a basic understanding of potential outcomes.",
      "Student effectively applies strategies to real-life scenarios, demonstrating a good understanding of potential consequences.",
      "Student skillfully applies strategies to complex real-life scenarios, anticipating potential challenges and demonstrating nuanced understanding of conflict dynamics and consequences."
    ],
    [
      "Demonstrates no understanding of nonviolent principles in conflict resolution.",
      "Shows minimal awareness of nonviolent principles; application is inconsistent.",
      "Demonstrates basic understanding of nonviolent principles but struggles to apply them consistently.",
      "Demonstrates good understanding of nonviolent principles; generally applies them effectively.",
      "Consistently demonstrates a strong understanding of nonviolent principles and their importance in conflict resolution.",
      "Exemplifies a deep understanding of nonviolent principles, integrating them seamlessly into conflict resolution strategies and advocating for their importance."
    ]
  ]
}