{
  "criteria": [
    "Understanding the Importance of Rest and Sleep",
    "Identification of Current Sleep Habits",
    "Goal Setting for Improved Rest and Sleep",
    "Strategies for Incorporating Rest and Sleep into Daily Routines",
    "Plan Feasibility and Adaptability"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the importance of rest and sleep for physical and mental health.",
      "Shows minimal understanding of the benefits of rest and sleep, with difficulty explaining its impact on daily life.",
      "Displays some understanding of the role of rest and sleep, but struggles to articulate specific benefits or consequences of sleep deprivation.",
      "Exhibits a clear understanding of the importance of rest and sleep, and can explain several ways adequate sleep benefits overall health and well-being.",
      "Demonstrates a strong understanding of the physiological and psychological benefits of rest and sleep, and can connect sleep habits to daily performance and health outcomes.",
      "Shows comprehensive understanding of the multifaceted impact of rest and sleep, including its effects on physical health, mental acuity, emotional stability, and long-term well-being. Can articulate the science behind sleep and its regulation."
    ],
    [
      "Unable to identify or describe current sleep habits.",
      "Identifies current sleep habits with significant inaccuracies or omissions.",
      "Describes current sleep habits with some accuracy, but misses key details such as bedtime, wake time, or sleep duration.",
      "Accurately identifies and describes current sleep habits, including typical bedtime, wake time, and estimated sleep duration.",
      "Provides a detailed and accurate description of current sleep habits, including variations on different days of the week and factors that influence sleep quality and duration.",
      "Conducts a thorough analysis of current sleep habits, identifying patterns, inconsistencies, and potential disruptors. Uses data (e.g., sleep diary) to support self-assessment."
    ],
    [
      "Unable to set any goals related to improving rest and sleep.",
      "Sets vague or unrealistic goals for improving rest and sleep, lacking specific actions or timelines.",
      "Sets basic goals for improving rest and sleep, but the goals lack detail or a clear plan of action.",
      "Establishes specific, measurable, achievable, relevant, and time-bound (SMART) goals for improving rest and sleep.",
      "Develops well-articulated SMART goals for improving rest and sleep, considering personal circumstances, challenges, and available resources.",
      "Creates comprehensive and ambitious yet realistic SMART goals for optimizing rest and sleep, incorporating strategies for overcoming potential obstacles and tracking progress."
    ],
    [
      "Unable to suggest any strategies for incorporating adequate rest and sleep into daily routines.",
      "Suggests minimal or ineffective strategies for improving rest and sleep habits.",
      "Suggests a few strategies for improving rest and sleep, but lacks a rationale or understanding of how the strategies promote better sleep.",
      "Identifies and describes a variety of effective strategies for incorporating adequate rest and sleep into daily routines, such as establishing a regular sleep schedule, creating a relaxing bedtime routine, and optimizing the sleep environment.",
      "Provides a detailed and personalized plan for incorporating rest and sleep into daily routines, considering individual needs, preferences, and challenges. Plan includes specific strategies for overcoming obstacles and maintaining consistency.",
      "Develops a comprehensive and evidence-based plan for optimizing rest and sleep, drawing on scientific research and best practices. Plan includes strategies for addressing underlying sleep disorders, managing stress, and promoting long-term sleep health."
    ],
    [
      "Plan is completely unrealistic and impossible to implement given the student's circumstances.",
      "Plan is largely impractical and lacks consideration for the student's daily life and commitments.",
      "Plan has some feasible elements, but lacks detail and may be difficult to implement consistently.",
      "Plan is generally feasible and adaptable to the student's daily life, with some consideration for potential challenges.",
      "Plan is highly feasible and adaptable, with clear strategies for addressing potential obstacles and maintaining consistency over time.",
      "Plan is exceptionally well-designed, highly adaptable, and incorporates strategies for long-term adherence, even in the face of changing circumstances or unexpected events."
    ]
  ]
}