{
  "criteria": [
    "Understanding the Importance of Personal Boundaries",
    "Application to Privacy",
    "Application to Safety",
    "Application to Expressions of Emotions and Opinions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of personal boundaries or their importance.",
      "Shows a limited understanding of personal boundaries, struggling to explain their importance.",
      "Identifies personal boundaries but provides a basic explanation of their importance for privacy, safety, and expression.",
      "Explains the importance of personal boundaries for privacy, safety, and expressing emotions\/opinions with some clarity.",
      "Clearly analyzes the importance of personal boundaries, providing examples related to privacy, safety, and emotional expression.",
      "Demonstrates a comprehensive analysis of personal boundaries, offering nuanced insights into their importance for privacy, safety, and healthy emotional\/opinion expression with relevant, detailed examples."
    ],
    [
      "Does not connect personal boundaries to privacy.",
      "Struggles to connect personal boundaries to privacy with unclear or irrelevant examples.",
      "Identifies a basic connection between personal boundaries and privacy, providing simple examples.",
      "Explains how personal boundaries relate to privacy, giving understandable examples.",
      "Analyzes how personal boundaries protect privacy, offering specific and relevant examples.",
      "Provides a sophisticated analysis of the relationship between personal boundaries and privacy, including digital contexts and potential consequences of boundary violations, with detailed examples."
    ],
    [
      "Does not connect personal boundaries to safety.",
      "Struggles to connect personal boundaries to safety; examples are unclear or missing.",
      "Identifies a basic connection between personal boundaries and safety, providing simple examples.",
      "Explains how personal boundaries relate to physical and emotional safety, with understandable examples.",
      "Analyzes how personal boundaries ensure safety, offering specific and relevant examples.",
      "Offers a comprehensive analysis of the role of personal boundaries in ensuring physical and emotional safety, including scenarios involving peer pressure or uncomfortable situations, with detailed examples."
    ],
    [
      "Does not connect personal boundaries to the expression of emotions and opinions.",
      "Struggles to connect personal boundaries to the healthy expression of emotions and opinions; examples are unclear or missing.",
      "Identifies a basic connection between personal boundaries and expressing emotions\/opinions, with simple examples.",
      "Explains how personal boundaries enable respectful and healthy expression of emotions and opinions, providing understandable examples.",
      "Analyzes how personal boundaries facilitate healthy emotional and opinion expression while respecting others, offering specific and relevant examples.",
      "Demonstrates a sophisticated understanding of how personal boundaries contribute to both the expression and reception of emotions and opinions, promoting mutual respect and understanding in diverse social contexts, with detailed examples."
    ]
  ]
}