{
  "criteria": [
    "Demonstrates the ability to compare and select diverse stimuli for movement vocabulary and artistic expression.",
    "Explores various movement vocabularies to express an artistic intent in choreography; explains and discusses choices using genre-specific dance terminology."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify or compare any stimuli; no connection made to movement vocabulary or artistic expression.",
      "Identifies at least one stimuli, but struggles to compare it or connect it to movement vocabulary or artistic expression.",
      "Compares a limited variety of stimuli and makes a basic selection, showing a rudimentary connection to movement vocabulary or artistic expression.",
      "Compares a variety of stimuli and makes thoughtful selections to expand movement vocabulary, demonstrating an adequate connection to artistic expression.",
      "Compares a wide range of stimuli and makes insightful selections that significantly expand movement vocabulary, clearly enhancing artistic expression.",
      "Exemplary comparison and selection of diverse stimuli, resulting in highly innovative movement vocabulary and profound artistic expression."
    ],
    [
      "Does not explore movement vocabularies or express any artistic intent; unable to use or understand dance terminology.",
      "Attempts to explore movement vocabularies with limited success; struggles to express artistic intent or use dance terminology correctly.",
      "Explores basic movement vocabularies and expresses a simple artistic intent; uses some dance terminology, but with limited accuracy.",
      "Explores various movement vocabularies effectively to express a clear artistic intent; uses dance terminology appropriately in explanations and discussions.",
      "Explores a broad range of movement vocabularies to express a sophisticated artistic intent; articulately explains and discusses choices using precise dance terminology.",
      "Masterfully explores and synthesizes movement vocabularies to express a profound artistic intent; demonstrates expert command of dance terminology in explanations and discussions."
    ]
  ]
}