{
  "criteria": [
    "Demonstrates the ability to translate diverse stimuli into movement.",
    "Exhibits personal preference and articulates choices using genre-specific dance terminology.",
    "Develops original dance content that communicates intent effectively."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No attempt to translate stimuli into movement is evident.",
      "Struggles to translate stimuli; movement is disjointed and lacks connection to the stimuli.",
      "Basic translation of stimuli into movement; connection is superficial and lacks depth.",
      "Adequately translates stimuli into movement, showing a reasonable connection and understanding.",
      "Effectively translates stimuli into movement, demonstrating a clear and creative connection.",
      "Masterfully translates stimuli into movement, showcasing a profound and innovative understanding that significantly enhances the dance."
    ],
    [
      "No personal preference is evident; terminology is absent.",
      "Limited personal preference is shown; struggles with appropriate terminology.",
      "Some personal preference is evident; terminology is basic and sometimes inaccurate.",
      "Clearly demonstrates personal preference and uses appropriate terminology to justify choices.",
      "Strong personal preference is evident; terminology is precise and enhances articulation.",
      "Exceptional personal preference is demonstrated, with masterful use of terminology that enriches the dance's meaning and impact."
    ],
    [
      "No original content developed; intent is unclear.",
      "Struggles to develop original content; intent is vague and poorly communicated.",
      "Basic original content developed; intent is somewhat communicated but lacks clarity.",
      "Adequately develops original content; intent is reasonably clear and communicated.",
      "Effectively develops original content; intent is clear, concise, and well-communicated.",
      "Masterfully develops original content; intent is powerfully communicated, leaving a lasting impact."
    ]
  ]
}