{
  "criteria": [
    "Accuracy in Performing Operations with Scientific Notation",
    "Appropriate Use of Units in Scientific Notation",
    "Interpretation of Scientific Notation Generated by Technology"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No attempt or demonstrates no understanding of scientific notation operations.",
      "Performs operations with scientific notation with frequent errors, showing limited understanding.",
      "Performs operations with scientific notation with some errors, but shows a basic understanding.",
      "Performs operations with scientific notation with minor errors, demonstrating a general understanding.",
      "Performs operations with scientific notation accurately in most cases, showing a strong understanding.",
      "Performs operations with scientific notation accurately and efficiently, demonstrating a comprehensive understanding."
    ],
    [
      "Does not use or incorrectly uses units with scientific notation.",
      "Attempts to use units with scientific notation, but with significant errors in application or conversion.",
      "Uses units with scientific notation, but with some inconsistencies or errors in scale.",
      "Generally uses appropriate units with scientific notation, with only minor inconsistencies.",
      "Consistently uses appropriate units with scientific notation, demonstrating a strong understanding of scale.",
      "Uses appropriate units effectively and insightfully with scientific notation, demonstrating a deep understanding of scale and context."
    ],
    [
      "Unable to interpret scientific notation from technology or provides irrelevant interpretations.",
      "Struggles to interpret scientific notation from technology, showing significant misunderstanding.",
      "Interprets scientific notation from technology with difficulty, requiring assistance.",
      "Interprets scientific notation from technology with some accuracy, but lacks detail in explanation.",
      "Interprets scientific notation from technology accurately and provides clear explanations.",
      "Interprets scientific notation from technology proficiently, providing insightful and comprehensive explanations."
    ]
  ]
}