{
  "criteria": [
    "Understanding the Impact of Drug Use on Goal Achievement",
    "Articulation of Benefits of a Drug-Free Lifestyle for Goal Attainment",
    "Predicting Long-Term Outcomes"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of how drug use can affect the achievement of goals.",
      "The student shows a minimal understanding of how drug use might affect goal achievement, with vague or inaccurate statements.",
      "The student identifies some ways drug use can hinder goal achievement, but lacks depth and specific examples.",
      "The student explains how drug use can negatively affect the achievement of short-term and long-term goals with some specific examples.",
      "The student clearly explains and provides specific examples of how drug use can negatively impact both short-term and long-term goal achievement.",
      "The student comprehensively explains, with detailed and insightful examples, how drug use can severely hinder the achievement of short-term and long-term goals, demonstrating a deep understanding of the consequences."
    ],
    [
      "The student is unable to articulate any benefits of a drug-free lifestyle in relation to achieving goals.",
      "The student mentions one or two vague benefits of a drug-free lifestyle but does not connect them to goal achievement.",
      "The student identifies a few basic benefits of a drug-free lifestyle in relation to goal achievement but lacks detail.",
      "The student describes several benefits of a drug-free lifestyle and connects them to the achievement of both short-term and long-term goals.",
      "The student clearly articulates multiple significant benefits of a drug-free lifestyle and provides specific examples of how these benefits support the achievement of short-term and long-term goals.",
      "The student expertly articulates a wide range of significant benefits of a drug-free lifestyle, providing compelling and insightful examples of how these benefits directly and substantially support the achievement of short-term and long-term goals, demonstrating a profound understanding."
    ],
    [
      "The student does not attempt to predict any long-term outcomes related to drug use or a drug-free lifestyle.",
      "The student's predictions about long-term outcomes are unrealistic or illogical.",
      "The student identifies a few possible long-term outcomes, but they are not well-supported or thoroughly explained.",
      "The student provides somewhat accurate predictions of long-term outcomes of both drug use and a drug-free lifestyle, with limited explanation.",
      "The student provides reasonable and well-supported predictions about the long-term outcomes of both drug use and a drug-free lifestyle.",
      "The student offers insightful, logical, and well-supported predictions about the long-term outcomes of both drug use and a drug-free lifestyle, demonstrating critical thinking."
    ]
  ]
}