{
  "criteria": [
    "Identification of Consequences",
    "Depth of Analysis",
    "Clarity and Organization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any consequences of violence.",
      "The student identifies one consequence of violence, but it is vague or unclear.",
      "The student identifies at least two consequences of violence, but the explanations are superficial.",
      "The student identifies multiple consequences of violence for self, family, and\/or the community with some explanation.",
      "The student clearly and accurately identifies consequences of violence for self, family, and the community.",
      "The student comprehensively analyzes multiple consequences of violence, demonstrating a deep understanding of the impact on self, family, and the community, while providing examples of the interrelation between all of them."
    ],
    [
      "No analysis of the consequences of violence is provided.",
      "The analysis is very limited, with minimal explanation or reasoning.",
      "The analysis is basic and lacks depth. Connections between violence and consequences are not clearly made.",
      "The analysis provides some depth and demonstrates an understanding of the connections between violence and its consequences.",
      "The analysis is thorough and insightful, providing a clear understanding of the connections between violence and its consequences.",
      "The analysis is exceptionally detailed, insightful, and demonstrates a sophisticated understanding of the complex connections between violence and its multifaceted consequences, showing a clear comprehension of both short-term and long-term effects."
    ],
    [
      "The response is unclear, disorganized, and difficult to understand.",
      "The response lacks clarity and organization, making it somewhat difficult to follow.",
      "The response is somewhat clear and organized, but there are areas that could be improved.",
      "The response is generally clear and organized, with a logical flow of ideas.",
      "The response is clear, well-organized, and easy to follow.",
      "The response is exceptionally clear, coherently organized, and presents information in a logical and compelling manner, making it exceptionally easy to understand and highly impactful."
    ]
  ]
}