{
  "criteria": [
    "Identification of Benefits",
    "Explanation of Impact",
    "Real-World Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any benefits of positive relationships with trusted adults.",
      "The student identifies one basic benefit of positive relationships with trusted adults, but the explanation is unclear or incomplete.",
      "The student identifies two basic benefits of positive relationships with trusted adults with limited explanation.",
      "The student identifies three benefits of positive relationships with trusted adults, providing a general explanation for each.",
      "The student identifies at least four benefits of positive relationships with trusted adults, providing a clear and relevant explanation for each.",
      "The student comprehensively identifies multiple benefits of positive relationships with trusted adults, thoroughly explaining each with insightful details and examples."
    ],
    [
      "The student fails to explain the impact of these relationships on personal well-being.",
      "The student attempts to explain the impact, but the explanation is vague and lacks specific details.",
      "The student provides a limited explanation of how these relationships can impact well-being, with some connection to personal health.",
      "The student adequately explains how positive relationships with trusted adults can positively impact well-being and health.",
      "The student clearly explains how positive relationships with trusted adults significantly impact various aspects of well-being, providing specific examples.",
      "The student provides a comprehensive and insightful explanation of how these relationships foster resilience, emotional support, and overall positive development, demonstrating a deep understanding of the topic."
    ],
    [
      "The student does not provide any real-world examples or scenarios.",
      "The student provides a vague or unrealistic example, lacking clear connection to the benefits described.",
      "The student provides a basic real-world example but does not fully explain how it relates to the benefits.",
      "The student provides a relevant real-world example that illustrates the benefits of positive relationships with trusted adults.",
      "The student provides multiple clear and relevant real-world examples, demonstrating a strong understanding of the practical application of these benefits.",
      "The student presents compelling and insightful real-world examples, thoroughly analyzing the positive outcomes and implications of nurturing such relationships."
    ]
  ]
}