{
  "criteria": [
    "Understanding of Loss and Grief Concepts",
    "Identification of Different Types of Loss",
    "Recognition of Emotional Responses to Loss and Grief",
    "Application of Knowledge to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of loss and grief concepts.",
      "Shows a minimal understanding of loss and grief, with significant misconceptions.",
      "Displays a basic understanding of loss and grief but struggles to define or explain the concepts accurately.",
      "Demonstrates a satisfactory understanding of loss and grief, defining the terms with reasonable accuracy and detail.",
      "Exhibits a strong understanding of loss and grief, providing clear definitions and explanations.",
      "Shows a comprehensive and nuanced understanding of loss and grief, explaining complex aspects with clarity and precision."
    ],
    [
      "Unable to identify any types of loss or grief.",
      "Identifies only one type of loss or grief with inaccuracies.",
      "Identifies a few types of loss or grief but struggles to differentiate between them.",
      "Identifies several common types of loss or grief with reasonable accuracy.",
      "Identifies a wide range of types of loss and grief, explaining the differences between them.",
      "Identifies a comprehensive range of types of loss and grief, providing detailed explanations and examples of each."
    ],
    [
      "Does not recognize any emotional responses associated with loss and grief.",
      "Identifies only one or two emotional responses with inaccuracies.",
      "Identifies some common emotional responses but struggles to connect them to loss and grief.",
      "Recognizes several emotional responses to loss and grief, providing basic explanations.",
      "Recognizes a wide range of emotional responses to loss and grief, explaining how they manifest.",
      "Demonstrates a deep understanding of the emotional impact of loss and grief, explaining complex emotions with empathy and insight."
    ],
    [
      "Unable to apply knowledge of loss and grief to any real-life scenarios.",
      "Attempts to apply knowledge but demonstrates significant misunderstandings.",
      "Applies knowledge to simple scenarios but struggles with more complex situations.",
      "Applies knowledge to a variety of scenarios, providing reasonable explanations.",
      "Applies knowledge effectively to a wide range of scenarios, demonstrating a strong understanding of the concepts.",
      "Applies knowledge with exceptional insight and nuance, offering thoughtful and well-reasoned analysis of complex real-life scenarios."
    ]
  ]
}