{
  "criteria": [
    "Understanding the Correlation Between Substance Use and Vehicle Accidents",
    "Explaining the Connection Between Substance Use and Injuries\/Violence",
    "Understanding the Role of Substance Use in Risky Sexual Behavior"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the link between alcohol\/drug use and vehicle crashes.",
      "The student shows a minimal understanding, vaguely mentioning that substance use can lead to vehicle accidents without providing specifics.",
      "The student identifies a basic relationship between alcohol\/drug use and vehicle crashes, such as impaired reaction time, but lacks depth.",
      "The student explains how alcohol\/drug use can contribute to vehicle crashes, citing impaired judgment and slower reflexes as contributing factors.",
      "The student comprehensively explains multiple ways alcohol\/drug use can lead to vehicle crashes, including specific examples (e.g., drunk driving, drugged driving) and their consequences.",
      "The student thoroughly analyzes the correlation between substance use and vehicle crashes, providing statistical data, real-world examples, and potential prevention strategies."
    ],
    [
      "The student fails to recognize any relationship between alcohol\/drug use and injuries\/violence.",
      "The student acknowledges a vague connection between substance use and injuries\/violence but offers no explanation.",
      "The student provides a simplistic explanation, such as stating that substance use can lead to fights.",
      "The student describes how alcohol\/drug use can increase the risk of injuries and violence, citing impaired judgment and aggression as potential factors.",
      "The student provides detailed examples of how alcohol\/drug use contributes to injuries and violence, including domestic violence, assaults, and accidental injuries.",
      "The student analyzes the complex relationship between substance use and injuries\/violence, considering societal factors, psychological effects, and potential interventions."
    ],
    [
      "The student shows no understanding of the association between alcohol\/drug use and risky sexual behavior.",
      "The student vaguely mentions that substance use can influence sexual behavior without providing details.",
      "The student identifies a basic relationship, such as stating that substance use can lead to unprotected sex.",
      "The student explains how alcohol\/drug use can increase the likelihood of risky sexual behavior, citing impaired decision-making and reduced inhibitions.",
      "The student provides specific examples of risky sexual behaviors associated with substance use, including unprotected sex, multiple partners, and STIs.",
      "The student comprehensively analyzes the role of substance use in risky sexual behavior, considering factors like peer pressure, social norms, and the potential for long-term consequences."
    ]
  ]
}