{
  "criteria": [
    "Understanding the Complexity of Eating Disorders",
    "Explanation of Potential Dangers Without Professional Help",
    "Identification of Professional Roles and Expertise"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of why professional help is needed for eating disorders.",
      "Shows a minimal understanding, perhaps mentioning only one basic reason for seeking professional help.",
      "Identifies a few reasons for seeking professional help, but lacks depth in explaining the complexities.",
      "Explains several reasons why professional help is essential, touching on physical and psychological aspects.",
      "Provides a comprehensive explanation, detailing the multi-faceted nature of eating disorders and the necessity of a professional approach.",
      "Offers an insightful and detailed explanation, including specific examples of how professionals can address the various needs of individuals with eating disorders, showing exceptional understanding."
    ],
    [
      "Does not mention any potential dangers of not seeking professional help for eating disorders.",
      "Briefly mentions one or two potential dangers, without elaboration.",
      "Lists a few dangers but does not fully explain the potential impact on health and well-being.",
      "Explains several dangers of not seeking professional help, including both short-term and long-term consequences.",
      "Provides a thorough explanation of the dangers, including detailed information on the physical, psychological, and social impacts.",
      "Offers a comprehensive and nuanced explanation of the dangers, including potential co-morbidities and the increased risk of mortality, demonstrating a deep understanding."
    ],
    [
      "Unable to identify any specific professional roles that are beneficial in treating eating disorders.",
      "Identifies one or two professional roles but does not explain their specific expertise.",
      "Lists a few professional roles, such as doctors or therapists, but lacks detail on how they contribute to treatment.",
      "Describes several professional roles (e.g., therapists, dietitians, doctors) and their general contributions to treating eating disorders.",
      "Explains the roles of various professionals in detail, including their expertise and how they work together in a treatment team.",
      "Provides an in-depth analysis of the multidisciplinary team approach, detailing how each professional role contributes uniquely to the comprehensive care of individuals with eating disorders."
    ]
  ]
}