{
  "criteria": [
    "Effectiveness of verbal communication in refusal skills.",
    "Use of nonverbal communication to reinforce verbal messages.",
    "Understanding and articulation of consequences.",
    "Strategies for avoiding high-risk situations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of verbal refusal skills or provides responses that would encourage sexual involvement, HIV\/STD transmission, or pregnancy.",
      "Shows limited understanding of verbal refusal skills; responses are unclear or hesitant and may not effectively discourage unwanted advances.",
      "Demonstrates basic verbal refusal skills but may lack confidence or consistency in delivery.  Responses could be more assertive or clear.",
      "Effectively uses verbal communication to refuse unwanted advances and clearly communicates boundaries. Demonstrates confidence and assertiveness.",
      "Exhibits strong and effective verbal refusal skills, adapting communication style to different situations. Provides clear and assertive responses while maintaining respect.",
      "Masterfully uses verbal communication with nuanced understanding of social dynamics, demonstrating exceptional assertiveness, clarity, and respect to effectively prevent unwanted advances."
    ],
    [
      "Displays nonverbal cues that contradict verbal messages or signal openness to sexual involvement, HIV\/STD transmission, or pregnancy.",
      "Shows limited awareness of nonverbal communication or uses nonverbal cues that are inconsistent with verbal messages.",
      "Demonstrates some understanding of nonverbal communication, but cues may not always reinforce verbal messages effectively.",
      "Uses nonverbal cues (e.g., eye contact, body language) that generally align with verbal messages to communicate clear boundaries.",
      "Consistently uses congruent and assertive nonverbal communication to reinforce verbal messages, enhancing the effectiveness of refusal skills.",
      "Expertly integrates nonverbal communication into refusal strategies, demonstrating a comprehensive understanding of how nonverbal cues amplify and reinforce verbal messages in diverse social scenarios."
    ],
    [
      "Fails to articulate any consequences related to sexual involvement, HIV\/STD transmission, or pregnancy.",
      "Identifies few and\/or inaccurate consequences related to sexual involvement, HIV\/STD transmission, or pregnancy.",
      "Lists some accurate consequences but lacks depth or personal connection to the implications.",
      "Clearly articulates the potential consequences of sexual involvement, HIV\/STD transmission, and pregnancy, demonstrating a good understanding of the risks involved.",
      "Demonstrates a comprehensive understanding of consequences, including physical, emotional, social, and financial implications; communicates these effectively.",
      "Exhibits profound understanding of both immediate and long-term consequences, articulating them persuasively and connecting them to personal values and broader societal impacts."
    ],
    [
      "Unable to identify any strategies for avoiding situations that might lead to sexual involvement, HIV\/STD transmission, or pregnancy.",
      "Suggests ineffective or unrealistic strategies for avoiding high-risk situations.",
      "Offers some basic strategies but lacks detail or practical application.",
      "Describes realistic and appropriate strategies for avoiding high-risk situations, demonstrating awareness and planning.",
      "Develops detailed and proactive strategies for avoiding high-risk situations, showing foresight and problem-solving skills.",
      "Critically evaluates various strategies, adapting and innovating techniques based on individual circumstances and broader social contexts, demonstrating leadership in promoting safe behaviors."
    ]
  ]
}