{
  "criteria": [
    "Understanding of Healthy Eating:",
    "Application of Strategies:",
    "Long-Term Planning:"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of what constitutes healthy eating or personal responsibility.",
      "Shows a minimal understanding of healthy eating with no clear connection to personal actions.",
      "Identifies some components of healthy eating but struggles to explain how personal choices impact health.",
      "Describes basic elements of a healthy diet and acknowledges the importance of personal responsibility, but lacks specifics.",
      "Explains key aspects of healthy eating and provides some examples of how to take personal responsibility.",
      "Clearly articulates the components of a healthy diet and provides detailed strategies for personal responsibility in making healthy food choices."
    ],
    [
      "Unable to identify any strategies for taking personal responsibility for healthy eating.",
      "Suggests one or two vague strategies with no elaboration.",
      "Lists a few basic strategies but does not explain how to implement them effectively.",
      "Describes several strategies for healthy eating but struggles to connect them to real-life scenarios.",
      "Provides a range of strategies for making healthy food choices and offers examples of how they can be applied in different situations.",
      "Demonstrates a comprehensive understanding of various strategies for healthy eating and illustrates how to apply them effectively in diverse, real-life scenarios."
    ],
    [
      "Shows no ability to plan for long-term healthy eating habits.",
      "Mentions the need for long-term planning but provides no specific ideas.",
      "Offers a rudimentary plan for healthy eating but lacks details and feasibility.",
      "Describes a basic plan for long-term healthy eating, including some considerations for sustainability.",
      "Develops a well-thought-out plan for long-term healthy eating, addressing potential challenges and solutions.",
      "Creates a comprehensive and sustainable plan for long-term healthy eating, incorporating personalized strategies and a thorough understanding of potential obstacles."
    ]
  ]
}