{
  "criteria": [
    "Demonstrates understanding and respect for individual differences in communication and interactions.",
    "Acknowledges and appreciates diverse backgrounds and perspectives.",
    "Adapts behavior and communication style to effectively interact with individuals from diverse backgrounds."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no awareness or understanding of individual differences; communication is disrespectful or dismissive.",
      "Shows limited awareness of individual differences; communication may occasionally be insensitive or inappropriate.",
      "Acknowledges individual differences in a superficial manner; communication is generally respectful but lacks depth of understanding.",
      "Demonstrates understanding of individual differences in most situations; communication is respectful and considerate.",
      "Consistently demonstrates a strong understanding of individual differences; communication is highly respectful, empathetic, and inclusive.",
      "Actively promotes respect and understanding of individual differences; communication is exemplary and fosters a positive, inclusive environment for all."
    ],
    [
      "Shows no recognition or appreciation of diverse backgrounds; may express biased or discriminatory views.",
      "Shows minimal awareness of diverse backgrounds; may make generalizations or stereotypes.",
      "Acknowledges diverse backgrounds but lacks deeper understanding or appreciation; may struggle to relate to different perspectives.",
      "Demonstrates understanding and appreciation of diverse backgrounds in most situations; seeks to understand different perspectives.",
      "Consistently demonstrates a strong understanding and appreciation of diverse backgrounds; actively seeks to learn from others' perspectives.",
      "Actively promotes inclusivity and appreciation of diverse backgrounds; demonstrates a deep understanding of cultural nuances and complexities."
    ],
    [
      "Makes no effort to adapt behavior or communication style; interactions are often ineffective or inappropriate.",
      "Makes limited attempts to adapt behavior or communication style; interactions may still be strained or ineffective.",
      "Adapts behavior and communication style in some situations but struggles in others; interactions are sometimes awkward or uncomfortable.",
      "Generally adapts behavior and communication style to effectively interact with individuals from diverse backgrounds; interactions are usually positive and productive.",
      "Consistently adapts behavior and communication style to effectively interact with individuals from diverse backgrounds; interactions are highly effective and promote understanding.",
      "Serves as a role model for adapting behavior and communication style to effectively interact with individuals from diverse backgrounds; fosters positive relationships and bridges cultural gaps."
    ]
  ]
}