{
  "criteria": [
    "Identification of Healthy Coping Mechanisms",
    "Understanding of the Grieving Process",
    "Application to Personal or Peer Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any healthy coping mechanisms for grief.",
      "The student identifies one or two coping mechanisms, but they are not clearly linked to healthy grief responses or are vaguely described.",
      "The student identifies some healthy coping mechanisms, but the explanation lacks depth or relevance to the grieving process. There are misunderstandings present.",
      "The student accurately identifies and explains several healthy coping mechanisms suitable for someone grieving, but the connection to specific emotions or situations could be stronger. Some details are missing.",
      "The student comprehensively identifies and explains multiple healthy ways to respond to grief, providing clear examples relevant to different emotional states or scenarios.",
      "The student demonstrates an exceptional understanding of healthy coping mechanisms for grief, offering nuanced insights and practical applications tailored to various individual needs and circumstances. Shows an ability to evaluate the appropriateness of different strategies."
    ],
    [
      "The student demonstrates no understanding of the grieving process.",
      "The student shows a minimal understanding of grief, primarily focusing on surface-level reactions without acknowledging the emotional depth or stages involved.",
      "The student identifies some elements of the grieving process, but the explanation is superficial or includes inaccuracies. Basic understanding is there.",
      "The student demonstrates a solid understanding of the grieving process, including common stages and emotional responses, but may not fully explore the variability or individual differences in experiencing grief.",
      "The student provides a detailed and accurate explanation of the grieving process, addressing its multifaceted nature, common emotional stages, and potential challenges or complications.",
      "The student exhibits an in-depth and nuanced understanding of the grieving process, demonstrating awareness of diverse cultural perspectives, individual coping styles, and the potential for growth and healing following loss."
    ],
    [
      "The student cannot apply their knowledge to any practical scenario.",
      "The student struggles to apply the concepts to real-life situations, offering only tangential or unrelated responses.",
      "The student attempts to apply the concepts but provides superficial or generic advice lacking specific details or emotional intelligence.",
      "The student offers generally sound advice or strategies applicable to personal or peer situations involving grief, but the response lacks depth or personalization to individual needs.",
      "The student provides thoughtful and tailored advice for responding to grief in specific situations, demonstrating empathy and consideration for individual circumstances or emotional states.",
      "The student exhibits exceptional insight and empathy, offering nuanced guidance and support strategies that are highly sensitive to the unique needs and challenges of individuals navigating the grieving process. Demonstrates leadership."
    ]
  ]
}