{
  "criteria": [
    "Identification of Qualities in Healthy Relationships",
    "Analysis of the Impact of Healthy Relationships",
    "Application of Knowledge to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any qualities of healthy peer and family relationships.",
      "The student identifies one quality of healthy peer and family relationships, but the explanation is unclear or inaccurate.",
      "The student identifies two qualities of healthy peer and family relationships with limited explanation or accuracy.",
      "The student identifies three qualities of healthy peer and family relationships with a basic explanation.",
      "The student identifies four qualities of healthy peer and family relationships with a clear and accurate explanation.",
      "The student identifies five or more qualities of healthy peer and family relationships with a comprehensive and insightful explanation."
    ],
    [
      "The student does not analyze the impact of healthy peer and family relationships.",
      "The student attempts to analyze the impact but demonstrates a lack of understanding or provides inaccurate information.",
      "The student provides a limited analysis of the impact of healthy relationships, with some inaccuracies.",
      "The student provides a general analysis of the impact of healthy relationships on individuals and the community.",
      "The student provides a detailed analysis of the impact of healthy relationships, including specific examples and supporting evidence.",
      "The student provides a comprehensive and insightful analysis of the impact of healthy relationships, including potential challenges and strategies for maintaining healthy connections."
    ],
    [
      "The student does not apply knowledge of healthy relationship qualities to real-life scenarios.",
      "The student attempts to apply knowledge but struggles to connect it to real-life scenarios or provides unrealistic solutions.",
      "The student applies knowledge of healthy relationship qualities to a simple real-life scenario with limited depth.",
      "The student applies knowledge of healthy relationship qualities to a variety of real-life scenarios with reasonable solutions.",
      "The student applies knowledge of healthy relationship qualities to complex real-life scenarios, demonstrating empathy and problem-solving skills.",
      "The student applies knowledge of healthy relationship qualities to complex real-life scenarios, demonstrating empathy, problem-solving skills, and offering innovative solutions."
    ]
  ]
}