{
  "criteria": [
    "Identifying potential triggers for conflict",
    "Demonstrates effective communication skills (active listening, clear expression)",
    "Applying de-escalation techniques (e.g., calming tone, finding common ground).",
    "Seeking assistance when necessary (knowing when to involve an adult or authority figure)."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Fails to identify any potential triggers for conflict.",
      "Identifies one or two potential triggers for conflict with limited accuracy.",
      "Identifies some potential triggers for conflict with moderate accuracy.",
      "Identifies several potential triggers for conflict with good accuracy.",
      "Identifies most potential triggers for conflict with high accuracy.",
      "Accurately identifies a wide range of potential triggers for conflict, demonstrating comprehensive understanding."
    ],
    [
      "Communication is unclear, ineffective, or absent; little to no active listening demonstrated.",
      "Communication is somewhat unclear; struggles with active listening and clear expression.",
      "Communication is moderately clear; demonstrates some active listening and attempts clear expression.",
      "Communication is generally clear and effective; good active listening and clear expression are demonstrated.",
      "Communication is very clear and effective; strong active listening and articulate expression are evident.",
      "Communication is exceptionally clear, persuasive, and empathetic; demonstrates mastery of active listening and expression."
    ],
    [
      "Does not attempt to apply any de-escalation techniques; may escalate the situation.",
      "Attempts one or two de-escalation techniques, but with limited effectiveness.",
      "Applies some de-escalation techniques with moderate success in calming the situation.",
      "Applies de-escalation techniques effectively, showing a good understanding of conflict resolution.",
      "Skillfully applies a variety of de-escalation techniques, significantly improving the situation.",
      "Masterfully applies and adapts de-escalation techniques to achieve peaceful resolution, demonstrating exceptional skill."
    ],
    [
      "Does not recognize the need for assistance, even when the situation is clearly beyond their ability to handle.",
      "Hesitantly recognizes the need for assistance but delays seeking help, potentially worsening the situation.",
      "Recognizes the need for assistance and seeks help, but may not do so in a timely or appropriate manner.",
      "Appropriately recognizes the need for assistance and seeks help from an adult or authority figure in a timely manner.",
      "Proactively seeks assistance when necessary, demonstrating good judgment and responsibility.",
      "Consistently demonstrates excellent judgment in recognizing the need for assistance and effectively seeks help, ensuring the safety and well-being of all involved."
    ]
  ]
}