{
  "criteria": [
    "Demonstrates respectful communication and interaction with peers and adults.",
    "Actively participates in creating a positive and inclusive environment.",
    "Demonstrates responsibility and accountability for their actions."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Consistently uses disrespectful or offensive language; engages in bullying or harassment.",
      "Often uses disrespectful language or tone; occasionally participates in negative interactions.",
      "Sometimes uses respectful language; occasionally demonstrates positive interactions, but inconsistencies are present.",
      "Generally uses respectful language and tone; usually interacts positively with others; minor inconsistencies may be present.",
      "Consistently uses respectful language and tone; actively listens and responds thoughtfully to others; promotes positive interactions.",
      "Serves as a role model for respectful communication and interaction; consistently demonstrates empathy, kindness, and inclusivity; proactively addresses disrespectful behavior."
    ],
    [
      "Actively contributes to a negative or exclusive environment; shows no effort to promote positivity.",
      "Rarely participates in activities that promote a positive environment; shows little interest in inclusivity.",
      "Sometimes participates in activities that promote a positive environment; demonstrates some awareness of inclusivity.",
      "Regularly participates in activities that promote a positive environment; actively supports inclusivity and diversity.",
      "Takes initiative in creating a positive and inclusive environment; actively promotes respect and understanding among peers.",
      "Leads initiatives to promote a positive and inclusive environment; advocates for the needs of diverse groups; empowers others to create positive change."
    ],
    [
      "Consistently avoids taking responsibility for their actions; blames others for their mistakes.",
      "Rarely takes responsibility for their actions; makes excuses or minimizes their impact.",
      "Sometimes takes responsibility for their actions; may need prompting or reminders.",
      "Usually takes responsibility for their actions; acknowledges mistakes and attempts to make amends.",
      "Consistently takes responsibility for their actions; reflects on their behavior and learns from their mistakes.",
      "Serves as a role model for responsibility and accountability; proactively addresses their mistakes and takes steps to prevent future errors; supports others in taking responsibility for their actions."
    ]
  ]
}