{
  "criteria": [
    "Understanding of Protective Actions: Demonstrates comprehension of various actions to protect sexual and reproductive health.",
    "Knowledge of Reproductive Health: Demonstrates understanding of factors influencing the ability to deliver a healthy baby in adulthood.",
    "Application to Personal Behavior: Relates protective actions and reproductive health knowledge to personal choices and behaviors."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding of protective actions is demonstrated.",
      "Identifies only one or two protective actions with limited understanding.",
      "Identifies some protective actions, but explanations lack depth and clarity.",
      "Describes several protective actions with reasonable understanding, including abstinence, safe sex practices, and regular check-ups.",
      "Explains multiple protective actions with clear understanding, providing specific examples and justifications.",
      "Provides a comprehensive overview of protective actions, demonstrating in-depth understanding and the ability to apply them to various situations."
    ],
    [
      "Shows no understanding of reproductive health or factors influencing pregnancy outcomes.",
      "Demonstrates minimal awareness of reproductive health, mentioning only one or two factors.",
      "Identifies some factors influencing reproductive health, but explanations are superficial.",
      "Describes several factors influencing the ability to deliver a healthy baby, such as nutrition, prenatal care, and avoidance of harmful substances.",
      "Explains multiple factors influencing reproductive health with clear understanding, providing specific examples and elaborating on their impact.",
      "Provides a comprehensive overview of reproductive health, demonstrating in-depth understanding of the factors influencing pregnancy outcomes and their interrelationships."
    ],
    [
      "Unable to connect protective actions or reproductive health knowledge to personal choices.",
      "Makes limited connections between protective actions\/knowledge and personal behavior.",
      "Relates some protective actions and knowledge to personal choices, but lacks specific examples.",
      "Describes how protective actions and reproductive health knowledge can inform personal choices and behaviors.",
      "Explains how protective actions and reproductive health knowledge can guide personal choices, providing specific examples and justifications.",
      "Demonstrates a sophisticated understanding of how protective actions and reproductive health knowledge can shape personal behavior, with a focus on responsible decision-making and long-term health."
    ]
  ]
}