{
  "criteria": [
    "Understanding of FDA-approved condoms and other contraceptives",
    "Application of a decision-making process",
    "Evaluation of contraceptives for pregnancy prevention",
    "Evaluation of contraceptives for STD prevention"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of FDA-approved condoms and other contraceptives.",
      "Student demonstrates a minimal understanding of FDA-approved condoms and other contraceptives, with significant misconceptions.",
      "Student demonstrates a basic understanding of FDA-approved condoms and other contraceptives, but lacks depth and detail.",
      "Student demonstrates a satisfactory understanding of FDA-approved condoms and other contraceptives, with some minor inaccuracies.",
      "Student demonstrates a strong understanding of FDA-approved condoms and other contraceptives, with only minor areas for improvement.",
      "Student demonstrates a comprehensive and accurate understanding of FDA-approved condoms and other contraceptives."
    ],
    [
      "Student does not apply a decision-making process to evaluate the use of contraceptives.",
      "Student attempts to apply a decision-making process, but it is incomplete and poorly executed.",
      "Student applies a basic decision-making process with limited effectiveness.",
      "Student applies a decision-making process with reasonable effectiveness, considering some relevant factors.",
      "Student applies a thorough and effective decision-making process, considering most relevant factors.",
      "Student applies a comprehensive, well-reasoned, and effective decision-making process, demonstrating critical thinking and a nuanced understanding."
    ],
    [
      "Student does not evaluate contraceptives for pregnancy prevention.",
      "Student provides a minimal and inaccurate evaluation of contraceptives for pregnancy prevention.",
      "Student provides a basic evaluation of contraceptives for pregnancy prevention, but lacks detail and accuracy.",
      "Student provides a satisfactory evaluation of contraceptives for pregnancy prevention, with some minor inaccuracies.",
      "Student provides a strong and accurate evaluation of contraceptives for pregnancy prevention.",
      "Student provides a comprehensive and insightful evaluation of contraceptives for pregnancy prevention, demonstrating a thorough understanding of their effectiveness and limitations."
    ],
    [
      "Student does not evaluate contraceptives for STD prevention.",
      "Student provides a minimal and inaccurate evaluation of contraceptives for STD prevention.",
      "Student provides a basic evaluation of contraceptives for STD prevention, but lacks detail and accuracy.",
      "Student provides a satisfactory evaluation of contraceptives for STD prevention, with some minor inaccuracies.",
      "Student provides a strong and accurate evaluation of contraceptives for STD prevention.",
      "Student provides a comprehensive and insightful evaluation of contraceptives for STD prevention, demonstrating a thorough understanding of their effectiveness and limitations."
    ]
  ]
}