{
  "criteria": [
    "Understanding of HIV\/AIDS: Demonstrates comprehension of the medical and social aspects of HIV\/AIDS.",
    "Respect and Dignity: Advocates for the respect and dignity of individuals living with HIV\/AIDS.",
    "Advocacy Skills: Effectively communicates the importance of respect and dignity to others."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of HIV\/AIDS or demonstrates misconceptions.",
      "Displays a limited understanding of HIV\/AIDS, with some inaccuracies.",
      "Demonstrates a basic understanding of HIV\/AIDS, including transmission and prevention.",
      "Exhibits a solid understanding of HIV\/AIDS, including its impact on individuals and society.",
      "Shows a comprehensive understanding of HIV\/AIDS, including treatment options and challenges.",
      "Demonstrates an exceptional and nuanced understanding of HIV\/AIDS, including current research and debates."
    ],
    [
      "Demonstrates disrespectful or stigmatizing attitudes towards individuals living with HIV\/AIDS.",
      "Shows limited awareness of the need for respect and dignity for individuals living with HIV\/AIDS.",
      "Expresses basic respect for individuals living with HIV\/AIDS, but may not actively advocate for their dignity.",
      "Advocates for the respect and dignity of individuals living with HIV\/AIDS in a general way.",
      "Actively promotes respect and dignity for individuals living with HIV\/AIDS in specific contexts.",
      "Leads efforts to promote respect and dignity for individuals living with HIV\/AIDS, challenging stigma and discrimination."
    ],
    [
      "Unable to communicate the importance of respect and dignity to others.",
      "Struggles to articulate the importance of respect and dignity, with limited effectiveness.",
      "Communicates the importance of respect and dignity in a simple and straightforward manner.",
      "Effectively communicates the importance of respect and dignity, tailoring the message to the audience.",
      "Persuasively communicates the importance of respect and dignity, inspiring others to take action.",
      "Serves as a powerful advocate for respect and dignity, influencing policy and promoting social change."
    ]
  ]
}