{
  "criteria": [
    "Understanding the Relationship Between Stress and Goal Achievement",
    "Knowledge of Mental and Social Problems and Resources",
    "Application of Strategies for Prevention and Management"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how stress impacts the ability to achieve goals.",
      "Shows a minimal understanding of the connection between stress and achieving short-term or long-term goals.",
      "Identifies that stress can affect goal achievement but provides limited explanation.",
      "Explains how stress can hinder goal achievement, mentioning either short-term or long-term goals.",
      "Clearly evaluates how stress impacts both short-term and long-term goal achievement, providing some strategies for prevention or management.",
      "Comprehensively evaluates the impact of stress on both short-term and long-term goals, and thoroughly explains effective strategies for preventing and managing stress to enhance goal achievement."
    ],
    [
      "Shows no awareness of mental or social problems or resources available for help.",
      "Identifies mental or social problems vaguely, with no mention of resources.",
      "Names at least one mental or social problem and hints at the existence of resources.",
      "Identifies one or more mental and social problems and names at least one relevant resource for help.",
      "Discusses multiple mental and social problems, provides specific examples of available resources, and explains their utility.",
      "Demonstrates comprehensive knowledge of various mental and social problems, thoroughly describes relevant resources, and explains how these can be used to achieve short- and long-term goals."
    ],
    [
      "Does not suggest any strategies for preventing or managing stress or mental\/social problems.",
      "Offers a vague strategy for dealing with stress or mental\/social problems.",
      "Lists one or two simple strategies for managing stress or mental\/social problems, but lacks depth.",
      "Describes several strategies for preventing and managing stress and addressing mental\/social problems.",
      "Explains and justifies the use of multiple strategies for preventing and managing stress and addressing mental\/social problems, showing an understanding of their effectiveness.",
      "Articulates a sophisticated approach to preventing and managing stress and mental\/social problems, tailoring strategies to specific short- and long-term goals, and justifying their use with insightful reasoning."
    ]
  ]
}