{
  "criteria": [
    "Understanding of Personal Boundaries: Demonstrates comprehension of what personal boundaries are and why they are important.",
    "Application of Boundary-Setting Skills: Effectively applies boundary-setting techniques in various scenarios.",
    "Communication of Boundaries: Clearly and respectfully communicates personal boundaries to others.",
    "Response to Boundary Challenges: Demonstrates resilience and problem-solving skills when boundaries are challenged or violated."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of personal boundaries or their importance.",
      "Demonstrates a very limited understanding of personal boundaries and their importance.",
      "Shows some understanding of personal boundaries and their importance, but with gaps.",
      "Demonstrates a clear understanding of personal boundaries and their importance in maintaining healthy relationships.",
      "Demonstrates a comprehensive understanding of personal boundaries, including nuances and complexities.",
      "Exhibits a sophisticated understanding of personal boundaries, able to articulate their importance and impact on well-being and relationships with clarity and insight."
    ],
    [
      "Unable to apply boundary-setting techniques in any scenario.",
      "Struggles to apply boundary-setting techniques, even in simple scenarios.",
      "Can apply basic boundary-setting techniques in familiar scenarios, but struggles with more complex situations.",
      "Effectively applies boundary-setting techniques in a variety of common scenarios.",
      "Skillfully applies boundary-setting techniques in diverse and challenging scenarios, adapting approach as needed.",
      "Masterfully applies boundary-setting techniques in all situations, demonstrating flexibility, assertiveness, and empathy in communication."
    ],
    [
      "Unable to communicate personal boundaries effectively.",
      "Struggles to communicate personal boundaries, often ineffectively or disrespectfully.",
      "Can communicate personal boundaries in a basic way, but may lack clarity or respect.",
      "Clearly and respectfully communicates personal boundaries in most situations.",
      "Communicates personal boundaries with exceptional clarity, respect, and assertiveness, tailoring communication to the audience and situation.",
      "Exemplifies skillful communication of personal boundaries, serving as a role model for others in assertiveness, empathy, and respectful dialogue."
    ],
    [
      "Unable to respond effectively when boundaries are challenged or violated.",
      "Reacts poorly to boundary challenges, often becoming passive or aggressive.",
      "Attempts to address boundary challenges, but may struggle to find appropriate solutions.",
      "Demonstrates resilience and problem-solving skills in response to most boundary challenges.",
      "Proactively and effectively addresses boundary challenges, demonstrating creativity and resourcefulness in finding solutions.",
      "Exhibits exceptional resilience and problem-solving skills in navigating complex boundary challenges, demonstrating leadership and inspiring others to advocate for their boundaries."
    ]
  ]
}