{
  "criteria": [
    "Identification of Barriers: Demonstrates the ability to identify various barriers that can impede healthy decision-making in relationships and sexual health.",
    "Application of Decision-Making Process: Applies a structured decision-making process to analyze the identified barriers.",
    "Consideration of Consequences: Evaluates the potential consequences of decisions related to relationships and sexual health, considering both short-term and long-term impacts.",
    "Ethical Considerations: Incorporates ethical considerations and values into the decision-making process."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Fails to identify any barriers to healthy decision-making.",
      "Identifies only one or two basic barriers with little explanation.",
      "Identifies some barriers but lacks depth or specific examples.",
      "Identifies several relevant barriers, providing some explanation.",
      "Identifies most of the relevant barriers, providing clear explanations and examples.",
      "Thoroughly identifies a comprehensive range of barriers, providing insightful explanations and relevant examples."
    ],
    [
      "Does not attempt to use a decision-making process.",
      "Attempts to use a decision-making process but applies it incorrectly or incompletely.",
      "Uses a decision-making process with limited effectiveness in analyzing barriers.",
      "Applies a decision-making process to analyze some barriers effectively.",
      "Applies a decision-making process effectively to analyze most barriers.",
      "Expertly applies a decision-making process to thoroughly analyze all identified barriers, demonstrating a clear understanding of the process."
    ],
    [
      "Fails to consider the consequences of decisions.",
      "Considers only immediate consequences with no regard for long-term impacts.",
      "Considers some consequences but lacks depth or accuracy.",
      "Evaluates potential consequences with some consideration of short-term and long-term impacts.",
      "Thoroughly evaluates potential consequences, considering both short-term and long-term impacts with reasonable accuracy.",
      "Insightfully evaluates a wide range of potential consequences, demonstrating a deep understanding of the complexities and long-term implications of decisions."
    ],
    [
      "Shows no awareness of ethical considerations or values.",
      "Mentions ethical considerations superficially but does not integrate them into the decision-making process.",
      "Considers ethical considerations but lacks depth or specific examples.",
      "Integrates some ethical considerations into the decision-making process.",
      "Thoroughly integrates ethical considerations and personal values into the decision-making process, demonstrating a clear understanding of ethical principles.",
      "Demonstrates exceptional insight into ethical considerations and values, critically evaluating their role in decision-making and offering nuanced perspectives."
    ]
  ]
}