{
  "criteria": [
    "Understanding of the Problem: Demonstrates a clear understanding of the scope and impact of alcohol, tobacco, and other drug use among youths.",
    "Persuasiveness of Solution: The solution presented is compelling, logical, and likely to be effective in addressing the issue.",
    "Feasibility of Implementation: The solution is realistic and can be implemented in a school or community setting with available resources.",
    "Consideration of Target Audience: The solution is tailored to the needs and interests of the target audience (youths) and is likely to resonate with them."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the problem.",
      "Demonstrates a limited understanding of the problem, lacking key details.",
      "Demonstrates a basic understanding of the problem, but misses some important aspects.",
      "Demonstrates a satisfactory understanding of the problem, including key details and impacts.",
      "Demonstrates a strong understanding of the problem, providing a comprehensive overview.",
      "Demonstrates an exceptional understanding of the problem, including nuances and complexities."
    ],
    [
      "Presents a solution that is not persuasive or logical.",
      "Presents a solution that is weakly persuasive and lacks a clear rationale.",
      "Presents a solution that is somewhat persuasive, but with limited supporting evidence.",
      "Presents a solution that is adequately persuasive, with some supporting evidence and logical reasoning.",
      "Presents a solution that is highly persuasive, with strong supporting evidence and a compelling rationale.",
      "Presents a solution that is exceptionally persuasive, innovative, and likely to have a significant positive impact."
    ],
    [
      "Presents a solution that is completely unrealistic and impossible to implement.",
      "Presents a solution that is highly impractical and difficult to implement.",
      "Presents a solution that has some feasibility issues and requires significant resources.",
      "Presents a solution that is reasonably feasible and can be implemented with moderate resources.",
      "Presents a solution that is highly feasible and can be implemented with minimal resources.",
      "Presents a solution that is exceptionally feasible, sustainable, and easily adaptable to different settings."
    ],
    [
      "Shows no consideration of the target audience.",
      "Shows minimal consideration of the target audience, with little relevance to their needs and interests.",
      "Shows some consideration of the target audience, but lacks specific tailoring to their needs and interests.",
      "Shows adequate consideration of the target audience, with some tailoring to their needs and interests.",
      "Shows strong consideration of the target audience, with significant tailoring to their needs and interests.",
      "Shows exceptional consideration of the target audience, demonstrating a deep understanding of their perspectives and motivations."
    ]
  ]
}