{
  "criteria": [
    "Understanding of the role of witnesses and bystanders in preventing violence",
    "Clarity and effectiveness of the explanation of reporting dangerous situations",
    "Completeness and relevance of examples provided"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of how witnesses and bystanders can help prevent violence.",
      "Student shows a limited understanding of the role of witnesses and bystanders; explanation is vague and lacks detail.",
      "Student demonstrates a basic understanding of how witnesses and bystanders can help prevent violence, but explanation lacks depth.",
      "Student adequately explains how witnesses and bystanders can help prevent violence by reporting dangerous situations, with some supporting details.",
      "Student clearly and effectively explains how witnesses and bystanders can help prevent violence by reporting dangerous situations, providing relevant supporting details.",
      "Student comprehensively and insightfully explains how witnesses and bystanders can proactively help prevent violence, providing specific examples and demonstrating a thorough understanding of the topic."
    ],
    [
      "Student's explanation is unclear, incoherent, and does not address the concept of reporting dangerous situations.",
      "Student's explanation is difficult to follow, with limited information about reporting dangerous situations.",
      "Student's explanation is somewhat clear but lacks specific details on what constitutes a dangerous situation and how to report it.",
      "Student provides a reasonably clear explanation of how to report dangerous situations, but with some areas lacking detail or clarity.",
      "Student provides a clear and well-organized explanation of how to report dangerous situations, with specific examples.",
      "Student provides an exceptionally clear, concise, and persuasive explanation of how to report dangerous situations, demonstrating a sophisticated understanding of the reporting process and its impact."
    ],
    [
      "Student provides no examples or examples are completely irrelevant to the topic of violence prevention.",
      "Student provides minimal or irrelevant examples that do not support the explanation.",
      "Student provides some examples, but they are generic and lack relevance to specific scenarios.",
      "Student provides relevant examples of dangerous situations and how reporting them can help prevent violence.",
      "Student provides well-chosen and specific examples that clearly illustrate how reporting dangerous situations can prevent violence.",
      "Student provides insightful and diverse examples, demonstrating a deep understanding of different types of dangerous situations and the potential impact of reporting them."
    ]
  ]
}