{
  "criteria": [
    "Demonstrates understanding of safe relationship boundaries.",
    "Demonstrates respectful communication strategies.",
    "Exhibits responsible decision-making in relationships.",
    "Identifies resources for seeking help in unsafe or harmful relationship situations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not demonstrate understanding of safe relationship boundaries or provides unsafe examples.",
      "Shows minimal understanding of safe relationship boundaries; struggles to define clear boundaries.",
      "Shows basic understanding of safe relationship boundaries; can identify some boundaries.",
      "Clearly understands safe relationship boundaries; can define and explain boundaries.",
      "Demonstrates a comprehensive understanding of safe relationship boundaries; can explain the importance of boundaries.",
      "Demonstrates an exceptional understanding of safe relationship boundaries and advocates for healthy boundaries in relationships."
    ],
    [
      "Communication strategies used show no respect or are harmful.",
      "Demonstrates minimal understanding of respectful communication; communication is sometimes disrespectful.",
      "Demonstrates basic respectful communication, but can be inconsistent.",
      "Consistently communicates respectfully and considers the feelings of others.",
      "Exemplifies respectful communication and actively listens to others.",
      "Models and promotes respectful communication; facilitates respectful dialogue in challenging situations."
    ],
    [
      "Demonstrates no responsible decision-making in relationships or makes harmful choices.",
      "Shows minimal responsible decision-making; struggles to make choices that promote safety and respect.",
      "Makes some responsible decisions, but may need guidance in complex situations.",
      "Consistently makes responsible decisions that promote safety, respect, and well-being.",
      "Demonstrates excellent responsible decision-making and considers potential consequences.",
      "Models responsible decision-making and supports others in making healthy choices in relationships."
    ],
    [
      "Unable to identify any resources for help or provides inaccurate information.",
      "Identifies only one or two resources, with limited knowledge of their purpose.",
      "Identifies several resources but lacks detail on how to access them.",
      "Identifies several resources and explains how to access them.",
      "Identifies and explains a wide variety of resources; shows initiative in finding additional resources.",
      "Comprehensive knowledge of resources; actively promotes awareness and provides support to others seeking help."
    ]
  ]
}