{
  "criteria": [
    "Identification of potential injuries in athletic and social activities",
    "Explanation of risk reduction strategies",
    "Application of strategies to specific scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any potential injuries related to athletic or social activities.",
      "The student identifies one potential injury related to athletic or social activities.",
      "The student identifies a few potential injuries, but lacks depth or accuracy in their descriptions.",
      "The student accurately identifies several potential injuries related to athletic and social activities, demonstrating a basic understanding of common risks.",
      "The student comprehensively identifies many potential injuries, showing a strong understanding of risks in various athletic and social scenarios.",
      "The student demonstrates exceptional insight by identifying a wide range of potential injuries, including less common or subtle risks, and explaining them with clarity and precision."
    ],
    [
      "The student does not suggest any strategies to reduce the risk of injuries.",
      "The student suggests one basic strategy to reduce injury risk, but it may be vague or ineffective.",
      "The student suggests a few strategies, but they are not well-explained or clearly linked to specific injuries.",
      "The student explains several relevant strategies to reduce the risk of specific injuries, showing a basic understanding of preventive measures.",
      "The student clearly and thoroughly explains a variety of effective strategies, demonstrating a strong understanding of how to minimize injury risks.",
      "The student provides an exceptional and nuanced explanation of a comprehensive set of risk reduction strategies, demonstrating mastery of preventive measures and their practical application in various athletic and social settings."
    ],
    [
      "The student does not apply risk reduction strategies to any specific scenarios.",
      "The student attempts to apply a risk reduction strategy to a scenario, but the application is unclear or inappropriate.",
      "The student applies risk reduction strategies to a few scenarios, but the explanations are incomplete or lack detail.",
      "The student effectively applies risk reduction strategies to several specific scenarios, demonstrating a basic understanding of how to implement preventive measures in real-world situations.",
      "The student consistently and accurately applies risk reduction strategies to a variety of scenarios, demonstrating a strong understanding of how to adapt preventive measures to different contexts.",
      "The student demonstrates exceptional skill in applying risk reduction strategies to a diverse range of complex scenarios, providing insightful and well-reasoned explanations of their effectiveness and limitations."
    ]
  ]
}