{
  "criteria": [
    "Understanding of the Benefits of Physical Activity",
    "Analysis of the Relationship Between Different Types of Physical Activity and Health Outcomes",
    "Application of Knowledge to Personal Health Choices"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the benefits of physical activity on health.",
      "Shows minimal understanding of the benefits; struggles to explain the connection between activity and health.",
      "Identifies some benefits of physical activity but lacks depth in explaining their impact on overall health.",
      "Adequately explains several benefits of physical activity and their relationship to specific aspects of health.",
      "Clearly explains the significant benefits of physical activity and thoroughly describes their impact on various aspects of health.",
      "Provides an insightful and comprehensive analysis of the extensive benefits of physical activity on all dimensions of health, including physical, mental, and social well-being."
    ],
    [
      "Unable to differentiate between different types of physical activity or their health outcomes.",
      "Struggles to identify different types of physical activity and shows limited awareness of their specific health outcomes.",
      "Identifies a few types of physical activity and vaguely connects them to general health outcomes.",
      "Discusses various types of physical activity (e.g., aerobic, strength training) and relates them to specific health outcomes with reasonable accuracy.",
      "Analyzes different types of physical activity, accurately detailing their distinct impacts on various health outcomes with supporting examples.",
      "Presents a sophisticated analysis of how different types of physical activity uniquely contribute to diverse health outcomes, incorporating scientific evidence and personalized considerations."
    ],
    [
      "Does not apply knowledge of physical activity to personal health choices.",
      "Shows little to no ability to connect knowledge of physical activity to making informed personal health choices.",
      "Attempts to relate physical activity to personal health choices but struggles with specific applications.",
      "Applies knowledge of physical activity to suggest basic personal health choices, such as incorporating more walking into daily routine.",
      "Effectively uses knowledge of physical activity to formulate a personal health plan with specific, measurable, achievable, relevant, and time-bound (SMART) goals.",
      "Demonstrates exceptional ability to integrate knowledge of physical activity into a comprehensive and adaptable personal health plan, reflecting a deep understanding of individual needs and long-term well-being."
    ]
  ]
}