{
  "criteria": [
    "Identification of Pressure Situations",
    "Assessment of Risks",
    "Understanding of Contributing Factors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any situations that could lead to pressure for sexual activity, risk of HIV, other STDs, or pregnancy.",
      "The student identifies a situation with prompting.",
      "The student identifies a few situations that could lead to pressure for sexual activity, risk of HIV, other STDs, or pregnancy, but lacks detail or accuracy.",
      "The student identifies several situations that could lead to pressure for sexual activity, risk of HIV, other STDs, and pregnancy with reasonable accuracy.",
      "The student clearly identifies multiple diverse situations that could lead to pressure for sexual activity, risk of HIV, other STDs, and pregnancy with accurate details.",
      "The student comprehensively identifies and explains a wide range of situations, including subtle and complex scenarios, that could lead to pressure for sexual activity, risk of HIV, other STDs, and pregnancy, demonstrating a deep understanding."
    ],
    [
      "The student does not assess the risks associated with sexual activity in the identified situations.",
      "The student attempts to assess risks but demonstrates significant misunderstandings.",
      "The student identifies some risks associated with sexual activity, HIV, other STDs, and pregnancy, but the assessment is incomplete or contains inaccuracies.",
      "The student provides a generally accurate assessment of the risks associated with sexual activity, HIV, other STDs, and pregnancy in the identified situations.",
      "The student provides a thorough and accurate assessment of the risks, demonstrating a good understanding of the potential consequences.",
      "The student offers a nuanced and comprehensive assessment of risks, including long-term and indirect consequences, displaying a sophisticated understanding."
    ],
    [
      "The student shows no understanding of the factors that contribute to pressure for sexual activity, HIV, other STDs, and pregnancy.",
      "The student acknowledges contributing factors with prompting.",
      "The student identifies a few contributing factors to pressure, HIV, other STDs, and pregnancy, but the explanation is superficial.",
      "The student identifies and explains several key factors that contribute to pressure for sexual activity, HIV, other STDs, and pregnancy.",
      "The student thoroughly explains the various factors, including social, emotional, and psychological influences, that contribute to pressure for sexual activity, HIV, other STDs, and pregnancy.",
      "The student demonstrates a comprehensive and insightful understanding of the complex interplay of factors that contribute to pressure, HIV, other STDs, and pregnancy, including systemic and cultural influences."
    ]
  ]
}