{
  "criteria": [
    "Understanding Characteristics of Healthy Relationships",
    "Ability to Differentiate Between Healthy and Unhealthy Relationships",
    "Application of Knowledge to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the characteristics of healthy relationships, dating, committed relationships, and marriage.",
      "Student demonstrates a minimal understanding of one type of relationship (dating, committed, or marriage) and its characteristics.",
      "Student demonstrates a partial understanding of two types of relationships and some of their characteristics.",
      "Student demonstrates a general understanding of the characteristics of healthy dating, committed relationships, and marriage, but with some gaps.",
      "Student demonstrates a strong understanding of the characteristics of healthy dating, committed relationships, and marriage, providing clear examples.",
      "Student demonstrates a comprehensive and insightful understanding of the characteristics of healthy dating, committed relationships, and marriage, including nuanced aspects and potential challenges."
    ],
    [
      "Student cannot differentiate between healthy and unhealthy relationship characteristics.",
      "Student can identify one characteristic of either a healthy or unhealthy relationship.",
      "Student can identify a few characteristics of healthy and unhealthy relationships, but struggles to differentiate clearly.",
      "Student can generally differentiate between healthy and unhealthy relationship characteristics but may miss some key differences.",
      "Student can clearly differentiate between healthy and unhealthy relationship characteristics, providing relevant examples.",
      "Student demonstrates a sophisticated understanding of the nuances between healthy and unhealthy relationships, including subtle indicators and long-term impacts."
    ],
    [
      "Student cannot apply their knowledge to real-life scenarios or examples.",
      "Student attempts to apply knowledge to a real-life scenario but struggles to connect characteristics to the situation.",
      "Student can apply some knowledge to real-life scenarios but with limited accuracy or detail.",
      "Student can apply knowledge to real-life scenarios with reasonable accuracy, demonstrating a basic understanding of relationship dynamics.",
      "Student effectively applies knowledge to real-life scenarios, providing insightful analysis of relationship dynamics and potential outcomes.",
      "Student expertly applies knowledge to complex real-life scenarios, demonstrating a deep understanding of relationship dynamics, potential challenges, and effective strategies for maintaining healthy relationships."
    ]
  ]
}