{
  "criteria": [
    "Understanding of Healthy Communication:",
    "Active Listening and Empathy:",
    "Assertiveness and Boundary Setting:",
    "Conflict Resolution:"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of healthy communication in dating relationships.",
      "Demonstrates minimal understanding of healthy communication, with significant misconceptions.",
      "Displays some understanding of healthy communication but struggles to apply it to specific scenarios.",
      "Demonstrates a general understanding of healthy communication and can identify some examples in dating relationships.",
      "Shows a clear understanding of healthy communication, providing relevant examples and explaining their importance.",
      "Exhibits a comprehensive understanding of healthy communication, analyzing its nuances and demonstrating effective application in various dating scenarios."
    ],
    [
      "Does not demonstrate active listening or empathy in communication scenarios.",
      "Shows minimal effort to listen actively or empathize with others.",
      "Occasionally attempts active listening and empathy but struggles to maintain focus and understanding.",
      "Demonstrates active listening and empathy in some communication scenarios, showing an effort to understand others' perspectives.",
      "Consistently practices active listening and empathy, responding thoughtfully and demonstrating a genuine understanding of others' feelings.",
      "Models exceptional active listening and empathy skills, adapting communication strategies to meet the emotional needs of their partner."
    ],
    [
      "Unable to express their needs or set boundaries in dating relationships.",
      "Struggles to assert themselves or set boundaries, often giving in to others' demands.",
      "Occasionally asserts themselves or sets boundaries but may do so ineffectively or aggressively.",
      "Demonstrates assertiveness and boundary-setting skills in some situations, expressing their needs respectfully and firmly.",
      "Consistently asserts themselves and sets healthy boundaries, balancing their needs with those of their partner.",
      "Exhibits exceptional assertiveness and boundary-setting skills, advocating for their needs while maintaining respect and empathy in the relationship."
    ],
    [
      "Avoids conflict or resorts to unhealthy coping mechanisms in dating relationships.",
      "Struggles to resolve conflicts constructively, often escalating arguments or withdrawing from the situation.",
      "Occasionally attempts to resolve conflicts but may rely on ineffective strategies or blame others.",
      "Demonstrates some conflict resolution skills, such as compromise and negotiation, in dating relationships.",
      "Consistently resolves conflicts constructively, communicating respectfully and finding mutually agreeable solutions.",
      "Models exceptional conflict resolution skills, facilitating open and honest dialogue, and promoting understanding and reconciliation."
    ]
  ]
}