{
  "criteria": [
    "Demonstrates understanding of sexual assault and molestation.",
    "Applies communication skills to prevent sexual assault and molestation.",
    "Utilizes effective communication skills to report sexual assault and molestation."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of sexual assault and molestation.",
      "Demonstrates minimal understanding of sexual assault and molestation, with significant misconceptions.",
      "Demonstrates some understanding of sexual assault and molestation, but with some inaccuracies or gaps in knowledge.",
      "Demonstrates a clear understanding of sexual assault and molestation, with minor inaccuracies.",
      "Demonstrates a comprehensive understanding of sexual assault and molestation, with accurate information.",
      "Demonstrates an exceptional understanding of sexual assault and molestation, including nuances and complexities, and provides accurate information."
    ],
    [
      "Does not apply communication skills to prevent sexual assault and molestation.",
      "Attempts to apply communication skills, but demonstrates limited effectiveness in preventing sexual assault and molestation.",
      "Applies communication skills inconsistently, with some effectiveness in preventing sexual assault and molestation.",
      "Applies communication skills effectively in preventing sexual assault and molestation in most situations.",
      "Consistently applies communication skills effectively in preventing sexual assault and molestation in a variety of situations.",
      "Masterfully applies communication skills to prevent sexual assault and molestation, demonstrating adaptability and sensitivity to context."
    ],
    [
      "Does not utilize communication skills to report sexual assault and molestation.",
      "Attempts to utilize communication skills, but demonstrates limited effectiveness in reporting sexual assault and molestation.",
      "Utilizes communication skills inconsistently, with some effectiveness in reporting sexual assault and molestation.",
      "Utilizes communication skills effectively in reporting sexual assault and molestation in most situations.",
      "Consistently utilizes communication skills effectively in reporting sexual assault and molestation in a variety of situations.",
      "Masterfully utilizes communication skills to report sexual assault and molestation, demonstrating clarity, empathy, and respect for confidentiality."
    ]
  ]
}