{
  "criteria": [
    "Understanding Individual Differences",
    "Respect and Empathy",
    "Application to Real-Life Scenarios"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of individual differences in growth, development, physical appearance, gender roles, or sexual orientation.",
      "Demonstrates a limited understanding of individual differences, showing confusion or significant misconceptions.",
      "Identifies some individual differences but struggles to explain or provide examples.",
      "Recognizes and explains individual differences in at least three of the specified areas (growth\/development, physical appearance, gender roles, sexual orientation).",
      "Clearly recognizes and explains individual differences in all specified areas, providing relevant examples.",
      "Demonstrates a comprehensive understanding of individual differences, including nuanced perspectives and the impact of these differences on individuals and society."
    ],
    [
      "Shows no respect or empathy towards individual differences; may express prejudiced views.",
      "Shows limited respect or empathy; may demonstrate unintentional bias or insensitivity.",
      "Acknowledges the importance of respect but struggles to apply it in practical situations.",
      "Demonstrates respect and empathy towards individual differences in most situations.",
      "Consistently demonstrates respect and empathy, actively challenging stereotypes or biases.",
      "Exemplifies respect and empathy, advocating for inclusivity and understanding within the community."
    ],
    [
      "Unable to apply the understanding of individual differences to real-life scenarios.",
      "Struggles to apply the understanding of individual differences to real-life scenarios.",
      "Can identify some ways individual differences might affect real-life situations but lacks depth in analysis.",
      "Applies the understanding of individual differences to analyze and explain real-life scenarios effectively.",
      "Applies the understanding of individual differences to analyze complex real-life scenarios, offering insightful perspectives.",
      "Synthesizes the understanding of individual differences to critically analyze complex real-life scenarios, propose solutions, and advocate for positive change."
    ]
  ]
}