{
  "criteria": [
    "Understanding of Choreographic Sources and Inspiration",
    "Application of Movement Vocabulary and Personal Style",
    "Synthesis of Stimulus Material into Choreography",
    "Comparison to Well-Known Choreographers"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how choreographers find inspiration or utilize sources.",
      "Shows limited awareness of potential sources of inspiration for choreography.",
      "Identifies some sources of inspiration but struggles to connect them to movement ideas.",
      "Understands how choreographers use various sources for inspiration and translates these into basic movement ideas.",
      "Clearly articulates how choreographers draw inspiration from diverse sources, effectively transforming concepts into movement.",
      "Demonstrates a sophisticated understanding of how choreographers synthesize various sources to create innovative and expressive movement."
    ],
    [
      "Displays no application of movement vocabulary or personal style in choreography.",
      "Shows minimal incorporation of movement vocabulary or personal style; movements appear disjointed.",
      "Incorporates basic movement vocabulary and attempts to integrate personal style, but with limited success.",
      "Combines movement vocabulary with personal style to create coherent choreography, demonstrating artistic intent.",
      "Skillfully blends movement vocabulary with personal style, creating original and expressive choreography that effectively communicates artistic intent.",
      "Masterfully integrates movement vocabulary and personal style to produce highly original and impactful choreography, demonstrating a clear and compelling artistic intent."
    ],
    [
      "Fails to synthesize stimulus materials into choreographed movement.",
      "Struggles to connect stimulus materials to movement ideas; choreography lacks cohesion.",
      "Demonstrates some ability to translate stimulus materials into movement, but the connection is weak.",
      "Synthesizes stimulus materials into choreographic studies with some originality.",
      "Effectively synthesizes stimulus materials to choreograph dance studies or dances with a clear artistic vision.",
      "Expertly synthesizes stimulus materials into innovative and compelling choreography that reflects a deep understanding of the source material."
    ],
    [
      "Does not attempt to compare personal choices to those made by well-known choreographers.",
      "Makes a superficial attempt to compare personal choices to those of well-known choreographers.",
      "Identifies some similarities and differences between personal choices and those of well-known choreographers, but lacks depth.",
      "Compares personal choreographic choices to those made by well-known choreographers, providing some relevant insights.",
      "Critically compares personal choices to those made by well-known choreographers, demonstrating a strong understanding of choreographic techniques and artistic intent.",
      "Provides a sophisticated analysis of the similarities and differences between personal choreographic choices and those of well-known choreographers, demonstrating a nuanced understanding of choreographic history and practice."
    ]
  ]
}