{
  "criteria": [
    "Synthesis of Content from Stimulus Material",
    "Experimentation and Risk-Taking",
    "Expansion of Movement Preferences",
    "Analysis of Unexpected Solutions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the stimulus material and makes no attempt to translate it into movement.",
      "The student demonstrates minimal understanding of the stimulus material, and the connection to movement is unclear.",
      "The student demonstrates some understanding of the stimulus material, but the translation into movement is basic and literal.",
      "The student demonstrates a good understanding of the stimulus material and translates it into movement with some creativity.",
      "The student demonstrates a strong understanding of the stimulus material and translates it into movement with clear artistic intent and personal voice.",
      "The student demonstrates an exceptional understanding of the stimulus material and skillfully translates it into original and compelling movement that communicates artistic intent with a distinct personal voice."
    ],
    [
      "The student avoids experimentation and takes no risks in exploring movement possibilities.",
      "The student attempts minimal experimentation, staying within their comfort zone.",
      "The student explores some new movement ideas, but the risks taken are minimal.",
      "The student experiments with a variety of movements, taking some risks to discover a personal voice.",
      "The student confidently experiments with movement and takes risks, resulting in unexpected solutions and a developing personal voice.",
      "The student fearlessly experiments with movement, taking significant risks that lead to highly original solutions and a strong, unique personal voice."
    ],
    [
      "The student relies solely on familiar movement patterns and shows no attempt to expand their preferences.",
      "The student makes a limited attempt to incorporate new movements, but primarily relies on their established preferences.",
      "The student includes some new movement ideas, but the integration is not always successful or purposeful.",
      "The student expands their movement vocabulary and incorporates new movements effectively to communicate artistic intent.",
      "The student demonstrates a willingness to move outside their comfort zone, successfully expanding their movement preferences to discover unexpected solutions.",
      "The student seamlessly integrates a wide range of movements, demonstrating mastery in expanding their movement preferences to create innovative and impactful choreography."
    ],
    [
      "The student does not identify or analyze any unexpected solutions in their choreographic process.",
      "The student identifies an unexpected solution but offers no analysis of its effectiveness.",
      "The student identifies an unexpected solution and provides a superficial explanation of its effectiveness.",
      "The student analyzes an unexpected solution and explains how it contributes to the artistic intent of the dance.",
      "The student deeply analyzes unexpected solutions, providing insightful explanations of their effectiveness in expanding artistic intent and communication.",
      "The student provides a comprehensive and nuanced analysis of unexpected solutions, demonstrating a profound understanding of their impact on the artistic intent and overall effectiveness of the choreography."
    ]
  ]
}