{
  "criteria": [
    "Identification of 2D Cross-Sections",
    "Identification of 3D Objects from Rotations",
    "Justification and Reasoning"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No attempt to identify cross-sections or demonstrates complete misunderstanding.",
      "Struggles to identify cross-sections; identifies only the most basic shapes with prompting.",
      "Identifies simple cross-sections (e.g., circle from a sphere) but struggles with more complex shapes or solids.",
      "Can identify cross-sections of common 3D objects (e.g., cube, cylinder) but may have difficulty with less familiar objects or complex cuts.",
      "Accurately identifies cross-sections of various 3D objects, including those with less common shapes or cuts. Explains reasoning clearly.",
      "Consistently and accurately identifies complex cross-sections, providing detailed explanations of the relationship between the cut and the resulting 2D shape. Demonstrates a deep understanding."
    ],
    [
      "No attempt to identify objects of rotation or demonstrates complete misunderstanding.",
      "Struggles to visualize rotations; unable to identify the 3D object formed, even with simple 2D shapes.",
      "Identifies basic 3D objects (e.g., cylinder from a rectangle) but struggles with more complex shapes or orientations.",
      "Can identify 3D objects generated by rotating common 2D shapes around a simple axis, but may have difficulty with less familiar shapes or more complex rotations.",
      "Accurately identifies 3D objects generated by rotations of various 2D shapes. Explains reasoning clearly, including the effect of the axis of rotation.",
      "Consistently and accurately identifies 3D objects resulting from complex rotations, providing detailed explanations of the process and the resulting shape. Demonstrates a deep understanding of rotational symmetry."
    ],
    [
      "Provides no justification or reasoning for answers.",
      "Offers minimal or unclear justification, demonstrating limited understanding.",
      "Provides some justification, but reasoning may be incomplete or contain inaccuracies.",
      "Justifies answers with reasonable reasoning, showing a good understanding of the concepts.",
      "Clearly and logically justifies answers, providing thorough explanations and demonstrating a strong understanding.",
      "Provides comprehensive and insightful justifications, connecting concepts and demonstrating a deep understanding. Reasoning is articulate and precise."
    ]
  ]
}