{
  "criteria": [
    "Understanding the Role of Carbon, Hydrogen, and Oxygen",
    "Explanation of Sugar Molecules Combining to Form Other Molecules",
    "Use of Evidence from Models and Simulations",
    "Clarity and Organization of Explanation"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate an understanding of the role carbon, hydrogen, and oxygen play in forming sugar molecules.",
      "The student shows a limited understanding of the role carbon, hydrogen, and oxygen in forming sugar molecules.",
      "The student demonstrates a basic understanding of how carbon, hydrogen, and oxygen form sugar molecules, but lacks detail.",
      "The student adequately explains how carbon, hydrogen, and oxygen combine to form sugar molecules.",
      "The student thoroughly explains how carbon, hydrogen, and oxygen combine to form sugar molecules and their importance.",
      "The student comprehensively explains how carbon, hydrogen, and oxygen combine to form sugar molecules, their importance, and can relate this to other biological molecules."
    ],
    [
      "The student does not attempt to explain how sugar molecules combine to form amino acids or other carbon-based molecules.",
      "The student's explanation of how sugar molecules combine to form other molecules is unclear and incomplete.",
      "The student provides a vague explanation of how sugar molecules combine to form other molecules, with some inaccuracies.",
      "The student adequately explains how sugar molecules may combine with other elements to form amino acids and\/or other large carbon-based molecules.",
      "The student clearly explains how sugar molecules combine with other elements to form amino acids and other carbon-based molecules, providing supporting details.",
      "The student provides a detailed and accurate explanation of how sugar molecules combine to form amino acids and other carbon-based molecules, including specific examples and reasoning."
    ],
    [
      "The student does not use evidence from models or simulations to support their explanation.",
      "The student attempts to use evidence from models or simulations, but it is inappropriate or irrelevant.",
      "The student uses some evidence from models or simulations, but it is not well-integrated or explained.",
      "The student uses evidence from models and simulations to support their explanation.",
      "The student effectively uses evidence from models and simulations to strengthen and clarify their explanation.",
      "The student skillfully uses evidence from multiple models and simulations to provide a comprehensive and compelling explanation."
    ],
    [
      "The student's explanation is unclear, disorganized, and difficult to understand.",
      "The student's explanation lacks clarity and organization, making it challenging to follow.",
      "The student's explanation is somewhat clear and organized, but could be improved.",
      "The student's explanation is clear and organized, making it easy to understand.",
      "The student's explanation is very clear, well-organized, and presented in a logical manner.",
      "The student's explanation is exceptionally clear, concise, and logically organized, demonstrating a strong command of the material."
    ]
  ]
}