{
  "criteria": [
    "Understanding of British Colonial Influence on Self-Government",
    "Understanding of British Colonial Influence on Free-Market Economic System",
    "Comparison of British, Spanish, and French Colonial Systems"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the British colonial period's influence on the development of political self-government.",
      "Student shows a minimal understanding, with significant misconceptions about the key factors.",
      "Student identifies some aspects of British colonial influence but lacks depth and clarity.",
      "Student demonstrates a satisfactory understanding of the British colonial period's influence on the development of political self-government, identifying several key factors.",
      "Student demonstrates a strong understanding of the British colonial period's influence on the development of political self-government, providing clear and well-supported explanations.",
      "Student demonstrates a comprehensive and insightful understanding of the British colonial period's influence on the development of political self-government, providing nuanced analysis and relevant historical context."
    ],
    [
      "Student demonstrates no understanding of the British colonial period's influence on the development of a free-market economic system.",
      "Student shows a minimal understanding, with significant misconceptions about the key factors.",
      "Student identifies some aspects of British colonial influence but lacks depth and clarity.",
      "Student demonstrates a satisfactory understanding of the British colonial period's influence on the development of a free-market economic system, identifying several key factors.",
      "Student demonstrates a strong understanding of the British colonial period's influence on the development of a free-market economic system, providing clear and well-supported explanations.",
      "Student demonstrates a comprehensive and insightful understanding of the British colonial period's influence on the development of a free-market economic system, providing nuanced analysis and relevant historical context."
    ],
    [
      "Student demonstrates no understanding of the differences between the British, Spanish, and French colonial systems.",
      "Student shows a minimal understanding, with significant misconceptions about the key differences.",
      "Student identifies some differences between the colonial systems but lacks depth and clarity.",
      "Student demonstrates a satisfactory understanding of the differences between the British, Spanish, and French colonial systems, identifying several key factors.",
      "Student demonstrates a strong understanding of the differences between the British, Spanish, and French colonial systems, providing clear and well-supported explanations.",
      "Student demonstrates a comprehensive and insightful understanding of the differences between the British, Spanish, and French colonial systems, providing nuanced analysis and relevant historical context."
    ]
  ]
}