{
  "criteria": [
    "Understanding of Confucianism's Influences",
    "Analysis of Changes in Confucian Thought During the Sung and Mongol Periods",
    "Connections Between Confucianism and Historical Events"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of Confucianism's influences on Chinese society, politics, economics, religion, or social structures during the Middle Ages.",
      "Student demonstrates a minimal understanding of Confucianism's influences, with significant gaps in knowledge.",
      "Student identifies some of Confucianism's influences but struggles to explain them clearly or provide specific examples.",
      "Student explains several of Confucianism's key influences on Chinese society during the Middle Ages with reasonable clarity and provides a few supporting details.",
      "Student thoroughly explains Confucianism's broad influences on Chinese society, politics, economics, religion, and social structures during the Middle Ages, providing specific and relevant examples.",
      "Student provides a comprehensive and nuanced explanation of Confucianism's multifaceted influences, demonstrating deep insight and offering compelling examples and analysis."
    ],
    [
      "Student shows no awareness of changes in Confucian thought during the Sung and Mongol periods.",
      "Student mentions that Confucian thought changed, but cannot identify any specific changes or their causes.",
      "Student identifies one or two changes in Confucian thought but struggles to explain their significance or context.",
      "Student describes several changes in Confucian thought during the Sung and Mongol periods and offers some explanation of their causes and consequences.",
      "Student provides a detailed analysis of significant changes in Confucian thought during the Sung and Mongol periods, including the rise of Neo-Confucianism, explaining the socio-political context and intellectual motivations behind these changes.",
      "Student offers a sophisticated and insightful analysis of the evolution of Confucian thought, exploring the nuances of different schools of thought, their leading figures, and their lasting impact on Chinese society and culture."
    ],
    [
      "Student fails to make any connection between Confucianism and historical events of the time.",
      "Student makes vague or inaccurate connections between Confucianism and historical events.",
      "Student identifies a few connections but doesn't explain them well.",
      "Student connects Confucian ideals to some historical events, providing basic explanations.",
      "Student clearly explains how Confucianism influenced or was influenced by major historical events of the Sung and Mongol periods.",
      "Student provides a sophisticated and well-supported analysis of the complex interactions between Confucian thought and historical events, demonstrating a deep understanding of cause and effect."
    ]
  ]
}