{
  "criteria": [
    "Understanding of Key Explorers and Their Voyages",
    "Knowledge of Geographical Locations and Routes",
    "Understanding the Influence of Cartography",
    "Analysis of the Economic and Political Impact of Exploration"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of any major voyages or explorers during the Age of Exploration.",
      "Identifies one or two explorers or voyages but lacks detail or accuracy.",
      "Names several key explorers and voyages, but with some inaccuracies or gaps in knowledge.",
      "Accurately identifies several major explorers (e.g., Columbus, Magellan, Vasco da Gama) and their voyages, providing basic details.",
      "Demonstrates a strong understanding of major explorers and their voyages, including routes and motivations, with few inaccuracies.",
      "Exhibits comprehensive knowledge of key explorers and voyages, including detailed routes, motivations, and impacts, demonstrating insightful understanding."
    ],
    [
      "Unable to locate any of the major routes of exploration on a map or describe their general direction.",
      "Can identify a general area of exploration (e.g., the Americas) but is unable to trace any specific routes.",
      "Identifies some major routes on a map but struggles with accuracy or completeness.",
      "Accurately locates several major exploration routes on a map, such as the voyages to the Americas, around Africa, or to Asia.",
      "Demonstrates a detailed knowledge of the geographical locations and routes of various explorers, including specific bodies of water and land masses traversed.",
      "Displays expert knowledge of the geographical context of the Age of Exploration, including detailed mapping of routes and an understanding of the geographical challenges faced by explorers."
    ],
    [
      "Shows no awareness of the role of cartography in the Age of Exploration or its impact on European worldviews.",
      "Mentions cartography but cannot explain its significance or influence.",
      "Recognizes that maps were important but provides a limited explanation of their influence.",
      "Explains how improved maps aided exploration and contributed to a changing European worldview.",
      "Analyzes the influence of cartography on exploration and European understanding of the world, including its role in shaping trade routes and colonial ambitions.",
      "Critically evaluates the influence of cartography, including its biases and limitations, and demonstrates a sophisticated understanding of its role in constructing a new European worldview and enabling global power dynamics."
    ],
    [
      "Does not discuss the economic or political consequences of the voyages of discovery.",
      "Briefly mentions economic or political impacts without providing details.",
      "Identifies some economic and\/or political effects of exploration, such as trade or colonization, but lacks depth.",
      "Explains several economic and political impacts of the Age of Exploration, such as the growth of trade, the rise of empires, or the spread of European influence.",
      "Analyzes the significant economic and political transformations resulting from the Age of Exploration, including the Columbian Exchange, mercantilism, and the rise of colonial powers.",
      "Evaluates the complex and long-lasting economic and political legacies of the Age of Exploration, demonstrating a nuanced understanding of its impact on global power structures, trade networks, and cultural exchanges, with specific examples."
    ]
  ]
}