{
  "criteria": [
    "Identification of Significant Inventors and Their Inventions",
    "Explanation of How Inventions Improved Quality of Life"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student is unable to name any significant inventors or their inventions from the Industrial Revolution.",
      "The student can name one significant inventor and\/or their invention, but the information provided is minimal and\/or inaccurate.",
      "The student can name at least two significant inventors and their inventions, but there are inaccuracies or omissions in the details.",
      "The student can name several significant inventors and their inventions with reasonable accuracy and detail.",
      "The student demonstrates a strong understanding by accurately naming multiple significant inventors and their key inventions, providing specific details.",
      "The student demonstrates comprehensive knowledge by accurately naming numerous significant inventors and their inventions, including lesser-known figures, with detailed and insightful information."
    ],
    [
      "The student cannot explain how any of the mentioned inventions improved the quality of life.",
      "The student attempts to explain how inventions improved the quality of life, but the explanation is vague, unclear, or inaccurate.",
      "The student explains how one or two inventions improved the quality of life, but the explanation lacks depth or contains some inaccuracies.",
      "The student adequately explains how several inventions improved the quality of life, providing some supporting details.",
      "The student thoroughly explains how multiple inventions significantly improved the quality of life, providing clear and relevant examples and details.",
      "The student provides an insightful and comprehensive analysis of how inventions transformed and improved various aspects of life during the Industrial Revolution, demonstrating a nuanced understanding of their impact."
    ]
  ]
}