{
  "criteria": [
    "Understanding of the Geographic Origins and Expansion of Aztec and Incan Empires",
    "Explanation of the Defeat of the Aztec and Incan Empires by the Spanish",
    "Clarity and Organization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of where the Aztec and Incan empires arose or how they expanded.",
      "Student shows minimal understanding of the geographic origins and expansion of the Aztec and Incan empires, with significant inaccuracies.",
      "Student identifies the general locations of the Aztec and Incan empires but struggles to explain the key factors influencing their expansion.",
      "Student accurately describes the geographic locations where the Aztec and Incan empires arose and explains some factors that contributed to their expansion, but lacks depth.",
      "Student provides a detailed explanation of the geographic origins and expansion of both the Aztec and Incan empires, including key geographic and environmental factors.",
      "Student offers a comprehensive and nuanced analysis of the geographic origins and expansion of the Aztec and Incan empires, demonstrating a sophisticated understanding of the interplay between geography, environment, and imperial growth."
    ],
    [
      "Student demonstrates no understanding of how the Aztec and Incan empires were defeated by the Spanish.",
      "Student offers a vague or inaccurate account of the Spanish conquest of the Aztec and Incan empires.",
      "Student identifies the Spanish as the conquerors of the Aztec and Incan empires but provides limited explanation of the factors contributing to their defeat.",
      "Student explains some of the key factors that led to the defeat of the Aztec and Incan empires by the Spanish, such as superior weaponry or disease.",
      "Student provides a detailed explanation of the key factors that led to the defeat of the Aztec and Incan empires, including military technology, disease, alliances, and internal conflicts.",
      "Student presents a comprehensive and insightful analysis of the complex factors contributing to the Spanish conquest of the Aztec and Incan empires, demonstrating a nuanced understanding of the historical context."
    ],
    [
      "Response is unclear, disorganized, and difficult to understand.",
      "Response lacks clarity and organization, making it difficult to follow the argument or explanation.",
      "Response is somewhat organized but contains some confusing or unclear statements.",
      "Response is generally clear and organized, with a logical flow of ideas.",
      "Response is clear, well-organized, and easy to understand, with a coherent argument or explanation.",
      "Response is exceptionally clear, well-organized, and engaging, demonstrating sophisticated communication skills."
    ]
  ]
}