{
  "criteria": [
    "Understanding of International Trade Concepts",
    "Analysis of U.S. Economy's Influence",
    "Analysis of International Forces' Influence on U.S. Economy",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of basic international trade concepts.",
      "Struggles to define international trade and its components.",
      "Identifies basic concepts of international trade, but lacks depth.",
      "Explains some international trade concepts with reasonable accuracy.",
      "Clearly explains international trade concepts, including comparative advantage and trade barriers.",
      "Demonstrates comprehensive understanding of international trade concepts and their real-world applications."
    ],
    [
      "Unable to articulate any influence of the U.S. economy on international trade.",
      "Suggests a vague relationship between the U.S. economy and international trade.",
      "Identifies one or two ways the U.S. economy interacts with international trade, but lacks analysis.",
      "Analyzes how the U.S. economy affects international trade with limited examples.",
      "Provides a detailed analysis of how the U.S. economy affects international trade, citing specific policies or events.",
      "Offers a nuanced and insightful analysis of the U.S. economy's multifaceted influence on international trade, including both positive and negative impacts."
    ],
    [
      "Cannot identify any ways in which international economic forces affect the U.S. economy.",
      "Suggests a vague connection between international forces and the U.S. economy.",
      "Identifies one or two international factors affecting the U.S. economy, but with limited explanation.",
      "Explains how international economic forces impact the U.S. economy with general examples.",
      "Provides a detailed analysis of how international economic forces impact the U.S. economy, citing specific examples.",
      "Offers a comprehensive analysis of how international economic forces shape the U.S. economy, considering diverse perspectives and long-term implications."
    ],
    [
      "Provides no evidence or examples to support claims.",
      "Provides minimal and irrelevant evidence or examples.",
      "Offers some relevant evidence or examples, but lacks explanation.",
      "Supports analysis with relevant evidence and examples, but connection may be weak.",
      "Effectively uses evidence and examples to support claims and strengthen analysis.",
      "Masterfully integrates compelling evidence and examples to create a persuasive and insightful analysis."
    ]
  ]
}