{
  "criteria": [
    "Understanding the Purpose of the Open Door Policy",
    "Identifying the Effects of the Open Door Policy",
    "Clarity and Accuracy of Information"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the Open Door Policy's purpose.",
      "Student demonstrates a minimal understanding of the Open Door Policy's purpose, with significant inaccuracies.",
      "Student identifies the Open Door Policy but struggles to accurately explain its intended purpose.",
      "Student adequately explains the Open Door Policy's primary purpose (e.g., equal trade opportunities in China).",
      "Student clearly explains the Open Door Policy's purpose, including its economic and political motivations.",
      "Student comprehensively explains the Open Door Policy's purpose, including the historical context and competing interests of various nations."
    ],
    [
      "Student is unable to identify any effects of the Open Door Policy.",
      "Student mentions one or two effects of the Open Door Policy, but they are vague or inaccurate.",
      "Student identifies some effects of the Open Door Policy, but the explanation lacks detail and clarity.",
      "Student describes several effects of the Open Door Policy, such as its impact on trade relations.",
      "Student clearly explains multiple effects of the Open Door Policy, including both intended and unintended consequences.",
      "Student comprehensively analyzes the short-term and long-term effects of the Open Door Policy on China, the United States, and other world powers, demonstrating nuanced understanding."
    ],
    [
      "Information provided is largely unclear, inaccurate, or irrelevant.",
      "Information is presented with significant inaccuracies and lacks clarity.",
      "Information contains some inaccuracies and is not always clearly presented.",
      "Information is generally accurate and presented with reasonable clarity.",
      "Information is accurate, well-organized, and clearly presented.",
      "Information is exceptionally clear, accurate, and insightful, demonstrating a strong command of the subject matter."
    ]
  ]
}