{
  "criteria": [
    "Understanding of Environmental Conservation and National Park System Expansion",
    "Knowledge of Environmental Protection Laws",
    "Analysis of the Interaction Between Environmental Protection Advocates and Property Rights Advocates"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of environmental conservation or the expansion of the national park system.",
      "Shows a minimal understanding of environmental conservation or the expansion of the national park system.",
      "Displays a basic understanding of environmental conservation and\/or the expansion of the national park system, but lacks depth.",
      "Exhibits a satisfactory understanding of environmental conservation and the expansion of the national park system.",
      "Demonstrates a strong understanding of environmental conservation and the expansion of the national park system, including key concepts.",
      "Shows a comprehensive and nuanced understanding of environmental conservation and the expansion of the national park system, including historical context and significance."
    ],
    [
      "Demonstrates no knowledge of environmental protection laws.",
      "Shows a minimal awareness of environmental protection laws.",
      "Displays a basic knowledge of some environmental protection laws, but lacks specifics.",
      "Exhibits a satisfactory knowledge of several environmental protection laws and their purpose.",
      "Demonstrates a strong knowledge of various environmental protection laws, including their impact and controversies.",
      "Shows a comprehensive knowledge of a wide range of environmental protection laws, including their historical development and current relevance."
    ],
    [
      "Unable to identify any interaction between environmental protection advocates and property rights advocates.",
      "Identifies a minimal level of interaction between environmental protection advocates and property rights advocates.",
      "Describes a basic level of interaction between environmental protection advocates and property rights advocates, but lacks analysis.",
      "Analyzes the interaction between environmental protection advocates and property rights advocates, identifying some key points of contention.",
      "Demonstrates a strong analysis of the interaction between environmental protection advocates and property rights advocates, including different perspectives.",
      "Shows a comprehensive and nuanced analysis of the interaction between environmental protection advocates and property rights advocates, including historical context, legal precedents, and potential resolutions."
    ]
  ]
}