{
  "criteria": [
    "Understanding of Overland Trail Routes",
    "Knowledge of Journey Purposes and Motivations",
    "Understanding of Environmental and Climatic Influences",
    "Knowledge of Life in Western Territories"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the routes taken by settlers on the overland trails.",
      "Identifies the existence of overland trails but shows minimal knowledge of specific routes or their geographical locations.",
      "Identifies a few key overland trail routes (e.g., Oregon Trail, Santa Fe Trail) but struggles to accurately describe their paths.",
      "Accurately describes the general routes of several major overland trails and can identify some key geographical features along the way.",
      "Provides a detailed description of the routes of several major overland trails, including specific landmarks, challenges, and variations in the paths.",
      "Demonstrates comprehensive knowledge of overland trail routes, including their historical evolution, variations, and impact on settlement patterns, using maps and primary sources effectively."
    ],
    [
      "Shows no awareness of the reasons why settlers undertook journeys on the overland trails.",
      "States a general reason for westward migration (e.g., 'to find land') but lacks specific details or historical context.",
      "Identifies a few common motivations for westward migration (e.g., economic opportunity, religious freedom) but does not elaborate.",
      "Explains several key motivations for westward migration, including economic factors (e.g., land ownership, gold rush), religious factors, and social factors.",
      "Analyzes the complex interplay of factors that motivated westward migration, including push and pull factors, and the diverse experiences of different groups of settlers.",
      "Evaluates the relative importance of different motivations for westward migration, drawing on historical evidence and primary source accounts to support their conclusions, and discussing the long-term consequences of these migrations."
    ],
    [
      "Does not recognize the impact of terrain, rivers, vegetation, and climate on the experiences of settlers.",
      "Mentions the existence of environmental challenges but does not provide specific examples or explain their significance.",
      "Identifies a few ways in which the environment affected settlers (e.g., lack of water, difficult terrain) but lacks detail.",
      "Describes how specific environmental factors (e.g., mountain ranges, river crossings, extreme weather) influenced the routes, timing, and challenges of overland trail journeys.",
      "Explains in detail how environmental conditions shaped settlers' daily lives, economic activities, and interactions with Native American populations along the overland trails.",
      "Analyzes the long-term ecological consequences of westward migration, including deforestation, soil erosion, and the displacement of native species, and explains how settlers adapted to and altered the environment."
    ],
    [
      "Demonstrates no knowledge of what life was like for settlers in the territories at the end of the overland trails.",
      "States that settlers lived in the West but provides no specific details about their lives or communities.",
      "Identifies a few common aspects of life in western territories (e.g., farming, building towns) but lacks specific historical context.",
      "Describes daily life, economic activities, social structures, and challenges faced by settlers in western territories, providing specific examples.",
      "Explains how settlers adapted to life in western territories, including their interactions with Native American populations, the development of new economic systems, and the establishment of communities.",
      "Evaluates the long-term social, economic, and political consequences of westward expansion on both settlers and Native American populations, and assesses the legacy of the overland trails in shaping the American West."
    ]
  ]
}