{
  "criteria": [
    "Understanding of Geographic Factors",
    "Analysis of Political Structures",
    "Examination of Economic Systems",
    "Understanding of Religious and Philosophical Beliefs",
    "Analysis of Social Structures"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how geography influenced early Chinese civilization.",
      "Shows minimal awareness of the geographic factors influencing early China.",
      "Identifies some geographic factors, but explanation of their influence is superficial.",
      "Explains how geographic factors such as rivers, mountains, and climate influenced the development of early Chinese civilization with some detail.",
      "Clearly explains how geographic factors significantly shaped the development, agriculture, and culture of early Chinese civilization.",
      "Provides a comprehensive and nuanced analysis of the profound impact of geographic factors on all aspects of early Chinese civilization, including specific examples."
    ],
    [
      "Demonstrates no understanding of the political systems in early China.",
      "Shows a basic awareness of political structures in early China.",
      "Identifies some political structures (e.g., dynasties) but lacks explanation of their function.",
      "Describes the basic political structures of early China, such as dynasties and the Mandate of Heaven, with some understanding of their roles.",
      "Analyzes the political structures, explaining the roles of different dynasties, the Mandate of Heaven, and the impact on Chinese society.",
      "Provides an in-depth analysis of the complexities of early Chinese political systems, including power dynamics, bureaucracy, and their long-term impact on governance."
    ],
    [
      "Demonstrates no understanding of the economic systems in early China.",
      "Shows minimal awareness of economic activities in early China.",
      "Identifies some economic activities (e.g., agriculture) but lacks explanation of their significance.",
      "Describes the main economic activities in early China, such as agriculture and trade, with some understanding of their organization.",
      "Explains how economic systems, including agriculture, trade, and taxation, shaped early Chinese society and its development.",
      "Provides a detailed analysis of the economic systems, including agricultural innovations, trade networks, and their impact on social structure and wealth distribution."
    ],
    [
      "Demonstrates no understanding of religious or philosophical beliefs in early China.",
      "Shows a basic awareness of religious or philosophical ideas in early China.",
      "Identifies some religious\/philosophical beliefs (e.g., Confucianism) but lacks explanation of their core tenets.",
      "Describes key religious and philosophical beliefs, such as Confucianism, Taoism, and Legalism, with some understanding of their influence.",
      "Analyzes the impact of Confucianism, Taoism, and other belief systems on Chinese society, ethics, and governance.",
      "Provides an in-depth exploration of the complex interplay between religious, philosophical, and ethical systems in early China, including their evolution and impact on daily life."
    ],
    [
      "Demonstrates no understanding of the social structure of early China.",
      "Shows a minimal understanding of the social structure of early China.",
      "Identifies elements of the social structure, but cannot explain how they functioned.",
      "Describes the basic social structures of early China, including the roles of different social classes and family relationships.",
      "Analyzes the social hierarchy, family structures, and gender roles in early Chinese society and their impact on social mobility and stability.",
      "Provides a nuanced analysis of social stratification, mobility, and the impact of cultural norms and values on individual lives in early China."
    ]
  ]
}