{
  "criteria": [
    "Understanding of the conditions leading to the rise of a military society in Japan.",
    "Knowledge of the samurai and their role in Japanese society.",
    "Understanding of the impact of the military society on other aspects of Japanese life."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the factors that contributed to the rise of a military society in Japan.",
      "Shows minimal understanding of one or two factors, with significant inaccuracies or omissions.",
      "Identifies some factors (e.g., weak central government, land disputes) but lacks depth and detail.",
      "Explains several key factors contributing to the militarization of Japanese society, such as the decline of the imperial court and the rise of powerful clans.",
      "Analyzes the complex interplay of political, economic, and social factors that led to the rise of a military society, demonstrating a strong grasp of cause and effect.",
      "Provides a comprehensive and nuanced analysis of the historical context, including insightful connections between various factors and their long-term consequences. Demonstrates exceptional understanding."
    ],
    [
      "Displays no knowledge of the samurai or their societal role.",
      "Has a vague idea of the samurai but demonstrates several inaccuracies.",
      "Identifies the samurai as warriors but struggles to explain their specific functions or code of conduct.",
      "Describes the samurai as a warrior class with specific duties, like protecting their lords and maintaining order, but lacks detail about their culture or code of honor (Bushido).",
      "Explains the multifaceted role of the samurai, including their military functions, social status, and adherence to Bushido. Provides accurate examples.",
      "Offers a sophisticated analysis of the samurai's role, discussing variations in their status and function over time, and their lasting impact on Japanese culture. Demonstrates comprehensive understanding."
    ],
    [
      "Shows no awareness of the influence of the military society on other facets of Japanese life.",
      "Attempts to link the military society to other areas but does so inaccurately or superficially.",
      "Acknowledges that the military society affected other aspects of life (e.g., art, religion) but provides limited details.",
      "Describes how the rise of the samurai and military rule influenced aspects of Japanese society, such as the arts (e.g., Zen Buddhism, martial arts) and governance.",
      "Analyzes the significant impact of the military society on various aspects of Japanese life, providing specific examples and explaining the interconnections.",
      "Offers a detailed and insightful analysis of the profound transformation of Japanese society under military rule, discussing both the positive and negative consequences. Demonstrates nuanced understanding."
    ]
  ]
}