{
  "criteria": [
    "Understanding the Origins and Geopolitical Consequences of the Cold War",
    "Knowledge of McCarthyism, Domestic Communism, and Blacklisting",
    "Understanding Key Cold War Events and Policies"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the origins or geopolitical consequences of the Cold War.",
      "Student demonstrates a minimal understanding of the origins or geopolitical consequences of the Cold War, with significant gaps in knowledge.",
      "Student demonstrates a basic understanding of some of the origins and geopolitical consequences of the Cold War, but struggles with specific details or connections.",
      "Student demonstrates a satisfactory understanding of the origins and geopolitical consequences of the Cold War, identifying key events and their impact.",
      "Student demonstrates a strong understanding of the origins and geopolitical consequences of the Cold War, explaining events and their impact with supporting details.",
      "Student demonstrates a comprehensive understanding of the origins and geopolitical consequences of the Cold War, analyzing complex relationships between events and their long-term impact."
    ],
    [
      "Student demonstrates no knowledge of McCarthyism, instances of domestic Communism, or blacklisting.",
      "Student demonstrates a minimal knowledge of McCarthyism, instances of domestic Communism, or blacklisting, with significant inaccuracies.",
      "Student identifies McCarthyism, domestic Communism, or blacklisting but struggles to explain their significance or impact.",
      "Student describes McCarthyism, domestic Communism, and blacklisting and explains their basic impact on American society.",
      "Student explains McCarthyism, domestic Communism, and blacklisting in detail, providing examples and analyzing their impact on American society and politics.",
      "Student analyzes the complex factors that contributed to McCarthyism, domestic Communism, and blacklisting, evaluating their long-term consequences on American society, politics, and culture."
    ],
    [
      "Student demonstrates no understanding of the Truman Doctrine, Korean War, Berlin Blockade, Bay of Pigs invasion, Cuban Missile Crisis, atomic testing, MAD doctrine, disarmament policies, or Latin American policy during the Cold War.",
      "Student demonstrates minimal understanding of the Truman Doctrine, Korean War, Berlin Blockade, Bay of Pigs invasion, Cuban Missile Crisis, atomic testing, MAD doctrine, disarmament policies, or Latin American policy during the Cold War, with significant inaccuracies.",
      "Student identifies some of the key Cold War events and policies but struggles to explain their significance or impact.",
      "Student describes the Truman Doctrine, Korean War, Berlin Blockade, Bay of Pigs invasion, Cuban Missile Crisis, atomic testing, MAD doctrine, disarmament policies, and Latin American policy during the Cold War and explains their basic impact.",
      "Student explains the Truman Doctrine, Korean War, Berlin Blockade, Bay of Pigs invasion, Cuban Missile Crisis, atomic testing, MAD doctrine, disarmament policies, and Latin American policy during the Cold War in detail, providing examples and analyzing their impact.",
      "Student analyzes the complex relationships between the Truman Doctrine, Korean War, Berlin Blockade, Bay of Pigs invasion, Cuban Missile Crisis, atomic testing, MAD doctrine, disarmament policies, and Latin American policy during the Cold War, evaluating their long-term consequences."
    ]
  ]
}