{
  "criteria": [
    "Understanding of Capital Mobility: Demonstrates comprehension of how capital moves across international borders and its impact on the U.S. economy.",
    "Analysis of Labor Mobility: Assesses the effects of the international movement of labor on the U.S. economy.",
    "Explanation of Effects: Clearly articulates the effects of both capital and labor mobility, providing a balanced view."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding shown of capital mobility or its effects on the U.S. economy.",
      "Limited understanding of capital mobility; struggles to connect it to the U.S. economy.",
      "Basic understanding of capital mobility but lacks specific examples of its effects on the U.S. economy.",
      "Adequate understanding of capital mobility and can provide some examples of its effects on the U.S. economy.",
      "Clear understanding of capital mobility with specific examples of its effects (positive and negative) on the U.S. economy.",
      "Comprehensive understanding of capital mobility, including nuanced effects and well-supported examples of its impact on the U.S. economy."
    ],
    [
      "No understanding shown of labor mobility or its effects on the U.S. economy.",
      "Limited understanding of labor mobility; struggles to connect it to the U.S. economy.",
      "Basic understanding of labor mobility but lacks specific examples of its effects on the U.S. economy.",
      "Adequate understanding of labor mobility and can provide some examples of its effects on the U.S. economy, such as wage impacts or sector-specific changes.",
      "Clear understanding of labor mobility with specific examples of its effects (positive and negative) on the U.S. economy, including economic and social impacts.",
      "Comprehensive understanding of labor mobility, including nuanced effects on various sectors and well-supported examples of its broad impact on the U.S. economy, demonstrating a deep understanding of related social and political factors."
    ],
    [
      "Unable to explain any effects of international capital and labor mobility.",
      "Struggles to explain the effects of international capital and labor mobility.",
      "Provides a superficial explanation of the effects, lacking depth and detail.",
      "Adequately explains the effects of international capital and labor mobility but may lack a balanced view.",
      "Clearly explains the effects of international capital and labor mobility, providing a balanced view with supporting evidence.",
      "Articulates the complex effects of international capital and labor mobility with exceptional clarity, providing a nuanced, well-supported, and balanced perspective, integrating various sources and viewpoints."
    ]
  ]
}