{
  "criteria": [
    "Understanding of the Influence of Physical Geography and Climate",
    "Examples of Adaptations Related to Food, Clothing, and Tools",
    "Connection Between Past and Present"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of how physical geography or climate influenced local American Indian nations.",
      "The student demonstrates a minimal understanding of how physical geography or climate influenced local American Indian nations.",
      "The student demonstrates a basic understanding of how either physical geography or climate (but not both) influenced local American Indian nations.",
      "The student demonstrates a satisfactory understanding of how physical geography and climate influenced local American Indian nations, providing some examples.",
      "The student demonstrates a strong understanding of how physical geography and climate influenced local American Indian nations, providing clear and relevant examples.",
      "The student demonstrates a comprehensive understanding of how physical geography and climate influenced local American Indian nations, providing detailed examples and insightful analysis of the adaptations made."
    ],
    [
      "The student provides no examples of how local Indian nations adapted their food, clothing, or tools in response to the environment.",
      "The student provides a vague or inaccurate example of how local Indian nations adapted their food, clothing, or tools in response to the environment.",
      "The student provides one accurate example of how local Indian nations adapted either their food, clothing, or tools in response to the environment.",
      "The student provides two accurate examples of how local Indian nations adapted their food, clothing, or tools in response to the environment.",
      "The student provides accurate examples of how local Indian nations adapted their food, clothing, and tools in response to the environment.",
      "The student provides detailed and insightful examples of how local Indian nations adapted their food, clothing, and tools in response to the environment, demonstrating a nuanced understanding of the relationship between environment and culture."
    ],
    [
      "The student makes no connection between past and present adaptations of local American Indian nations.",
      "The student makes a weak or unclear connection between past and present adaptations of local American Indian nations.",
      "The student mentions that adaptations occurred in the past but does not connect them to the present.",
      "The student briefly mentions how past adaptations relate to the present-day context of local American Indian nations.",
      "The student provides clear examples of how past adaptations continue to influence the present-day practices or challenges faced by local American Indian nations.",
      "The student offers a sophisticated analysis of the enduring impact of historical adaptations on the present-day cultural, economic, or environmental realities of local American Indian nations."
    ]
  ]
}