{
  "criteria": [
    "Understanding of Populist Programs",
    "Analysis of Populist Activities",
    "Connection to Industrialization, Migration, and Immigration"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Populist programs or their goals.",
      "Shows minimal understanding, with significant inaccuracies or gaps in knowledge.",
      "Identifies a few Populist programs but struggles to explain their purpose or impact.",
      "Describes several Populist programs and their intended goals with reasonable accuracy.",
      "Explains Populist programs in detail, analyzing their goals and potential effects.",
      "Provides a comprehensive analysis of Populist programs, including their goals, intended effects, and connections to the social and economic context of the time."
    ],
    [
      "Shows no awareness of Populist activities or their significance.",
      "Mentions Populist activities vaguely with little to no explanation.",
      "Identifies a few Populist activities but struggles to explain their purpose or impact.",
      "Describes several Populist activities and their intended goals with reasonable accuracy.",
      "Explains Populist activities in detail, analyzing their goals and effects.",
      "Provides a comprehensive analysis of Populist activities, including their goals, effects, and connections to the social and political context of the time."
    ],
    [
      "Fails to connect Populist programs and activities to the broader context of industrialization, rural-to-urban migration, and immigration.",
      "Makes a weak or unclear connection between Populism and the overarching standard.",
      "Identifies a connection but does not fully explain the relationship.",
      "Explains how Populist programs and activities were related to industrialization, migration, or immigration.",
      "Analyzes the complex relationship between Populism and the rise of industrialization, migration, and immigration.",
      "Provides a nuanced and insightful analysis of the interconnectedness of Populism, industrialization, migration, and immigration, demonstrating a deep understanding of the historical context."
    ]
  ]
}