{
  "criteria": [
    "Understanding of the Freedmen's Bureau's Role",
    "Knowledge of Restrictions on Freedmen's Rights",
    "Analysis of Lasting Consequences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Freedmen's Bureau or its purpose.",
      "Shows minimal understanding of the Freedmen's Bureau; struggles to explain its purpose.",
      "Identifies the Freedmen's Bureau but provides a limited explanation of its functions and impact.",
      "Adequately explains the Freedmen's Bureau's role in providing assistance to freedmen and its limitations.",
      "Clearly explains the Freedmen's Bureau's multifaceted role, including both its positive contributions and shortcomings.",
      "Provides a comprehensive analysis of the Freedmen's Bureau, its successes, failures, and lasting impact on Reconstruction."
    ],
    [
      "Displays no knowledge of restrictions placed on freedmen's rights during Reconstruction.",
      "Shows limited awareness of restrictions but cannot provide specific examples.",
      "Identifies racial segregation and Jim Crow laws but struggles to explain their effects.",
      "Explains how racial segregation and Jim Crow laws limited the rights and opportunities of freedmen.",
      "Provides detailed examples of restrictions, including specific Jim Crow laws and their impact on daily life.",
      "Analyzes the systematic nature of restrictions, including the legal, social, and economic dimensions of racial segregation and disenfranchisement."
    ],
    [
      "Unable to identify any lasting consequences of Reconstruction-era policies.",
      "Identifies one or two consequences but struggles to explain their significance.",
      "Describes some of the lasting consequences, such as the persistence of racial inequality.",
      "Explains how Reconstruction-era policies continue to affect American society.",
      "Analyzes the complex and multi-layered ways that Reconstruction-era policies have shaped contemporary issues.",
      "Offers a nuanced and insightful perspective on the long-term consequences, including both intended and unintended outcomes."
    ]
  ]
}