{
  "criteria": [
    "Understanding of Settler Economies: Demonstrates comprehension of the types of economies established by settlers in the region.",
    "Influence on Present-Day Economy: Explains how settler economies have influenced the present-day economy of the region.",
    "Importance of Private Property and Entrepreneurship: Analyzes the role and importance of private property and entrepreneurship within the context of settler economies."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding of settler economies is demonstrated.",
      "Demonstrates minimal understanding of settler economies, with significant gaps in knowledge.",
      "Demonstrates basic understanding of settler economies but lacks depth and detail.",
      "Demonstrates satisfactory understanding of settler economies, including some details and examples.",
      "Demonstrates thorough understanding of settler economies, including specific details and relevant examples.",
      "Demonstrates comprehensive understanding of settler economies, offering insightful analysis and nuanced perspectives."
    ],
    [
      "No connection is made between settler economies and the present-day economy.",
      "Demonstrates a weak connection between settler economies and the present-day economy, with limited explanation.",
      "Demonstrates a basic connection between settler economies and the present-day economy, but lacks supporting details.",
      "Demonstrates a satisfactory connection between settler economies and the present-day economy, providing some supporting details.",
      "Demonstrates a strong connection between settler economies and the present-day economy, providing specific and relevant details.",
      "Demonstrates a clear and insightful connection between settler economies and the present-day economy, offering a well-supported analysis."
    ],
    [
      "Fails to address the role or importance of private property and entrepreneurship.",
      "Mentions private property and entrepreneurship but does not explain their role or importance.",
      "Provides a limited explanation of the role and importance of private property and entrepreneurship, with some inaccuracies.",
      "Explains the role and importance of private property and entrepreneurship with satisfactory clarity and accuracy.",
      "Analyzes the role and importance of private property and entrepreneurship with clear examples and relevant connections.",
      "Offers an insightful and comprehensive analysis of the role and importance of private property and entrepreneurship, with nuanced perspectives and well-supported arguments."
    ]
  ]
}