{
  "criteria": [
    "Understanding of Scarcity and Price Relationship",
    "Explanation of the Allocative Function",
    "Use of Economic Vocabulary and Terminology"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of how scarcity influences prices.",
      "Student shows minimal understanding of scarcity and its effect on prices, with significant misconceptions.",
      "Student identifies scarcity and its relation to prices, but struggles to explain the connection clearly.",
      "Student accurately explains how scarcity affects prices, providing a basic explanation of the concept.",
      "Student thoroughly explains the relationship between scarcity and prices, providing examples to support their explanation.",
      "Student provides a comprehensive and insightful analysis of how scarcity and prices interact, demonstrating a deep understanding of the underlying economic principles. They can also predict how changes in scarcity would affect prices."
    ],
    [
      "Student does not understand or attempt to explain the allocative function of prices.",
      "Student attempts to explain the allocative function but demonstrates confusion or misunderstanding of the concept.",
      "Student identifies the allocative function of prices but struggles to explain how it works in a market economy.",
      "Student explains how prices allocate resources in a market economy but lacks detail or examples.",
      "Student clearly explains the allocative function of prices and provides relevant examples of how it operates.",
      "Student provides a sophisticated and nuanced explanation of the allocative function of prices, including its impact on efficiency and consumer welfare. They can explain how market distortions can affect the allocative function of prices."
    ],
    [
      "Student does not use any relevant economic vocabulary or terminology.",
      "Student uses very limited economic vocabulary, with frequent misuse of terms.",
      "Student uses some economic vocabulary, but demonstrates inconsistent understanding and application.",
      "Student uses appropriate economic vocabulary and terminology to explain concepts effectively.",
      "Student demonstrates command of economic vocabulary and terminology, using it precisely and effectively.",
      "Student uses sophisticated economic vocabulary and terminology, demonstrating mastery of the subject matter. They can use the terminology to explain complex and abstract concepts."
    ]
  ]
}