{
  "criteria": [
    "Understanding of the French Revolution's Ideological Origins",
    "Explanation of the Transition from Constitutional Monarchy to Democratic Despotism",
    "Analysis of the Rise of the Napoleonic Empire",
    "Understanding of Key Figures and Events"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the ideological origins (Enlightenment ideas, social inequalities) of the French Revolution.",
      "Shows a limited understanding of the ideological factors that contributed to the French Revolution.",
      "Identifies some of the ideological origins of the French Revolution but struggles to explain their significance.",
      "Explains the main ideological origins of the French Revolution (e.g., Enlightenment ideals, social class tensions) with some clarity.",
      "Clearly explains the significant ideological origins of the French Revolution and how they fueled the initial stages of the revolution.",
      "Provides a comprehensive and nuanced explanation of the various ideological origins of the French Revolution, including the influence of Enlightenment thinkers, social inequalities, and calls for reform."
    ],
    [
      "Unable to describe the transition of France from a constitutional monarchy to democratic despotism.",
      "Offers a vague or inaccurate description of the shift from constitutional monarchy to democratic despotism.",
      "Describes the transition with some inaccuracies or missing key details.",
      "Explains the basic steps in the transition, including the rise of radical factions and the Reign of Terror.",
      "Provides a clear explanation of the key events and factors that led to the transition from constitutional monarchy to democratic despotism, such as the radicalization of the revolution and the rise of Robespierre.",
      "Offers a detailed analysis of the transition, including the complex interplay of political factions, the impact of revolutionary fervor, and the role of key figures in the shift towards democratic despotism."
    ],
    [
      "Demonstrates no understanding of how the French Revolution led to the rise of the Napoleonic Empire.",
      "Shows a limited awareness of Napoleon's rise to power but struggles to connect it to the French Revolution.",
      "Identifies Napoleon as a key figure but fails to explain how the revolution paved the way for his empire.",
      "Explains how the instability and chaos of the French Revolution created an opportunity for Napoleon to seize power.",
      "Analyzes how the French Revolution's emphasis on military expansion and national glory, combined with the failure of the Directory, led to the rise of the Napoleonic Empire.",
      "Provides a comprehensive analysis of the complex factors that contributed to the rise of the Napoleonic Empire, including the legacy of the French Revolution, Napoleon's military genius, and the political and social conditions of the time."
    ],
    [
      "Unable to identify any key figures or events related to the French Revolution.",
      "Identifies only a few key figures or events with limited accuracy.",
      "Identifies several key figures or events but struggles to explain their significance.",
      "Demonstrates a general understanding of key figures (e.g., Robespierre, Louis XVI, Napoleon) and events (e.g., Reign of Terror, the Directory) with some inaccuracies.",
      "Accurately describes key figures and events and explains their roles in the progression of the French Revolution.",
      "Provides a detailed and nuanced analysis of the key figures and events, including their motivations, actions, and impact on the course of the French Revolution."
    ]
  ]
}