{
  "criteria": [
    "Understanding of Nationalism's Spread Under Napoleon",
    "Knowledge of the Congress of Vienna and Concert of Europe's Repression",
    "Understanding of the Revolutions of 1848"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of nationalism or Napoleon's role in spreading it.",
      "Shows a limited understanding of nationalism and Napoleon's impact, with significant inaccuracies.",
      "Identifies nationalism and Napoleon's role but lacks depth in explaining the connection.",
      "Explains how nationalism spread under Napoleon with some supporting details.",
      "Clearly explains how nationalism spread across Europe due to Napoleon's actions, providing relevant examples.",
      "Provides a comprehensive explanation of the spread of nationalism under Napoleon, including specific examples and analysis of its impact."
    ],
    [
      "Shows no understanding of the Congress of Vienna or the Concert of Europe.",
      "Displays minimal knowledge of the Congress of Vienna and Concert of Europe, with several inaccuracies.",
      "Identifies the Congress of Vienna and Concert of Europe but struggles to explain their purpose and impact.",
      "Explains how the Congress of Vienna and Concert of Europe repressed nationalism with some supporting details.",
      "Clearly explains the role of the Congress of Vienna and Concert of Europe in repressing nationalism, providing relevant examples.",
      "Provides a detailed analysis of the Congress of Vienna and Concert of Europe's efforts to repress nationalism, including specific examples and the consequences of their actions."
    ],
    [
      "Demonstrates no understanding of the Revolutions of 1848.",
      "Shows limited knowledge of the Revolutions of 1848, with significant inaccuracies.",
      "Identifies the Revolutions of 1848 but struggles to connect them to the preceding repression of nationalism.",
      "Explains the Revolutions of 1848 and their connection to the repression of nationalism, with some supporting details.",
      "Clearly explains the Revolutions of 1848 as a consequence of the repression of nationalism, providing relevant examples.",
      "Provides a comprehensive analysis of the Revolutions of 1848, including their causes, key events, and long-term effects in relation to the preceding repression of nationalism."
    ]
  ]
}