{
  "criteria": [
    "Understanding of Constantine's motivations for establishing Constantinople",
    "Knowledge of the Byzantine Empire's development",
    "Explanation of the divergence between Eastern Orthodox and Roman Catholic civilizations",
    "Understanding of the distinct views on church-state relations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Constantine's reasons for moving the capital.",
      "Offers a vague or inaccurate reason for the establishment of Constantinople.",
      "Identifies a reason for the move but lacks supporting details or context.",
      "Explains Constantine's strategic, political, or economic motivations for establishing Constantinople.",
      "Analyzes multiple motivations behind Constantine's decision, providing historical context.",
      "Provides a comprehensive analysis of Constantine's motivations, including nuanced perspectives and historical evidence."
    ],
    [
      "Shows no understanding of the Byzantine Empire's origins or characteristics.",
      "Displays limited knowledge of the Byzantine Empire, with significant inaccuracies.",
      "Identifies the Byzantine Empire as a continuation of the Roman Empire but lacks details.",
      "Describes key aspects of the Byzantine Empire, such as its culture, government, or religion.",
      "Explains the Byzantine Empire's unique features and its relationship to the Roman Empire.",
      "Presents a detailed and insightful account of the Byzantine Empire's development, highlighting its cultural and political significance."
    ],
    [
      "Fails to recognize any differences between Eastern Orthodox and Roman Catholic civilizations.",
      "Offers a superficial or inaccurate account of the differences between the two civilizations.",
      "Identifies a few key differences but lacks detailed explanation.",
      "Explains the main differences between Eastern Orthodox and Roman Catholic civilizations, such as religious practices or beliefs.",
      "Analyzes the factors that led to the divergence between the two civilizations, including theological and political factors.",
      "Provides a comprehensive and nuanced analysis of the historical, theological, and political factors that shaped the distinct identities of Eastern Orthodox and Roman Catholic civilizations."
    ],
    [
      "Shows no understanding of the different approaches to church-state relations in the two civilizations.",
      "Offers a vague or inaccurate description of the relationship between church and state.",
      "Identifies the existence of different views on church-state relations but lacks explanation.",
      "Explains the key differences in how Eastern Orthodox and Roman Catholic civilizations viewed the relationship between church and state.",
      "Analyzes the consequences of these different views on the political and social structures of the two civilizations.",
      "Presents a detailed and insightful analysis of the complex interplay between church and state in Eastern Orthodox and Roman Catholic civilizations, including consideration of the long-term consequences."
    ]
  ]
}