{
  "criteria": [
    "Understanding of Progressive Political Programs: Demonstrates comprehension of specific political programs and activities undertaken by the Progressives.",
    "Knowledge of Key Progressive Figures: Demonstrates knowledge of individuals central to the Progressive movement and their contributions.",
    "Analysis of Effects: Analyzes the effects of Progressive policies on society, economy, and government."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of Progressive political programs or activities.",
      "Identifies one or two Progressive programs\/activities with limited accuracy.",
      "Identifies a few Progressive programs\/activities but struggles to explain their purpose or impact.",
      "Identifies several Progressive programs\/activities and provides a basic explanation of their purpose.",
      "Clearly explains multiple Progressive programs\/activities and analyzes their intended impact.",
      "Provides a comprehensive analysis of various Progressive programs\/activities, evaluating their effectiveness and long-term consequences."
    ],
    [
      "Shows no awareness of key figures associated with the Progressive movement.",
      "Names one or two Progressive figures with little to no information about their roles.",
      "Identifies a few Progressive figures but struggles to explain their contributions or significance.",
      "Identifies several Progressive figures and provides a basic overview of their roles in the movement.",
      "Clearly explains the roles and contributions of multiple Progressive figures.",
      "Provides a comprehensive analysis of several Progressive figures, evaluating their impact on the movement and American society."
    ],
    [
      "Does not address the effects of Progressive policies.",
      "Mentions one or two effects of Progressive policies with limited accuracy.",
      "Identifies a few effects but struggles to explain their significance or connection to Progressive policies.",
      "Identifies several effects and provides a basic explanation of how they relate to Progressive policies.",
      "Clearly explains multiple effects of Progressive policies and analyzes their impact on different aspects of society.",
      "Provides a comprehensive analysis of the diverse effects of Progressive policies, evaluating their long-term consequences and unintended outcomes."
    ]
  ]
}