{
  "criteria": [
    "Understanding of Overland Trade Routes (Silk Road)",
    "Understanding of Maritime Expeditions",
    "Connection Between Trade and Civilization Development"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of overland trade routes or the Silk Road.",
      "Shows minimal understanding of overland trade routes; struggles to identify its significance.",
      "Identifies the Silk Road but provides limited information about its role in trade during the Mongol Ascendancy and Ming Dynasty.",
      "Describes the Silk Road and its basic function in facilitating trade between China and other civilizations.",
      "Explains the importance of the Silk Road in connecting China with other civilizations during the Mongol and Ming periods, including goods exchanged and cultural impact.",
      "Provides a comprehensive analysis of the Silk Road, including its impact on the economies and cultures of China and other civilizations, and discusses challenges and innovations in overland trade."
    ],
    [
      "Demonstrates no understanding of maritime expeditions.",
      "Shows minimal awareness of Chinese maritime activities during the period.",
      "Identifies Zheng He's voyages but provides limited details about their purpose or impact.",
      "Describes Zheng He's voyages and their basic function in expanding Chinese influence and trade.",
      "Explains the importance of maritime expeditions led by Zheng He in expanding China's trade, diplomacy, and knowledge of the world.",
      "Provides a comprehensive analysis of Zheng He's voyages, including their technological achievements, economic consequences, political motivations, and reasons for their eventual cessation."
    ],
    [
      "Fails to connect trade with the development of Chinese civilization during the Mongol Ascendancy and Ming Dynasty.",
      "Shows a weak understanding of how trade influenced Chinese civilization.",
      "Makes a basic connection between trade and civilization but lacks specific examples.",
      "Describes how trade contributed to the economy, culture, or politics of China during the period.",
      "Explains how both overland and maritime trade routes influenced the economic, cultural, and political development of China during the Mongol and Ming periods.",
      "Analyzes the complex interplay between trade, cultural exchange, technological innovation, and political power in shaping Chinese civilization during the Mongol Ascendancy and Ming Dynasty, including comparisons to other civilizations."
    ]
  ]
}