{
  "criteria": [
    "Understanding of the Truman Doctrine and Marshall Plan",
    "Application of Knowledge to Containment Policy",
    "Knowledge of Resulting Economic and Political Competition"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the Truman Doctrine or the Marshall Plan.",
      "Student demonstrates a very limited understanding of either the Truman Doctrine or the Marshall Plan, with significant inaccuracies.",
      "Student demonstrates a basic understanding of either the Truman Doctrine or the Marshall Plan, but struggles to explain the purpose or significance.",
      "Student demonstrates a satisfactory understanding of both the Truman Doctrine and the Marshall Plan, explaining their basic purpose.",
      "Student demonstrates a strong understanding of the Truman Doctrine and the Marshall Plan, explaining their purpose, key components, and initial impact.",
      "Student demonstrates a comprehensive understanding of the Truman Doctrine and the Marshall Plan, explaining their purpose, key components, and impact on postwar policy."
    ],
    [
      "Student cannot connect the Truman Doctrine or Marshall Plan to the broader policy of containment.",
      "Student vaguely connects the Truman Doctrine or Marshall Plan to containment but lacks specific details or accurate explanations.",
      "Student identifies the Truman Doctrine and Marshall Plan as related to containment but struggles to articulate how they supported this policy.",
      "Student explains how the Truman Doctrine and Marshall Plan supported the policy of containment by providing economic and military aid.",
      "Student thoroughly explains how the Truman Doctrine and Marshall Plan strategically supported the policy of containment and prevented the spread of Communism.",
      "Student provides a nuanced explanation of how the Truman Doctrine and Marshall Plan acted as cornerstones of the containment policy, impacting various global arenas."
    ],
    [
      "Student demonstrates no awareness of any resulting economic or political competition in Southeast Asia, Cuba, or Africa.",
      "Student vaguely mentions one or more arenas (Southeast Asia, Cuba, Africa) but provides no context or accurate information.",
      "Student identifies one or more arenas (Southeast Asia, Cuba, Africa) but struggles to connect them to the Truman Doctrine, Marshall Plan, or the spread of Communism.",
      "Student connects the Truman Doctrine and Marshall Plan to instances of economic or political competition in one or more of the mentioned arenas.",
      "Student accurately explains how the Truman Doctrine and Marshall Plan influenced economic and political competition in multiple arenas (Southeast Asia, Cuba, and Africa).",
      "Student offers a detailed analysis of the economic and political competition in Southeast Asia, Cuba, and Africa, directly linking these events to the Truman Doctrine, Marshall Plan, and the broader Cold War context."
    ]
  ]
}