{
  "criteria": [
    "Understanding of the causes of the Cold War.",
    "Knowledge of the opposing sides and their ideologies.",
    "Awareness of competition for influence in specific regions.",
    "Ability to connect the Cold War to specific events and situations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the causes of the Cold War.",
      "Student identifies one or two causes of the Cold War with limited explanation.",
      "Student identifies several causes of the Cold War with some explanation, but lacks depth.",
      "Student identifies and explains several key causes of the Cold War, showing a basic understanding of the context.",
      "Student thoroughly explains the key causes of the Cold War, demonstrating a strong understanding of the historical context and ideological differences.",
      "Student provides a comprehensive and nuanced analysis of the causes of the Cold War, including long-term and short-term factors, and demonstrates a sophisticated understanding of the underlying historical and ideological complexities."
    ],
    [
      "Student does not identify the opposing sides of the Cold War.",
      "Student identifies the opposing sides (free world vs. Soviet client states) but lacks understanding of their ideologies.",
      "Student identifies the opposing sides and offers a limited description of their ideologies.",
      "Student describes the opposing sides and their ideologies (democracy\/capitalism vs. communism) with some accuracy.",
      "Student accurately describes the opposing sides and their core ideologies, including key differences and principles.",
      "Student provides a comprehensive analysis of the opposing sides and their ideologies, including internal variations and complexities within each bloc."
    ],
    [
      "Student does not mention any regions where the Cold War competition took place.",
      "Student mentions one region (e.g., Egypt, the Congo, Vietnam, or Chile) with no further explanation.",
      "Student mentions a few regions, but does not explain the competition for influence in those areas.",
      "Student identifies several regions and provides a basic description of the competition for influence in at least one of them.",
      "Student describes the competition for influence in several regions, providing specific examples and details.",
      "Student offers a detailed analysis of the competition for influence in multiple regions, explaining the motivations, strategies, and outcomes of the competing sides."
    ],
    [
      "Student is unable to connect the Cold War to specific historical events.",
      "Student makes vague connections between the Cold War and specific events, without providing detail.",
      "Student identifies a few events related to the Cold War, with minimal explanation of their significance.",
      "Student connects the Cold War to specific events (e.g., proxy wars, political interventions) and explains their general significance.",
      "Student effectively connects the Cold War to specific events, providing detailed explanations of their causes, consequences, and relevance.",
      "Student demonstrates a nuanced understanding of how the Cold War shaped specific events and situations, considering multiple perspectives and long-term impacts."
    ]
  ]
}