{
  "criteria": [
    "Understanding of the First Great Awakening's Significance",
    "Identification of Key Leaders",
    "Connection to Religious Toleration and Free Exercise of Religion"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the First Great Awakening or its impact.",
      "Shows a minimal understanding, with significant misconceptions or omissions.",
      "Identifies the First Great Awakening but struggles to explain its significance or impact on colonial society.",
      "Explains the First Great Awakening as a religious revival but provides limited detail on its broader significance (religious ideas, practices, and allegiances).",
      "Clearly explains the First Great Awakening's impact on religious ideas, practices, and allegiances in the colonial period, and the growth of religious toleration.",
      "Provides a comprehensive explanation of the First Great Awakening's impact, including specific examples of shifts in religious ideas, practices, and allegiances, its contribution to religious toleration, and the concept of free exercise of religion.  Demonstrates insightful analysis."
    ],
    [
      "Unable to identify any leaders associated with the First Great Awakening.",
      "Incorrectly identifies leaders or identifies only one leader.",
      "Identifies one or two leaders but cannot explain their role in the First Great Awakening.",
      "Identifies two or three leaders of the First Great Awakening and briefly describes their roles.",
      "Identifies several key leaders (e.g., Jonathan Edwards, George Whitefield) and accurately explains their contributions to the First Great Awakening.",
      "Identifies key leaders, thoroughly explains their contributions, and connects their actions to the broader impact of the First Great Awakening. May discuss the different styles and approaches of different leaders."
    ],
    [
      "Does not connect the First Great Awakening to religious toleration or free exercise of religion.",
      "Mentions religious toleration or free exercise of religion but does not explain its connection to the First Great Awakening.",
      "Attempts to connect the First Great Awakening to religious toleration or free exercise of religion, but explanation is unclear or inaccurate.",
      "Explains that the First Great Awakening contributed to religious toleration and\/or the idea of free exercise of religion but lacks detail.",
      "Clearly explains how the First Great Awakening contributed to the growth of religious toleration and\/or the increasing acceptance of free exercise of religion in the colonies.",
      "Provides a nuanced explanation of the complex relationship between the First Great Awakening and the development of religious toleration and free exercise of religion. May discuss dissenting voices or counter-arguments."
    ]
  ]
}