{
  "criteria": [
    "Understanding of the demise of the slave trade and its causes and consequences.",
    "Analysis of the effects of immigration on the labor force during the Industrial Revolution.",
    "Explanation of the impact of mining and manufacturing on the nature of work.",
    "Understanding of the division of labor and its consequences.",
    "Analysis of the rise of the union movement and its goals."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the slave trade or its demise.",
      "Demonstrates a minimal understanding of the slave trade and its demise, with significant inaccuracies or omissions.",
      "Demonstrates a basic understanding of the slave trade and its demise, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the slave trade, including its key causes and consequences.",
      "Demonstrates a strong understanding of the slave trade, its causes, consequences, and global impact.",
      "Demonstrates a comprehensive and nuanced understanding of the slave trade, including its complex causes, consequences, and long-term global impact. Provides insightful analysis."
    ],
    [
      "Does not address the effects of immigration on the labor force.",
      "Mentions immigration but fails to connect it to the labor force or the Industrial Revolution.",
      "Identifies immigration as a factor but provides little analysis of its specific effects on the labor force.",
      "Analyzes some of the effects of immigration on the labor force, such as increased competition or the availability of cheap labor.",
      "Provides a detailed analysis of the effects of immigration on the labor force, including both positive and negative consequences. Explains how immigration shaped the labor landscape.",
      "Offers a sophisticated analysis of the complex interplay between immigration, labor, and the Industrial Revolution. Explores diverse perspectives and draws insightful conclusions."
    ],
    [
      "Does not discuss the impact of mining and manufacturing on work.",
      "Mentions mining and manufacturing but does not connect them to changes in the nature of work.",
      "Describes mining and manufacturing but lacks analysis of their specific effects on work conditions and labor practices.",
      "Explains how mining and manufacturing altered the nature of work, such as through increased mechanization or the rise of factory labor.",
      "Provides a detailed explanation of the transformative impact of mining and manufacturing on work, including changes in skill requirements, work environments, and social structures.",
      "Presents a comprehensive and insightful analysis of the profound changes in the nature of work brought about by mining and manufacturing. Explores the social, economic, and environmental consequences."
    ],
    [
      "Demonstrates no understanding of the division of labor.",
      "Provides a vague or inaccurate definition of the division of labor.",
      "Describes the division of labor but does not analyze its consequences.",
      "Explains the basic concept of the division of labor and identifies some of its consequences, such as increased efficiency or deskilling.",
      "Analyzes the multifaceted consequences of the division of labor, including its impact on productivity, worker autonomy, and social inequality.",
      "Offers a nuanced and critical analysis of the division of labor, exploring its historical roots, its social and economic implications, and its potential for both progress and exploitation."
    ],
    [
      "Does not address the union movement.",
      "Mentions the union movement but provides no information about its origins or goals.",
      "Identifies the union movement as a response to industrialization but lacks specific details about its objectives.",
      "Explains the rise of the union movement and describes some of its key goals, such as better wages, safer working conditions, and collective bargaining.",
      "Analyzes the complex factors that led to the rise of the union movement and examines its diverse goals and strategies. Discusses the challenges and successes of organized labor.",
      "Provides a comprehensive and insightful analysis of the union movement, exploring its historical context, its social and political significance, and its enduring legacy in the struggle for worker rights and social justice."
    ]
  ]
}