{
  "criteria": [
    "Identification of Religious Groups and their Contributions",
    "Understanding of Civic Principles and Social Reform Movements",
    "Clarity and Coherence of Explanation"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any religious groups or their contributions to American civic principles and social reform movements.",
      "The student identifies one religious group but struggles to accurately describe its contributions or provides a superficial understanding.",
      "The student identifies two religious groups and provides a basic description of their contributions, but lacks depth or specific examples.",
      "The student identifies three religious groups and accurately describes their contributions to American civic principles and social reform movements with some supporting details.",
      "The student identifies four or more religious groups and thoroughly describes their contributions with specific examples and demonstrates a clear understanding of their impact.",
      "The student identifies multiple religious groups, thoroughly analyzes their diverse contributions, and provides insightful connections to their lasting impact on American society and civic principles."
    ],
    [
      "The student demonstrates no understanding of American civic principles or social reform movements.",
      "The student demonstrates a limited understanding of either American civic principles or social reform movements, with significant inaccuracies.",
      "The student demonstrates a basic understanding of American civic principles and social reform movements, but struggles to connect them to religious contributions.",
      "The student demonstrates a solid understanding of American civic principles and social reform movements and makes some connections to the roles of religious groups.",
      "The student demonstrates a strong understanding of American civic principles and social reform movements and clearly articulates the connection to religious contributions.",
      "The student demonstrates a sophisticated understanding of American civic principles and social reform movements and provides insightful analysis of the complex relationships with religious contributions, including nuanced perspectives."
    ],
    [
      "The explanation is unclear, disorganized, and difficult to understand.",
      "The explanation lacks clarity and coherence, making it difficult to follow the student's reasoning.",
      "The explanation is generally understandable but lacks specific details and organization.",
      "The explanation is clear and organized with supporting details, but some areas could be more concise.",
      "The explanation is exceptionally clear, coherent, and well-organized, providing a thorough and insightful analysis.",
      "The explanation is exceptionally clear, coherent, and insightful, demonstrating a mastery of the content and advanced communication skills."
    ]
  ]
}