{
  "criteria": [
    "Understanding of the Causes and Motivations Behind Domestic Resistance Movements",
    "Knowledge of the Central Government's Response to Domestic Resistance",
    "Significance of Domestic Resistance Movements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes or motivations behind domestic resistance movements like Shays' Rebellion or the Whiskey Rebellion.",
      "Shows a very limited understanding, with significant inaccuracies or omissions regarding the causes and motivations.",
      "Displays a basic understanding, but lacks depth and may have some minor inaccuracies in explaining the causes and motivations.",
      "Exhibits a satisfactory understanding of the primary causes and motivations, providing a general overview of the events.",
      "Demonstrates a strong understanding, clearly explaining the various factors that led to the resistance movements and the goals of the participants.",
      "Shows a comprehensive and nuanced understanding, analyzing the complex interplay of factors that fueled the resistance, including social, economic, and political grievances."
    ],
    [
      "Shows no knowledge of how the central government responded to domestic resistance movements.",
      "Displays very limited knowledge, with major inaccuracies or omissions regarding the government's response.",
      "Demonstrates a basic understanding of the government's response but lacks specific details and may have some inaccuracies.",
      "Exhibits a satisfactory understanding of the general actions taken by the central government to address the rebellions.",
      "Clearly explains the specific actions taken by the central government, including the use of force, policy changes, or negotiations, and their immediate outcomes.",
      "Analyzes the long-term consequences and significance of the government's response, including its impact on the balance of power, federal authority, and future policies."
    ],
    [
      "Unable to articulate the significance of domestic resistance movements.",
      "Struggles to explain the significance, with vague or inaccurate statements.",
      "Identifies the significance of domestic resistance movements, but lacks depth and may have some minor inaccuracies.",
      "Explains the significance of domestic resistance movements.",
      "Analyzes the short term and long term effects of domestic resistance movements.",
      "Evaluates multiple perspectives when analyzing the effects and the significance of domestic resistance movements"
    ]
  ]
}