{
  "criteria": [
    "Understanding of the geographic expansion of Muslim rule",
    "Knowledge of military conquests and treaties",
    "Explanation of cultural blending within Muslim civilization",
    "Understanding of the spread and acceptance of Islam and the Arabic language"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the geographic regions affected by the expansion of Muslim rule.",
      "Identifies one or two regions impacted by Muslim expansion with limited accuracy.",
      "Identifies several regions impacted by Muslim expansion but lacks detail or accuracy in describing the extent of the expansion.",
      "Accurately identifies and describes the major geographic regions influenced by Muslim expansion, including key cities and territories.",
      "Provides a detailed and accurate account of the geographic expansion, including the timelines and the factors that influenced expansion in different regions.",
      "Offers a comprehensive and insightful analysis of the geographic expansion of Muslim rule, including a discussion of its long-term impact on regional demographics and cultural landscapes."
    ],
    [
      "Shows no awareness of the methods of expansion used by Muslim rulers.",
      "Mentions either military conquests or treaties but provides no specifics or examples.",
      "Lists a few military conquests or treaties but lacks depth in explaining their significance or outcomes.",
      "Describes several key military conquests and treaties, explaining their immediate impact on the expansion of Muslim rule.",
      "Analyzes the effectiveness of different strategies (military vs. diplomatic) in expanding Muslim rule, providing specific historical examples.",
      "Evaluates the long-term consequences of military conquests and treaties on the political and cultural landscape of the regions involved."
    ],
    [
      "Does not recognize or mention any instances of cultural blending.",
      "Acknowledges cultural blending in passing but offers no specific examples.",
      "Provides one or two superficial examples of cultural blending without explaining their significance.",
      "Describes several instances of cultural blending within Muslim civilization, such as advancements in science, mathematics, and art.",
      "Analyzes the causes and consequences of cultural blending, including the role of cross-cultural exchange and the preservation of knowledge.",
      "Offers a nuanced perspective on the complexities of cultural blending, addressing both its positive contributions and potential tensions or conflicts."
    ],
    [
      "Displays no comprehension of how Islam and the Arabic language spread.",
      "States that Islam and Arabic spread without providing any supporting details.",
      "Lists a few factors that contributed to the spread of Islam and Arabic but lacks depth or accuracy.",
      "Explains several factors that facilitated the spread and acceptance of Islam and Arabic, such as trade, scholarship, and religious tolerance.",
      "Analyzes the reasons for the widespread acceptance of Islam and Arabic, including their appeal to diverse populations and their compatibility with local customs.",
      "Evaluates the long-term impact of the spread of Islam and Arabic on the cultural, social, and political landscape of the regions involved."
    ]
  ]
}