{
  "criteria": [
    "Understanding of the Golden Age of cooperation between Jews and Muslims in medieval Spain",
    "Knowledge of the promotion of creativity in art, literature, and science during the Golden Age",
    "Understanding of the termination of cooperation due to religious persecution"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the Golden Age of cooperation between Jews and Muslims in medieval Spain.",
      "Student demonstrates a minimal understanding of the Golden Age, with significant misconceptions.",
      "Student demonstrates a basic understanding of the Golden Age, but lacks depth and detail.",
      "Student demonstrates a satisfactory understanding of the Golden Age, including its key characteristics.",
      "Student demonstrates a strong understanding of the Golden Age, including its cultural and intellectual achievements.",
      "Student demonstrates a comprehensive understanding of the Golden Age, including its nuances and complexities."
    ],
    [
      "Student shows no awareness of how the Golden Age promoted creativity in art, literature, and science.",
      "Student mentions art, literature, or science vaguely, but does not connect it to the Golden Age.",
      "Student identifies one area (art, literature, or science) where creativity was promoted, but lacks specific examples.",
      "Student identifies multiple areas (art, literature, and\/or science) and provides some specific examples of creativity.",
      "Student provides detailed examples of creativity in art, literature, and science, explaining their significance.",
      "Student analyzes the factors that contributed to the promotion of creativity in art, literature, and science during the Golden Age, demonstrating a deep understanding of the period's intellectual environment."
    ],
    [
      "Student does not understand the connection between the end of the Golden Age and religious persecution.",
      "Student mentions religious persecution but does not connect it to the termination of cooperation between Jews and Muslims.",
      "Student identifies the Spanish Inquisition or the expulsion of Jews and Muslims but provides limited context.",
      "Student describes the Spanish Inquisition and\/or the expulsion of Jews and Muslims and explains how these events ended the Golden Age.",
      "Student analyzes the causes and consequences of the religious persecution, demonstrating an understanding of its impact on the social and cultural landscape of Spain.",
      "Student evaluates the long-term effects of the religious persecution on Spanish society and its relationship with Jewish and Muslim communities, drawing connections to contemporary issues of religious tolerance and intolerance."
    ]
  ]
}