{
  "criteria": [
    "Understanding the Growth of Cities",
    "Knowledge of Trade Routes and Networks",
    "Understanding of Products and Inventions",
    "Role of Merchants in Arab Society"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the growth of cities in the Islamic world during the Middle Ages.",
      "Student demonstrates a minimal understanding of the growth of cities, mentioning only one or two factors without detail.",
      "Student identifies some factors contributing to the growth of cities, but lacks depth in explanation.",
      "Student adequately explains the key factors contributing to urban growth, such as trade, administration, or cultural significance.",
      "Student thoroughly explains the key factors that led to the growth of cities, providing specific examples and demonstrating a strong understanding.",
      "Student provides a comprehensive analysis of the factors contributing to the growth of cities, including nuanced details and insightful connections to broader historical trends."
    ],
    [
      "Student is unable to identify any trade routes or networks established during the period.",
      "Student identifies one or two trade routes with limited accuracy.",
      "Student identifies several trade routes but provides little detail about their significance or connectivity.",
      "Student accurately describes the major trade routes connecting Asia, Africa, and Europe, including key cities and regions.",
      "Student provides a detailed account of the trade routes, including their geographic span, major hubs, and the mechanisms that facilitated trade.",
      "Student offers a sophisticated analysis of the trade routes, discussing their impact on cultural exchange, economic development, and geopolitical dynamics."
    ],
    [
      "Student does not mention any products or inventions that traveled along the trade routes.",
      "Student mentions one or two products or inventions but lacks accuracy or context.",
      "Student identifies several products and inventions but does not explain their significance or origin.",
      "Student accurately describes several key products and inventions (e.g., spices, textiles, paper, steel, new crops) and their origins\/destinations.",
      "Student provides a comprehensive overview of the products and inventions traded, explaining their impact on societies and economies.",
      "Student provides a nuanced analysis of how the exchange of products and inventions transformed societies, shaped consumer habits, and spurred innovation."
    ],
    [
      "Student demonstrates no understanding of the role of merchants.",
      "Student makes a vague reference to the role of merchants with little supporting detail.",
      "Student identifies some aspects of the role of merchants, but lacks depth or accuracy.",
      "Student accurately describes the role of merchants in facilitating trade, accumulating wealth, and influencing society.",
      "Student provides a detailed explanation of the social, economic, and political influence of merchants in Arab society.",
      "Student provides a sophisticated analysis of the complex roles merchants played, including their impact on cultural exchange, social mobility, and political power structures."
    ]
  ]
}