{
  "criteria": [
    "Identification of Original Aims of Reconstruction",
    "Description of Effects on Political Structures",
    "Description of Effects on Social Structures",
    "Regional Differentiation"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the original aims of Reconstruction.",
      "Student vaguely mentions Reconstruction but does not accurately identify any original aims.",
      "Student identifies one original aim of Reconstruction with limited accuracy.",
      "Student identifies two original aims of Reconstruction with reasonable accuracy.",
      "Student identifies three original aims of Reconstruction accurately.",
      "Student comprehensively identifies and accurately explains multiple original aims of Reconstruction, demonstrating a strong understanding of their historical context."
    ],
    [
      "Student provides no description of the effects of Reconstruction on political structures.",
      "Student makes vague references to political changes during Reconstruction but lacks specific details.",
      "Student describes one effect on political structures with limited accuracy.",
      "Student describes two effects on political structures with reasonable accuracy.",
      "Student describes multiple effects on political structures with accuracy, including examples.",
      "Student provides a comprehensive and nuanced description of the effects of Reconstruction on political structures across different regions, demonstrating strong analytical skills."
    ],
    [
      "Student provides no description of the effects of Reconstruction on social structures.",
      "Student makes vague references to social changes during Reconstruction but lacks specific details.",
      "Student describes one effect on social structures with limited accuracy.",
      "Student describes two effects on social structures with reasonable accuracy.",
      "Student describes multiple effects on social structures with accuracy, including examples.",
      "Student provides a comprehensive and nuanced description of the effects of Reconstruction on social structures across different regions, demonstrating strong analytical skills."
    ],
    [
      "Student does not differentiate the effects of Reconstruction across different regions.",
      "Student attempts to differentiate the effects but lacks specific details or accuracy.",
      "Student identifies one regional difference in the effects of Reconstruction.",
      "Student identifies two regional differences in the effects of Reconstruction.",
      "Student describes multiple regional differences in the effects of Reconstruction with supporting details.",
      "Student provides a comprehensive analysis of the varying effects of Reconstruction across different regions, demonstrating a sophisticated understanding of regional complexities."
    ]
  ]
}