{
  "criteria": [
    "Understanding of the Reasons for Rules, Laws, and the U.S. Constitution",
    "Role of Citizenship in Promoting Rules and Laws",
    "Consequences for Violating Rules and Laws"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the reasons for rules, laws, or the U.S. Constitution.",
      "Demonstrates a very limited understanding of the reasons for rules, laws, or the U.S. Constitution.",
      "Demonstrates a basic understanding of the reasons for rules, laws, and the U.S. Constitution, but with some inaccuracies or gaps.",
      "Demonstrates a satisfactory understanding of the reasons for rules, laws, and the U.S. Constitution.",
      "Demonstrates a strong understanding of the reasons for rules, laws, and the U.S. Constitution, providing clear explanations.",
      "Demonstrates a comprehensive and nuanced understanding of the reasons for rules, laws, and the U.S. Constitution, including historical context and philosophical underpinnings."
    ],
    [
      "Shows no awareness of the role of citizenship in promoting rules and laws.",
      "Shows a very limited awareness of the role of citizenship in promoting rules and laws.",
      "Shows a basic understanding of the role of citizenship, but struggles to connect it to the promotion of rules and laws.",
      "Explains the role of citizenship in promoting rules and laws with some examples.",
      "Clearly explains the role of citizenship in promoting rules and laws, providing specific examples of civic engagement.",
      "Demonstrates a sophisticated understanding of the multifaceted role of citizenship in promoting rules and laws, including analysis of civic responsibilities and rights."
    ],
    [
      "Unable to identify any consequences for violating rules and laws.",
      "Identifies very few consequences for violating rules and laws.",
      "Identifies some consequences for violating rules and laws, but with limited detail or accuracy.",
      "Describes common consequences for violating rules and laws.",
      "Clearly explains a range of consequences for violating rules and laws, including legal and social repercussions.",
      "Provides a thorough and insightful analysis of the consequences for violating rules and laws, including discussions of the justice system and ethical considerations."
    ]
  ]
}