{
  "criteria": [
    "Understanding of Expansionist Policies: Assesses the student's comprehension of the various expansionist policies pursued by the United States.",
    "Analysis of Economic Factors: Evaluates the student's ability to analyze the economic factors that contributed to the rise of the United States as a world power.",
    "Examination of Political and Military Developments: Assesses the student's examination of the political and military developments that propelled the United States to global prominence.",
    "Discussion of Socio-Cultural Influences: Evaluates the student's discussion of the socio-cultural influences that shaped the United States' role as a world power."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of US expansionist policies.",
      "Shows minimal understanding of US expansionist policies, with significant misconceptions.",
      "Displays a basic understanding of one or two expansionist policies, but lacks depth and breadth.",
      "Demonstrates a satisfactory understanding of several expansionist policies, with some details missing.",
      "Exhibits a strong understanding of multiple expansionist policies, including their motivations and consequences.",
      "Demonstrates a comprehensive and nuanced understanding of US expansionist policies, including their diverse impacts and long-term significance."
    ],
    [
      "Fails to identify any relevant economic factors.",
      "Identifies one or two economic factors, but struggles to explain their significance.",
      "Describes some economic factors, but lacks analysis of their impact on US power.",
      "Analyzes several economic factors and their contribution to the rise of US power, but misses some connections.",
      "Provides a thorough analysis of key economic factors and their direct impact on the US's ascent to global power.",
      "Offers a sophisticated analysis of the complex interplay of economic factors and their profound influence on the rise of the United States as a dominant world power."
    ],
    [
      "Shows no awareness of relevant political or military developments.",
      "Mentions one or two political or military developments, but lacks context or explanation.",
      "Describes some political and military developments, but struggles to connect them to the rise of US power.",
      "Explains several political and military developments and their contribution to the US's growing influence, but omits some details.",
      "Provides a detailed examination of key political and military developments that facilitated the US's rise to global power.",
      "Presents a comprehensive and insightful examination of the intricate relationship between political and military developments and the transformation of the United States into a major world power."
    ],
    [
      "Does not address any relevant socio-cultural influences.",
      "Briefly mentions one or two socio-cultural influences, but lacks analysis or explanation.",
      "Describes some socio-cultural influences, but struggles to connect them to the rise of US power.",
      "Discusses several socio-cultural influences and their role in shaping the US's global role, but misses some connections.",
      "Provides a thoughtful discussion of key socio-cultural influences that shaped the US's identity and its interactions with the world.",
      "Offers a nuanced and insightful discussion of the complex interplay between socio-cultural influences and the evolution of the United States as a leading world power."
    ]
  ]
}