{
  "criteria": [
    "Understanding of States' Rights Doctrine: Assessing the student's comprehension of the States' Rights Doctrine and its implications in the context of the pre-Civil War era.",
    "Analysis of Key Events and Compromises: Evaluating the student's ability to analyze the causes, effects, and significance of the Missouri Compromise, Wilmot Proviso, Compromise of 1850, and Kansas-Nebraska Act.",
    "Understanding of Key Figures: Assessing comprehension of the roles of Henry Clay and the Lincoln-Douglas debates in shaping the political landscape.",
    "Assessment of Dred Scott v. Sandford Decision: Assessing students knowledge of this landmark case."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the States' Rights Doctrine.",
      "Shows minimal understanding of the States' Rights Doctrine, with significant inaccuracies.",
      "Displays a basic understanding of the States' Rights Doctrine but struggles to explain its significance.",
      "Demonstrates a satisfactory understanding of the States' Rights Doctrine and its role in the lead-up to the Civil War.",
      "Exhibits a strong understanding of the States' Rights Doctrine, including its historical context and impact on political tensions.",
      "Displays a comprehensive and nuanced understanding of the States' Rights Doctrine, including its long-term consequences and interpretations."
    ],
    [
      "Unable to identify or describe any of the key events or compromises.",
      "Identifies key events but provides inaccurate or incomplete descriptions.",
      "Describes key events but struggles to explain their significance or interrelationships.",
      "Analyzes the causes and effects of key events, demonstrating a general understanding of their significance.",
      "Provides a detailed analysis of key events and compromises, including their political, social, and economic impacts.",
      "Offers a sophisticated analysis of key events, demonstrating a deep understanding of their complexities and historical consequences."
    ],
    [
      "Demonstrates no understanding of the roles played by Henry Clay or the Lincoln-Douglas debates.",
      "Shows minimal understanding of key figures and events, with significant inaccuracies.",
      "Displays a basic understanding of the figures but struggles to explain their significance.",
      "Demonstrates a satisfactory understanding of the figures and their role in the events.",
      "Exhibits a strong understanding of the figures, including their historical context and impact on political tensions.",
      "Displays a comprehensive and nuanced understanding of the figures, including their motivations and long-term consequences."
    ],
    [
      "Demonstrates no understanding of the Dred Scott v. Sandford decision.",
      "Shows minimal understanding of the Dred Scott v. Sandford decision, with significant inaccuracies.",
      "Displays a basic understanding of the Dred Scott v. Sandford decision but struggles to explain its significance.",
      "Demonstrates a satisfactory understanding of the Dred Scott v. Sandford decision and its role in the lead-up to the Civil War.",
      "Exhibits a strong understanding of the Dred Scott v. Sandford decision, including its historical context and impact on political tensions.",
      "Displays a comprehensive and nuanced understanding of the Dred Scott v. Sandford decision, including its long-term consequences and interpretations."
    ]
  ]
}