{
  "criteria": [
    "Understanding of Classical Republicanism and Liberalism",
    "Analysis of the U.S. Constitution's Balance",
    "Connection to the Declaration of Independence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of classical republicanism or liberalism.",
      "Student demonstrates a minimal understanding of either classical republicanism or liberalism, but not both.",
      "Student demonstrates a basic understanding of classical republicanism and liberalism but struggles to differentiate between them.",
      "Student demonstrates a clear understanding of both classical republicanism and liberalism and can identify some key differences.",
      "Student demonstrates a comprehensive understanding of classical republicanism and liberalism, clearly articulating their differences and historical context.",
      "Student demonstrates an exceptional understanding of classical republicanism and liberalism, providing nuanced insights into their historical context, philosophical underpinnings, and enduring relevance."
    ],
    [
      "Student provides no analysis of how the U.S. Constitution balances classical republican and liberal concerns.",
      "Student offers a superficial analysis of the U.S. Constitution's balance, lacking specific examples.",
      "Student identifies the U.S. Constitution attempts to balance classical republican and liberal concerns but provides limited supporting evidence.",
      "Student analyzes how the U.S. Constitution balances classical republican and liberal concerns, citing specific clauses or principles.",
      "Student provides a detailed analysis of how the U.S. Constitution balances classical republican and liberal concerns, offering insightful interpretations and relevant historical context.",
      "Student demonstrates a sophisticated analysis of the U.S. Constitution's balance, synthesizing diverse perspectives and drawing original conclusions about its enduring significance."
    ],
    [
      "Student fails to connect the principles of liberal constitutionalism and democracy to the Declaration of Independence.",
      "Student makes a vague connection between liberal constitutionalism\/democracy and the Declaration of Independence, lacking specific examples.",
      "Student identifies some shared principles between liberal constitutionalism\/democracy and the Declaration of Independence but struggles to articulate their relationship.",
      "Student explains how the basic premises of liberal constitutionalism and democracy are reflected in the Declaration of Independence as 'self-evident truths.'",
      "Student analyzes the Declaration of Independence as a foundational document for liberal constitutionalism and democracy, highlighting its key principles and their historical significance.",
      "Student offers a critical analysis of the Declaration of Independence's influence on liberal constitutionalism and democracy, exploring its limitations, contradictions, and ongoing relevance in contemporary society."
    ]
  ]
}