{
  "criteria": [
    "Understanding of the historical context of Arabic language growth in West Africa.",
    "Ability to trace the growth of the Arabic language in West African government.",
    "Ability to trace the growth of the Arabic language in West African trade.",
    "Ability to trace the growth of the Arabic language in West African Islamic scholarship.",
    "Use of evidence and examples to support claims about the growth of the Arabic language."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context.",
      "Demonstrates a minimal understanding of the historical context, with significant inaccuracies.",
      "Demonstrates a basic understanding of the historical context, but misses key details.",
      "Demonstrates a satisfactory understanding of the historical context, with some minor omissions.",
      "Demonstrates a strong understanding of the historical context, providing accurate and relevant information.",
      "Demonstrates a comprehensive and nuanced understanding of the historical context, including insightful analysis."
    ],
    [
      "Cannot identify any role of Arabic in West African government.",
      "Identifies a limited role of Arabic in government, with significant inaccuracies.",
      "Identifies a basic role of Arabic in government, but lacks specific examples.",
      "Describes a satisfactory role of Arabic in government, providing some relevant examples.",
      "Explains a significant role of Arabic in government, providing clear and accurate examples.",
      "Analyzes the multifaceted role of Arabic in government, providing comprehensive examples and insightful explanations."
    ],
    [
      "Cannot identify any role of Arabic in West African trade.",
      "Identifies a limited role of Arabic in trade, with significant inaccuracies.",
      "Identifies a basic role of Arabic in trade, but lacks specific examples.",
      "Describes a satisfactory role of Arabic in trade, providing some relevant examples.",
      "Explains a significant role of Arabic in trade, providing clear and accurate examples.",
      "Analyzes the complex role of Arabic in trade, providing comprehensive examples and insightful explanations."
    ],
    [
      "Cannot identify any role of Arabic in West African Islamic scholarship.",
      "Identifies a limited role of Arabic in Islamic scholarship, with significant inaccuracies.",
      "Identifies a basic role of Arabic in Islamic scholarship, but lacks specific examples.",
      "Describes a satisfactory role of Arabic in Islamic scholarship, providing some relevant examples.",
      "Explains a significant role of Arabic in Islamic scholarship, providing clear and accurate examples.",
      "Analyzes the profound role of Arabic in Islamic scholarship, providing comprehensive examples and insightful explanations."
    ],
    [
      "Provides no evidence or examples.",
      "Provides minimal evidence or examples, which are often irrelevant or inaccurate.",
      "Provides some evidence or examples, but they are not always relevant or clearly explained.",
      "Provides satisfactory evidence or examples that support most claims.",
      "Provides strong evidence and relevant examples that clearly support all claims.",
      "Provides compelling evidence and insightful examples that strengthen all claims, demonstrating a deep understanding."
    ]
  ]
}