{
  "criteria": [
    "Understanding of Queen Hatshepsut's significance.",
    "Understanding of Ramses the Great's significance.",
    "Ability to compare and contrast the reigns of Hatshepsut and Ramses the Great."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Queen Hatshepsut's reign or impact.",
      "Shows minimal understanding of Queen Hatshepsut, with significant inaccuracies.",
      "Identifies Queen Hatshepsut but struggles to explain her importance.",
      "Describes Queen Hatshepsut's reign and some of her accomplishments with general accuracy.",
      "Explains Queen Hatshepsut's major achievements, such as her building projects and promotion of trade, with supporting details.",
      "Provides a comprehensive analysis of Queen Hatshepsut's reign, including her impact on Egyptian society, her challenges to tradition, and long-term legacy."
    ],
    [
      "Demonstrates no understanding of Ramses the Great's reign or impact.",
      "Shows minimal understanding of Ramses the Great, with significant inaccuracies.",
      "Identifies Ramses the Great but struggles to explain his importance.",
      "Describes Ramses the Great's reign and some of his accomplishments with general accuracy.",
      "Explains Ramses the Great's major achievements, such as his military campaigns and building projects, with supporting details.",
      "Provides a comprehensive analysis of Ramses the Great's reign, including his military strategies, his impact on Egyptian art and architecture, and his role in Egyptian history."
    ],
    [
      "Unable to compare or contrast the two rulers.",
      "Attempts a comparison but demonstrates significant misunderstandings of one or both rulers.",
      "Offers a basic comparison, identifying one or two similarities or differences.",
      "Compares and contrasts Hatshepsut and Ramses the Great, noting several key similarities and differences in their reigns and legacies.",
      "Provides a detailed comparison of the rulers, analyzing their different approaches to leadership, their impact on Egyptian society, and their long-term legacies.",
      "Offers a nuanced and insightful comparison, evaluating the complexities of their reigns, the historical context in which they ruled, and the lasting impact of their decisions."
    ]
  ]
}