{
  "criteria": [
    "Understanding of Daily Life in Earlier Times",
    "Comparison of Past and Present",
    "Examples and Specific Details"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how people lived in earlier times.",
      "Shows a very limited understanding of daily life in earlier times.",
      "Displays a basic understanding of some aspects of daily life in earlier times, but lacks detail and accuracy.",
      "Demonstrates a general understanding of daily life in earlier times, including some specific examples.",
      "Exhibits a strong understanding of daily life in earlier times, providing accurate details and examples.",
      "Shows a comprehensive understanding of daily life in earlier times, providing insightful details, examples, and nuanced perspectives."
    ],
    [
      "Unable to compare life in earlier times with life today.",
      "Makes a weak attempt to compare past and present life, but lacks clarity and coherence.",
      "Identifies a few differences between past and present life, but without much explanation.",
      "Compares past and present life, highlighting several key differences with some explanation.",
      "Provides a detailed comparison of past and present life, explaining the differences in depth.",
      "Offers a comprehensive and insightful comparison of past and present life, analyzing the reasons for the differences and their impact."
    ],
    [
      "Provides no specific examples or details to support understanding.",
      "Includes very few specific examples or details, and they may be inaccurate.",
      "Offers some specific examples and details, but they are limited and not always accurate.",
      "Supports understanding with relevant and accurate examples and details.",
      "Effectively uses a variety of specific and accurate examples and details to illustrate understanding.",
      "Demonstrates a mastery of the topic using vivid and precise examples and details that significantly enhance understanding."
    ]
  ]
}