{
  "criteria": [
    "Understanding of Romanticism's Emergence",
    "Connection to the move away from Classicism",
    "Use of Examples & Specifics"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Romanticism or its emergence in art, literature, or social criticism.",
      "Shows minimal awareness of Romanticism but struggles to identify its emergence in different fields.",
      "Identifies Romanticism and some of its characteristics but provides limited details on its emergence in art, literature, and social criticism.",
      "Describes Romanticism's emergence in one or two fields (art, literature, or social criticism) with some specific examples.",
      "Explains Romanticism's emergence in art, literature, and social criticism with relevant examples, such as Blake, Wordsworth, or Dickens, but lacks depth.",
      "Provides a comprehensive analysis of Romanticism's emergence in art, literature, and social criticism, including specific examples and demonstrating a nuanced understanding of the movement's key figures and themes."
    ],
    [
      "Does not recognize or mention Classicism or its relationship to Romanticism.",
      "Mentions Classicism but does not explain how Romanticism represented a departure from it.",
      "Identifies Romanticism as different from Classicism but does not elaborate on the specific changes.",
      "Describes some ways in which Romanticism differed from Classicism in Europe, focusing on one or two aspects.",
      "Explains several key differences between Romanticism and Classicism, providing context for the shift in European thought and artistic expression.",
      "Offers a detailed comparison of Romanticism and Classicism, analyzing the underlying reasons for the shift and its impact on European culture and society."
    ],
    [
      "Provides no examples of Romantic artists, writers, or social critics.",
      "Mentions Romantic artists or writers without providing specific examples of their works or ideas.",
      "Offers one or two general examples of Romantic figures but lacks detail.",
      "Provides several relevant examples of Romantic artists, writers, or social critics, such as William Blake, William Wordsworth and\/or Charles Dickens",
      "Presents multiple detailed examples of Romantic artists, writers, and\/or social critics, explaining their contributions and significance.",
      "Analyzes the works and ideas of Romantic figures in depth, demonstrating a comprehensive understanding of their impact on the movement and its legacy."
    ]
  ]
}