{
  "criteria": [
    "Identification of Allied and Axis Powers on a Map",
    "Discussion of Major Turning Points and Principal Theaters of Conflict",
    "Understanding Key Strategic Decisions and War Conferences",
    "Emphasis on the Importance of Geographic Factors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Unable to identify any Allied or Axis powers on a map.",
      "Can identify only a few Allied or Axis powers with significant inaccuracies.",
      "Identifies most of the major Allied and Axis powers with some inaccuracies.",
      "Accurately identifies the major Allied and Axis powers on a map.",
      "Accurately identifies the major Allied and Axis powers and can locate key regions controlled by each.",
      "Accurately identifies and locates Allied and Axis powers, including smaller or less known participants, demonstrating comprehensive knowledge of the geopolitical landscape."
    ],
    [
      "Unable to discuss any major turning points or theaters of conflict.",
      "Mentions one or two turning points or theaters with minimal detail.",
      "Discusses a few major turning points and theaters, but lacks depth and accuracy.",
      "Discusses the major turning points and principal theaters of conflict with reasonable accuracy.",
      "Explains the major turning points and theaters of conflict, providing context and demonstrating understanding of their significance.",
      "Provides a comprehensive analysis of major turning points and principal theaters, including their strategic importance and long-term consequences."
    ],
    [
      "Shows no understanding of key strategic decisions or war conferences.",
      "Mentions a strategic decision or war conference but cannot explain its purpose or impact.",
      "Identifies a few strategic decisions and war conferences with limited explanation.",
      "Explains several key strategic decisions and war conferences, demonstrating a basic understanding of their aims and outcomes.",
      "Analyzes the key strategic decisions and war conferences, explaining their impact on the war's progression and political landscape.",
      "Provides an in-depth analysis of strategic decisions and war conferences, assessing their effectiveness and long-term geopolitical consequences with nuanced understanding."
    ],
    [
      "Fails to recognize the importance of geographic factors in World War II.",
      "Acknowledges the role of geography in one or two instances, but without detail.",
      "Briefly mentions geographic factors in relation to some events or decisions.",
      "Explains how geographic factors influenced certain battles, strategies, or political outcomes.",
      "Analyzes the significant impact of geographic factors on multiple aspects of World War II, providing specific examples.",
      "Demonstrates a sophisticated understanding of how geographic factors shaped the entire course of World War II, including its political resolutions, with detailed evidence and insightful analysis."
    ]
  ]
}