{
  "criteria": [
    "Understanding of Revolutionary Ideals",
    "Explanation of State Constitutions (Post-1776)",
    "Connection to the U.S. Constitution"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the ideals behind the American Revolution.",
      "Student shows a minimal understanding of the ideals behind the American Revolution; explanations are vague or incorrect.",
      "Student identifies some ideals of the American Revolution but struggles to connect them to the state constitutions.",
      "Student accurately identifies several ideals of the American Revolution (e.g., liberty, self-government, natural rights).",
      "Student clearly explains the major ideals of the American Revolution and how they are reflected in the state constitutions.",
      "Student comprehensively explains the major ideals of the American Revolution, connects them to specific elements within the state constitutions, and analyzes the impact of these ideals on the formation of the U.S. Constitution."
    ],
    [
      "Student is unable to describe any state constitutions established after 1776.",
      "Student mentions state constitutions but provides no accurate details or explanations.",
      "Student identifies one or two features of state constitutions but struggles to explain their significance.",
      "Student describes key features of at least two state constitutions established after 1776.",
      "Student provides detailed explanations of the key features of multiple state constitutions, explaining the context in which they were written and their significance.",
      "Student offers a nuanced understanding of several state constitutions, including details about their creation, key components, and lasting impact. Demonstrates how these constitutions served as models for the U.S. Constitution."
    ],
    [
      "Student fails to make any connection between state constitutions and the U.S. Constitution.",
      "Student attempts to connect state constitutions to the U.S. Constitution, but the explanation is unclear or inaccurate.",
      "Student identifies a basic similarity or influence between state constitutions and the U.S. Constitution.",
      "Student explains how specific elements of state constitutions served as models or influences for the U.S. Constitution.",
      "Student provides a clear explanation of how state constitutions influenced the U.S. Constitution, citing specific examples and explaining the reasoning behind their influence.",
      "Student offers a sophisticated analysis of how state constitutions served as models for the U.S. Constitution, including discussion of both direct influences and areas where the U.S. Constitution diverged. Student also addresses why these changes were made and the long term impact of the changes."
    ]
  ]
}