{
  "criteria": [
    "Understanding of Class Structures",
    "Knowledge of Family Life and Social Norms",
    "Understanding of Warfare and its Impact",
    "Religious Beliefs and Practices",
    "Understanding of Slavery"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the class structures within Meso-American and Andean civilizations.",
      "Demonstrates a minimal understanding of class structures, with significant inaccuracies or omissions.",
      "Identifies basic class divisions but lacks detail and comparison between the civilizations.",
      "Describes the main class structures in both Meso-American and Andean societies with some accuracy.",
      "Compares and contrasts the class structures effectively, noting similarities and differences with good detail.",
      "Provides a comprehensive and nuanced analysis of class structures, including their impact on society and governance in both regions."
    ],
    [
      "Shows no knowledge of family life and social norms in Meso-American and Andean civilizations.",
      "Demonstrates very limited and inaccurate information regarding family life and social norms.",
      "Identifies some basic aspects of family life but fails to connect them to broader social norms.",
      "Describes family life and social norms in both civilizations with some accurate details.",
      "Compares and contrasts family life and social norms, noting the key differences and similarities.",
      "Offers a deep and insightful analysis of family life and social norms, explaining their cultural significance and influence on society."
    ],
    [
      "Shows no understanding of the role of warfare in Meso-American and Andean civilizations.",
      "Demonstrates minimal and inaccurate information about warfare.",
      "Identifies warfare as a factor but fails to explain its purpose or impact.",
      "Describes the role of warfare in both civilizations, including its purposes and methods.",
      "Compares and contrasts warfare practices, noting their strategic and cultural significance.",
      "Provides a comprehensive analysis of warfare, its impact on society, and its role in shaping political and economic structures."
    ],
    [
      "Shows no understanding of the religious beliefs and practices.",
      "Demonstrates very limited and inaccurate information.",
      "Identifies basic religious elements but lacks depth and comparison.",
      "Describes the main religious beliefs and practices in both civilizations with some accuracy.",
      "Compares and contrasts religious beliefs and practices, noting key deities, rituals, and their influence.",
      "Offers a detailed analysis of religious beliefs and practices, explaining their philosophical underpinnings and societal impact."
    ],
    [
      "Shows no understanding of the role of slavery.",
      "Demonstrates minimal and inaccurate information about slavery.",
      "Identifies slavery as a factor but fails to explain its prevalence or nature.",
      "Describes the role of slavery in both civilizations, including its sources and functions.",
      "Compares and contrasts slavery practices, noting their economic and social impacts.",
      "Provides a comprehensive analysis of slavery, its impact on society, and its role in shaping economic and social structures."
    ]
  ]
}