{
  "criteria": [
    "Understanding of Feudalism's Development",
    "Role in the Medieval European Economy",
    "Influence of Physical Geography",
    "Feudal Relationships and Political Order"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the development of feudalism.",
      "The student shows a minimal understanding of the development of feudalism, with significant gaps in knowledge.",
      "The student demonstrates a basic understanding of the development of feudalism, but lacks depth and detail.",
      "The student demonstrates a satisfactory understanding of the development of feudalism, including key stages and influences.",
      "The student demonstrates a strong understanding of the development of feudalism, providing detailed explanations and insights.",
      "The student demonstrates a comprehensive and nuanced understanding of the development of feudalism, including its complexities and interpretations."
    ],
    [
      "The student demonstrates no understanding of feudalism's role in the medieval European economy.",
      "The student shows a minimal understanding of feudalism's economic role, with significant inaccuracies.",
      "The student demonstrates a basic understanding of feudalism's economic role, but struggles to connect it to broader economic trends.",
      "The student demonstrates a satisfactory understanding of feudalism's economic role, including key aspects like manorialism and trade.",
      "The student demonstrates a strong understanding of feudalism's economic role, providing detailed explanations of its impact on medieval society.",
      "The student demonstrates a comprehensive and insightful understanding of feudalism's economic role, including its long-term consequences."
    ],
    [
      "The student demonstrates no understanding of how physical geography influenced feudalism.",
      "The student shows a minimal understanding of the relationship between geography and feudalism, with significant misconceptions.",
      "The student demonstrates a basic understanding of the geographic influences on feudalism, but lacks specific examples.",
      "The student demonstrates a satisfactory understanding of how physical geography (e.g., the manor, growth of towns) influenced feudalism.",
      "The student demonstrates a strong understanding of the geographic influences on feudalism, providing detailed examples and analysis.",
      "The student demonstrates a comprehensive and nuanced understanding of the interplay between geography and feudalism, including its environmental consequences."
    ],
    [
      "The student demonstrates no understanding of how feudal relationships provided the foundation of political order.",
      "The student shows a minimal understanding of feudal relationships and their political significance, with significant gaps in knowledge.",
      "The student demonstrates a basic understanding of feudal relationships, but struggles to explain their role in maintaining political order.",
      "The student demonstrates a satisfactory understanding of how feudal relationships provided the foundation of political order, including concepts like vassalage and fealty.",
      "The student demonstrates a strong understanding of feudal relationships and their political significance, providing detailed examples and analysis.",
      "The student demonstrates a comprehensive and insightful understanding of the complex relationship between feudalism and political order, including its limitations and alternatives."
    ]
  ]
}