{
  "criteria": [
    "Understanding the role of religion in the founding of America.",
    "Analyzing the lasting moral and social impacts of religion.",
    "Analyzing the lasting political impacts of religion.",
    "Understanding issues regarding religious liberty."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the role of religion in the founding of America.",
      "Demonstrates a minimal understanding of the role of religion in the founding of America.",
      "Demonstrates a basic understanding of the role of religion in the founding of America, with some inaccuracies.",
      "Demonstrates a satisfactory understanding of the role of religion in the founding of America.",
      "Demonstrates a strong understanding of the role of religion in the founding of America, providing relevant details.",
      "Demonstrates a comprehensive and nuanced understanding of the role of religion in the founding of America, including complex factors and perspectives."
    ],
    [
      "Fails to analyze the lasting moral and social impacts of religion.",
      "Provides a superficial analysis of the lasting moral and social impacts of religion.",
      "Identifies some moral and social impacts of religion with limited explanation.",
      "Analyzes the moral and social impacts of religion with supporting evidence.",
      "Provides a thorough analysis of the lasting moral and social impacts of religion, connecting them to historical context.",
      "Offers a sophisticated and insightful analysis of the complex and interconnected lasting moral and social impacts of religion."
    ],
    [
      "Fails to analyze the lasting political impacts of religion.",
      "Provides a superficial analysis of the lasting political impacts of religion.",
      "Identifies some political impacts of religion with limited explanation.",
      "Analyzes the political impacts of religion with supporting evidence.",
      "Provides a thorough analysis of the lasting political impacts of religion, connecting them to historical context.",
      "Offers a sophisticated and insightful analysis of the complex and interconnected lasting political impacts of religion."
    ],
    [
      "Demonstrates no understanding of issues regarding religious liberty.",
      "Demonstrates a minimal understanding of issues regarding religious liberty.",
      "Demonstrates a basic understanding of issues regarding religious liberty, with some inaccuracies.",
      "Demonstrates a satisfactory understanding of issues regarding religious liberty.",
      "Demonstrates a strong understanding of issues regarding religious liberty, providing relevant examples.",
      "Demonstrates a comprehensive and nuanced understanding of issues regarding religious liberty, including different viewpoints and legal interpretations."
    ]
  ]
}