{
  "criteria": [
    "Understanding of North-South Boundaries",
    "Knowledge of Geographical Differences",
    "Comparison of Agrarian and Industrial Economies"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the geographical boundaries between the North and South during the Civil War era.",
      "Student shows a vague or inaccurate understanding of the boundaries, lacking specific details.",
      "Student identifies the North and South but struggles to accurately describe their boundaries or includes significant inaccuracies.",
      "Student accurately describes the general boundaries between the North and South, but misses some key details or nuances.",
      "Student clearly and accurately describes the boundaries constituting the North and the South, demonstrating a solid understanding.",
      "Student provides a comprehensive and nuanced description of the North-South boundaries, including changes over time and the contested border regions."
    ],
    [
      "Student demonstrates no awareness of the geographical differences between the North and South.",
      "Student mentions geographical differences but provides no specific examples or details.",
      "Student identifies one or two geographical differences but struggles to explain their significance or provide accurate details.",
      "Student describes several geographical differences between the regions, such as climate, terrain, and natural resources, with some accuracy.",
      "Student thoroughly describes the key geographical differences between the North and South, explaining how these differences influenced economic and social development.",
      "Student offers an insightful analysis of the geographical differences, linking them to strategic advantages and disadvantages during the Civil War and their long-term impact."
    ],
    [
      "Student shows no understanding of the differences between agrarian and industrial economies.",
      "Student mentions agrarians and industrialists but does not explain the differences in their economic systems.",
      "Student identifies basic differences between agrarian and industrial societies but struggles to provide specific examples or accurate details.",
      "Student describes the key characteristics of agrarian and industrial economies, such as agricultural production in the South and manufacturing in the North.",
      "Student clearly compares and contrasts the agrarian economy of the South with the industrial economy of the North, explaining key differences in labor systems, technology, and trade.",
      "Student provides a sophisticated analysis of the economic differences between the North and South, including the role of slavery, the impact of technological innovation, and the global context of trade and finance."
    ]
  ]
}