{
  "criteria": [
    "Understanding of the Historical Context",
    "Explanation of Migration Patterns",
    "Identification of Causes for Migration",
    "Discussion of Impact and Consequences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the historical context surrounding Mexican migration to the West and Southwest.",
      "The student shows a minimal understanding of the historical context, with significant gaps in knowledge.",
      "The student demonstrates a basic understanding of the historical context, but lacks depth and detail.",
      "The student demonstrates a satisfactory understanding of the historical context, including key events and factors.",
      "The student demonstrates a strong understanding of the historical context, providing detailed explanations and insights.",
      "The student demonstrates a comprehensive and nuanced understanding of the historical context, including complex interactions and perspectives."
    ],
    [
      "The student does not describe the migration patterns of Mexican settlers.",
      "The student attempts to describe migration patterns, but the description is vague and inaccurate.",
      "The student provides a limited description of migration patterns, with some inaccuracies or omissions.",
      "The student accurately describes the general migration patterns of Mexican settlers into the West and Southwest.",
      "The student provides a detailed and accurate description of migration patterns, including specific routes and destinations.",
      "The student provides an insightful and comprehensive description of migration patterns, analyzing the causes and consequences of different routes and destinations."
    ],
    [
      "The student does not identify any causes for Mexican migration.",
      "The student attempts to identify causes, but the explanations are unclear or irrelevant.",
      "The student identifies one or two basic causes for migration, but lacks detail and supporting evidence.",
      "The student identifies several key causes for migration, such as economic opportunities and political instability.",
      "The student provides a detailed explanation of the various causes for migration, including economic, social, and political factors.",
      "The student offers a nuanced analysis of the complex interplay of factors that drove Mexican migration, including both push and pull factors."
    ],
    [
      "The student does not discuss the impact or consequences of Mexican migration.",
      "The student attempts to discuss impact, but the discussion is superficial and lacks supporting evidence.",
      "The student identifies one or two basic impacts or consequences of migration, but lacks detail.",
      "The student describes several key impacts and consequences of Mexican migration on both the settlers and the territories.",
      "The student provides a detailed explanation of the various impacts and consequences of migration, including social, economic, and cultural effects.",
      "The student offers a nuanced analysis of the long-term impacts and consequences of Mexican migration, considering multiple perspectives and complex interactions."
    ]
  ]
}