{
  "criteria": [
    "Understanding of Trade Restrictions During the Great Depression",
    "Comparison of Historical and Present-Day Trade Debates",
    "Analysis of Effects on Economic and Social Interests"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of trade restrictions during the Great Depression.",
      "Student demonstrates a minimal understanding of trade restrictions during the Great Depression, with significant gaps in knowledge.",
      "Student demonstrates a basic understanding of trade restrictions during the Great Depression, but struggles to explain the reasons for or effects of these restrictions.",
      "Student demonstrates a satisfactory understanding of trade restrictions during the Great Depression, explaining some reasons for and effects of these restrictions.",
      "Student demonstrates a strong understanding of trade restrictions during the Great Depression, clearly explaining the reasons for and effects of these restrictions with supporting details.",
      "Student demonstrates a comprehensive understanding of trade restrictions during the Great Depression, thoroughly explaining the reasons for and effects of these restrictions, providing insightful analysis and relevant historical context."
    ],
    [
      "Student makes no attempt to compare trade restrictions during the Great Depression with present-day trade debates.",
      "Student attempts a comparison but provides inaccurate or irrelevant information.",
      "Student identifies some similarities or differences between historical and present-day trade debates but lacks depth in analysis.",
      "Student compares the reasons for and effects of trade restrictions during the Great Depression with present-day arguments, identifying some key similarities and differences.",
      "Student thoroughly compares the reasons for and effects of trade restrictions during the Great Depression with present-day arguments, clearly articulating the positions of labor, business, and political leaders.",
      "Student provides a nuanced and insightful comparison of historical and present-day trade debates, demonstrating a sophisticated understanding of the economic and social interests at stake and providing strong supporting evidence."
    ],
    [
      "Student does not address the effects of trade restrictions\/free trade on the economic and social interests of various groups of Americans.",
      "Student mentions the effects of trade restrictions\/free trade but provides vague or inaccurate information.",
      "Student identifies some of the effects of trade restrictions\/free trade on economic and social interests but lacks a clear understanding of the different perspectives.",
      "Student analyzes the effects of trade restrictions\/free trade on the economic and social interests of various groups of Americans, presenting different perspectives.",
      "Student provides a comprehensive analysis of the effects of trade restrictions\/free trade on the economic and social interests of various groups of Americans, clearly explaining the different perspectives and providing supporting evidence.",
      "Student offers a nuanced and insightful analysis of the effects of trade restrictions\/free trade, demonstrating a deep understanding of the complexities involved and providing well-supported conclusions."
    ]
  ]
}