{
  "criteria": [
    "Understanding the War's Impact on Combatants",
    "Understanding the War's Impact on Civilians",
    "Understanding the War's Impact on the Physical Environment",
    "Understanding the War's Impact on Future Warfare"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how the Civil War affected combatants.",
      "Identifies one or two ways the war affected combatants with limited detail.",
      "Describes some of the effects of the war on combatants, such as injuries or imprisonment, with some details.",
      "Explains several effects of the war on combatants, including psychological and physical tolls, providing relevant details.",
      "Analyzes the diverse effects of the war on combatants, including long-term health issues, PTSD, and changes in military strategy, providing thorough details.",
      "Critically evaluates the profound and lasting impacts on combatants, including societal perceptions, medical advancements, and adaptations in warfare, providing comprehensive details and insights."
    ],
    [
      "Demonstrates no understanding of how the Civil War affected civilians.",
      "Identifies one or two ways the war affected civilians with limited detail.",
      "Describes some of the effects of the war on civilians, such as displacement or shortages, with some details.",
      "Explains several effects of the war on civilians, including economic hardship, loss of property, and social disruption, providing relevant details.",
      "Analyzes the diverse effects of the war on civilians, including changes in social roles, refugee crises, and the breakdown of law and order, providing thorough details.",
      "Critically evaluates the profound and lasting impacts on civilians, including demographic shifts, long-term economic consequences, and the reshaping of community structures, providing comprehensive details and insights."
    ],
    [
      "Demonstrates no understanding of how the Civil War affected the physical environment.",
      "Identifies one or two ways the war affected the physical environment with limited detail.",
      "Describes some of the effects of the war on the physical environment, such as deforestation or pollution, with some details.",
      "Explains several effects of the war on the physical environment, including the destruction of farmland, contamination of water sources, and alteration of landscapes, providing relevant details.",
      "Analyzes the diverse effects of the war on the physical environment, including long-term ecological damage, changes in agricultural practices, and the impact on natural resources, providing thorough details.",
      "Critically evaluates the profound and lasting impacts on the physical environment, including environmental recovery efforts, changes in land management policies, and the recognition of ecological consequences of warfare, providing comprehensive details and insights."
    ],
    [
      "Demonstrates no understanding of how the Civil War affected future warfare.",
      "Identifies one or two ways the war affected future warfare with limited detail.",
      "Describes some of the effects of the war on future warfare, such as new technologies or strategies, with some details.",
      "Explains several effects of the war on future warfare, including the use of trench warfare, advancements in weaponry, and the importance of logistics, providing relevant details.",
      "Analyzes the diverse effects of the war on future warfare, including the development of modern military tactics, the role of industrialization in war, and the concept of total war, providing thorough details.",
      "Critically evaluates the profound and lasting impacts on future warfare, including the ethical considerations of new technologies, the changing nature of conflict, and the ongoing evolution of military strategies, providing comprehensive details and insights."
    ]
  ]
}