{
  "criteria": [
    "Understanding the Significance of the Silk Roads",
    "Identifying the Locations of the Silk Roads",
    "Connecting the Silk Roads to the Han Dynasty and Roman Empire"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the Silk Roads or their importance.",
      "Student shows minimal awareness of the Silk Roads, with significant misunderstandings of their role.",
      "Student identifies the Silk Roads but struggles to explain their significance during the Han Dynasty and Roman Empire.",
      "Student adequately explains the importance of the Silk Roads for trade and cultural exchange but lacks depth or specific examples.",
      "Student provides a detailed explanation of the Silk Roads' significance, including their role in facilitating trade, cultural exchange, and the spread of ideas between the Han Dynasty and Roman Empire.",
      "Student demonstrates a comprehensive understanding of the Silk Roads' multifaceted significance, including economic, cultural, and political impacts, and provides specific examples to illustrate their importance."
    ],
    [
      "Student is unable to identify the location of the Silk Roads.",
      "Student provides a vague or inaccurate description of the Silk Roads' location.",
      "Student identifies the general geographic area of the Silk Roads but lacks precision.",
      "Student correctly identifies the broad geographical span of the Silk Roads across Eurasia.",
      "Student accurately describes the Silk Roads' route, including key regions and cities along the way.",
      "Student provides a detailed and precise description of the Silk Roads' route, demonstrating a strong understanding of the geographical connections between the Han Dynasty and Roman Empire."
    ],
    [
      "Student fails to connect the Silk Roads to either the Han Dynasty or the Roman Empire.",
      "Student vaguely mentions the Han Dynasty or Roman Empire but does not explain their relationship to the Silk Roads.",
      "Student acknowledges the Silk Roads' existence during the Han Dynasty and Roman Empire but struggles to articulate the specific connections.",
      "Student explains the Silk Roads' general importance to the Han Dynasty and Roman Empire but lacks specific examples or depth.",
      "Student effectively connects the Silk Roads to the Han Dynasty and Roman Empire, providing specific examples of goods, ideas, or cultural exchanges that occurred during this period.",
      "Student demonstrates a sophisticated understanding of the Silk Roads' role in shaping the Han Dynasty and Roman Empire, analyzing the complex interactions and mutual influences that resulted from this trans-Eurasian exchange."
    ]
  ]
}