{
  "criteria": [
    "Understanding of Geographic Factors",
    "Analysis of Political Structures",
    "Economic Systems and Trade",
    "Religious and Cultural Influences",
    "Social Structures and Hierarchy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the geographic locations or their impact on Ghana and Mali.",
      "Identifies the location of Ghana or Mali with limited accuracy.",
      "Identifies the locations of Ghana and Mali and can name one geographic factor influencing their development.",
      "Explains the geographic locations of Ghana and Mali and describes how physical features influenced settlement or trade.",
      "Analyzes how the geographic factors significantly impacted the economic or political structures of Ghana and Mali.",
      "Critically evaluates the long-term effects of geographic factors on the societal development and sustainability of Ghana and Mali."
    ],
    [
      "Shows no awareness of the political organization in Ghana or Mali.",
      "Names the rulers or types of government in Ghana or Mali with no supporting details.",
      "Describes the basic political structure of either Ghana or Mali.",
      "Compares the political structures of Ghana and Mali, identifying key differences and similarities.",
      "Explains how political decisions or leadership impacted the stability and growth of Ghana and Mali.",
      "Evaluates the effectiveness of the political systems in Ghana and Mali in addressing the needs of their societies and maintaining power."
    ],
    [
      "Unable to identify any economic activities or trade routes associated with Ghana or Mali.",
      "Identifies gold or salt as a resource but cannot connect it to trade.",
      "Describes basic trading practices or key resources in Ghana or Mali.",
      "Explains the significance of gold and salt trade in the economic prosperity of Ghana and Mali.",
      "Analyzes the role of trade routes and economic policies in shaping the societies of Ghana and Mali.",
      "Assesses the economic sustainability and impact of trade practices on the environment and social structures of Ghana and Mali."
    ],
    [
      "Shows no understanding of religious or cultural aspects of Ghana or Mali.",
      "Mentions Islam or traditional beliefs but lacks context.",
      "Describes the primary religious influences or cultural practices in Ghana or Mali.",
      "Explains how religious beliefs and cultural practices influenced the daily life and social norms of Ghana and Mali.",
      "Analyzes the interactions between different religions and cultures and their impact on the development of Ghana and Mali.",
      "Evaluates the legacy of religious and cultural exchanges and their relevance in understanding contemporary African societies."
    ],
    [
      "Demonstrates no knowledge of social classes or structures in Ghana or Mali.",
      "Identifies the existence of social classes but provides no further detail.",
      "Describes the basic social hierarchy or roles within Ghana or Mali.",
      "Explains the roles and responsibilities of different social classes in Ghana and Mali and how they contributed to society.",
      "Analyzes the impact of social structures on the distribution of power, wealth, and opportunities within Ghana and Mali.",
      "Critically evaluates the social inequalities and their effects on the stability and progress of Ghana and Mali."
    ]
  ]
}