{
  "criteria": [
    "Understanding of Federal Government's Role",
    "Analysis of Economic Policies",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the federal government's influence on the American economy.",
      "Demonstrates a minimal understanding of the federal government's influence on the American economy, with significant misconceptions.",
      "Demonstrates a basic understanding of the federal government's influence on the American economy, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the federal government's influence on the American economy, with some supporting evidence.",
      "Demonstrates a strong understanding of the federal government's influence on the American economy, providing clear and relevant examples.",
      "Demonstrates a comprehensive and nuanced understanding of the federal government's influence on the American economy, providing insightful analysis and relevant examples."
    ],
    [
      "Shows no ability to analyze specific federal government policies and their economic impact.",
      "Struggles to identify and describe specific federal government policies and their economic impact.",
      "Identifies some federal government policies but struggles to analyze their specific economic impacts.",
      "Analyzes a few federal government policies and their economic impacts with limited supporting evidence.",
      "Analyzes several federal government policies and their economic impacts with clear and relevant evidence.",
      "Provides a thorough and insightful analysis of various federal government policies and their economic impacts, demonstrating a clear understanding of cause and effect."
    ],
    [
      "Provides no evidence or examples to support claims about the federal government's influence on the American economy.",
      "Provides minimal and\/or irrelevant evidence or examples.",
      "Provides some evidence or examples, but they are not always relevant or accurate.",
      "Provides relevant evidence and examples to support most claims.",
      "Provides strong and relevant evidence and examples to support all claims.",
      "Provides compelling evidence and examples, demonstrating a mastery of the material."
    ]
  ]
}