{
  "criteria": [
    "Understanding of African Americans' Demands and Their Impact",
    "Explanation of Roosevelt's Ban on Racial Discrimination in Defense Industries (1941)",
    "Explanation of Truman's Decision to End Segregation in the Armed Forces (1948)"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the demands made by African Americans and their impact on civil rights advancements.",
      "Shows a minimal understanding of African Americans' demands but struggles to connect them to civil rights progress.",
      "Identifies some demands of African Americans and their connection to civil rights but lacks depth in explanation.",
      "Explains the key demands of African Americans and how they spurred civil rights advancements, including Roosevelt's ban and Truman's decision.",
      "Clearly explains the demands, their direct impact on Roosevelt's and Truman's decisions, and provides context.",
      "Demonstrates a comprehensive understanding of the demands, their catalytic role in civil rights, and provides insightful analysis of the historical context and long-term consequences."
    ],
    [
      "Fails to mention or explain Roosevelt's ban or its connection to African Americans' demands.",
      "Mentions Roosevelt's ban but provides no explanation of its significance or context.",
      "Offers a limited explanation of Roosevelt's ban with minimal connection to African Americans' demands.",
      "Explains Roosevelt's ban on racial discrimination in defense industries and links it to the demands of African Americans during that time.",
      "Provides a detailed explanation of Roosevelt's ban, its motivations, and its impact on African Americans and defense industries.",
      "Offers an insightful analysis of Roosevelt's ban, its effectiveness, limitations, and broader implications for civil rights and wartime mobilization."
    ],
    [
      "Fails to mention or explain Truman's decision or its connection to African Americans' service in WWII.",
      "Mentions Truman's decision but provides no explanation of its significance or context.",
      "Offers a limited explanation of Truman's decision with minimal connection to African Americans' service in WWII.",
      "Explains Truman's decision to end segregation in the armed forces and links it to African Americans' service and sacrifices during World War II.",
      "Provides a detailed explanation of Truman's decision, its motivations, the challenges faced, and its impact on the military and civil rights movement.",
      "Offers an insightful analysis of Truman's decision, its long-term effects on the military, its symbolic importance, and its contribution to the broader fight for equality."
    ]
  ]
}