{
  "criteria": [
    "Understanding of Colonization, Immigration, and Settlement Patterns",
    "Analysis of Economic Incentives",
    "Assessment of the Effects of Physical and Political Geography",
    "Knowledge of Transportation Systems",
    "Synthesis and Coherence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of colonization, immigration, and settlement patterns.",
      "Demonstrates a minimal understanding of colonization, immigration, and settlement patterns with significant inaccuracies.",
      "Demonstrates a basic understanding of colonization, immigration, and settlement patterns with some inaccuracies.",
      "Demonstrates a satisfactory understanding of colonization, immigration, and settlement patterns with minor inaccuracies.",
      "Demonstrates a comprehensive understanding of colonization, immigration, and settlement patterns with few to no inaccuracies.",
      "Demonstrates an exceptional understanding of colonization, immigration, and settlement patterns with no inaccuracies, including nuanced details."
    ],
    [
      "Fails to identify or analyze economic incentives driving settlement patterns.",
      "Identifies economic incentives with significant inaccuracies.",
      "Identifies economic incentives with some inaccuracies.",
      "Analyzes economic incentives with minor inaccuracies or omissions.",
      "Analyzes economic incentives with few inaccuracies and thorough explanations.",
      "Analyzes economic incentives with exceptional detail and demonstrates a deep understanding of their impact."
    ],
    [
      "Shows no awareness of the influence of physical and political geography.",
      "Demonstrates minimal awareness of the influence of physical and political geography.",
      "Demonstrates basic awareness of the influence of physical and political geography with limited examples.",
      "Explains the effects of physical and political geography with some specific examples.",
      "Analyzes the effects of physical and political geography with detailed examples and clear connections.",
      "Critically evaluates the complex interactions between physical and political geography and settlement patterns with sophisticated insights."
    ],
    [
      "Shows no understanding of transportation systems and their impact.",
      "Identifies transportation systems with significant inaccuracies.",
      "Identifies transportation systems with some inaccuracies.",
      "Describes transportation systems and their general impact.",
      "Explains the specific impact of transportation systems with supporting details.",
      "Analyzes the transformative impact of transportation systems on settlement patterns with comprehensive evidence."
    ],
    [
      "Presents information in a disorganized and incoherent manner.",
      "Presents information with significant organizational issues.",
      "Presents information with some organizational issues.",
      "Presents information in a generally organized and coherent manner.",
      "Presents information in a well-organized and coherent manner with clear connections between concepts.",
      "Presents information in a highly organized and coherent manner, demonstrating a synthesis of concepts and insightful analysis."
    ]
  ]
}