{
  "criteria": [
    "Understanding of American Indian Contributions",
    "Understanding of Immigrant Contributions",
    "Connection to Californian and American Culture"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of American Indian contributions to Californian and American culture.",
      "Shows minimal awareness of American Indian contributions, with significant inaccuracies or omissions.",
      "Identifies a few basic contributions of American Indians but lacks depth and detail.",
      "Describes several contributions of American Indians to Californian and American culture, with some supporting details.",
      "Explains multiple contributions of American Indians, providing specific examples and demonstrating a solid understanding.",
      "Provides a comprehensive analysis of the significant contributions of American Indians to both Californian and American culture, demonstrating deep insight and nuanced understanding."
    ],
    [
      "Demonstrates no understanding of immigrant contributions to Californian and American culture.",
      "Shows minimal awareness of immigrant contributions, with significant inaccuracies or omissions.",
      "Identifies a few basic contributions of immigrants but lacks depth and detail.",
      "Describes several contributions of immigrants to Californian and American culture, with some supporting details.",
      "Explains multiple contributions of immigrants, providing specific examples and demonstrating a solid understanding.",
      "Provides a comprehensive analysis of the significant contributions of immigrants to both Californian and American culture, demonstrating deep insight and nuanced understanding."
    ],
    [
      "Fails to connect the contributions to the broader context of Californian and American culture.",
      "Struggles to relate the contributions to the development of Californian and American culture.",
      "Makes superficial connections between contributions and culture, lacking explanation.",
      "Explains how specific contributions have influenced aspects of Californian and American culture.",
      "Analyzes the impact of various contributions on the evolution of Californian and American culture, providing clear examples.",
      "Offers a sophisticated analysis of the profound and lasting impact of both American Indian and immigrant contributions on the multifaceted nature of Californian and American culture."
    ]
  ]
}