{
  "criteria": [
    "Understanding of the Historical Context",
    "Knowledge of Key Figures and Works",
    "Analysis of Lasting Cultural Effects"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context of Medieval Japan's golden age.",
      "Shows minimal understanding of the historical context; struggles to place the golden age within a broader timeline.",
      "Displays a basic understanding of the historical context, but lacks depth in explaining the factors that led to the golden age.",
      "Exhibits a solid understanding of the historical context, identifying key factors and events that shaped the golden age.",
      "Demonstrates a comprehensive understanding of the historical context, analyzing the political, economic, and social conditions that contributed to the golden age.",
      "Shows exceptional understanding of the historical context, providing nuanced insights into the complexities of the period and its significance."
    ],
    [
      "Unable to identify any key figures or works from the golden age of Medieval Japan.",
      "Identifies only one or two key figures or works, with limited knowledge about them.",
      "Identifies several key figures or works, but struggles to provide detailed information about their contributions.",
      "Demonstrates a good understanding of key figures and works, providing accurate information about their significance.",
      "Exhibits a comprehensive knowledge of key figures and works, analyzing their contributions and impact on the culture of the time.",
      "Shows exceptional knowledge of key figures and works, providing insightful analysis of their lasting legacy and influence on contemporary culture."
    ],
    [
      "Unable to connect the golden age to any lasting cultural effects.",
      "Makes vague or unsubstantiated connections between the golden age and modern culture.",
      "Identifies some lasting cultural effects, but lacks depth in explaining their connection to the golden age.",
      "Analyzes the lasting cultural effects of the golden age, providing clear examples and explanations.",
      "Demonstrates a thorough analysis of the lasting cultural effects, exploring their impact on various aspects of modern society.",
      "Shows exceptional insight into the lasting cultural effects, providing nuanced analysis of their complex and multifaceted influence on contemporary culture."
    ]
  ]
}