{
  "criteria": [
    "Understanding of the Lord-Vassal System",
    "Knowledge of Values, Social Customs, and Traditions",
    "Analysis of the Warrior Code's Lasting Influence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the roles of shogun, daimyo, and samurai within the lord-vassal system.",
      "Demonstrates a minimal understanding of the roles within the lord-vassal system, with significant inaccuracies.",
      "Demonstrates a basic understanding of the roles within the lord-vassal system but struggles to differentiate between them.",
      "Demonstrates a satisfactory understanding of the roles of shogun, daimyo, and samurai and their relationships within the system.",
      "Demonstrates a strong understanding of the hierarchical structure of the lord-vassal system and the responsibilities of each role.",
      "Demonstrates a comprehensive understanding of the intricacies of the lord-vassal system, including the power dynamics and obligations of each role."
    ],
    [
      "Shows no awareness of the values, social customs, or traditions associated with the samurai and the lord-vassal system.",
      "Shows limited awareness of the values, social customs, or traditions, with significant misunderstandings.",
      "Identifies a few values, social customs, or traditions but struggles to explain their significance within the society.",
      "Describes several values, social customs, and traditions and their relevance to the samurai and the lord-vassal system.",
      "Explains the values, social customs, and traditions prescribed by the lord-vassal system and their impact on daily life.",
      "Provides a detailed analysis of the values, social customs, and traditions, including their origins and evolution within the context of Medieval Japan."
    ],
    [
      "Unable to identify any lasting influence of the warrior code in the twentieth century or later.",
      "Identifies a vague connection between the warrior code and modern society but cannot provide specific examples.",
      "Provides a superficial explanation of the warrior code's influence, lacking depth and specific details.",
      "Describes some ways in which the warrior code has influenced aspects of Japanese society in the twentieth century.",
      "Analyzes the lasting influence of the warrior code on various aspects of twentieth-century society, providing relevant examples.",
      "Evaluates the complex and nuanced ways in which the warrior code continues to shape Japanese culture and values in the twenty-first century, citing specific instances and analyzing their significance."
    ]
  ]
}