{
  "criteria": [
    "Identification of Ideologies",
    "Analysis of Causes",
    "Understanding of Stages",
    "Evaluation of Outcomes"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any ideologies associated with the major Mexican, Central American, and South American revolutions.",
      "The student identifies one ideology associated with the revolutions but lacks depth in explanation.",
      "The student identifies a few ideologies but demonstrates a limited understanding of their connection to the revolutions.",
      "The student identifies several ideologies accurately, providing some context for their role in the revolutions.",
      "The student comprehensively identifies the key ideologies and explains their influence on the revolutions with good supporting details.",
      "The student demonstrates an exceptional understanding of the ideologies, providing insightful analysis of their impact on the course and outcomes of the revolutions."
    ],
    [
      "The student does not identify any causes of the major revolutions.",
      "The student identifies one or two superficial causes without significant explanation.",
      "The student identifies some causes but demonstrates a limited understanding of their underlying significance.",
      "The student identifies several causes and provides a reasonable explanation of their role in the revolutions.",
      "The student thoroughly analyzes the various causes, providing clear explanations supported by relevant evidence.",
      "The student demonstrates exceptional insight by offering nuanced analysis of the complex interplay of factors contributing to the revolutions."
    ],
    [
      "The student fails to recognize any distinct stages of the major revolutions.",
      "The student mentions one or two stages without proper sequencing or context.",
      "The student identifies some stages but lacks a clear understanding of their chronological order or characteristics.",
      "The student identifies several stages and provides a basic overview of their key events and developments.",
      "The student clearly outlines the major stages, accurately sequencing them and providing relevant details about each phase.",
      "The student demonstrates a sophisticated understanding of the revolutionary stages, analyzing their interconnectedness and long-term implications."
    ],
    [
      "The student does not mention any outcomes of the major revolutions.",
      "The student identifies one or two superficial outcomes without providing any evaluation or analysis.",
      "The student identifies some outcomes but struggles to connect them to the initial goals or long-term consequences of the revolutions.",
      "The student identifies several outcomes and provides a basic evaluation of their impact on society and politics.",
      "The student thoroughly evaluates the diverse outcomes, assessing their significance and explaining their lasting impact on the region.",
      "The student demonstrates exceptional critical thinking by providing insightful analysis of the complex and often contradictory outcomes of the revolutions."
    ]
  ]
}