{
  "criteria": [
    "Understanding of the historical context of globalization and technological advancements.",
    "Analysis of the effects of globalization on different countries and regions.",
    "Evaluation of the impact of technological and communications revolutions.",
    "Use of evidence and examples to support claims."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of globalization or the technological\/communications revolutions.",
      "Student shows minimal understanding of globalization or the technological\/communications revolutions, with significant inaccuracies.",
      "Student demonstrates a basic understanding of either globalization or the technological\/communications revolutions, but struggles to connect them.",
      "Student demonstrates a satisfactory understanding of globalization and the technological\/communications revolutions, but with some gaps in knowledge.",
      "Student demonstrates a strong understanding of globalization and the technological\/communications revolutions, and can explain their interconnectedness.",
      "Student demonstrates a comprehensive and nuanced understanding of globalization and the technological\/communications revolutions, including historical context and complexities."
    ],
    [
      "Student provides no analysis of the effects of globalization.",
      "Student's analysis of the effects of globalization is superficial and inaccurate.",
      "Student identifies some effects of globalization, but the analysis lacks depth and supporting evidence.",
      "Student provides a satisfactory analysis of the effects of globalization on some countries or regions, with limited supporting evidence.",
      "Student provides a strong analysis of the effects of globalization on multiple countries or regions, with relevant supporting evidence.",
      "Student provides a comprehensive and insightful analysis of the complex and varied effects of globalization on different countries and regions, supported by strong evidence."
    ],
    [
      "Student demonstrates no evaluation of the impact of technological and communications revolutions.",
      "Student's evaluation is minimal and demonstrates little understanding of the impact.",
      "Student identifies some impacts of the technological and communications revolutions, but lacks supporting details.",
      "Student evaluates the impact of the technological and communications revolutions with some supporting details, but analysis is limited.",
      "Student evaluates the impact of the technological and communications revolutions with relevant supporting evidence and insightful analysis.",
      "Student provides a comprehensive and nuanced evaluation of the profound and varied impacts of technological and communications revolutions, supported by substantial evidence and insightful analysis."
    ],
    [
      "Student provides no evidence or examples.",
      "Student provides minimal or irrelevant evidence or examples.",
      "Student provides some evidence or examples, but they are not always relevant or accurate.",
      "Student provides relevant evidence and examples to support some claims, but there are gaps in support.",
      "Student consistently provides relevant and accurate evidence and examples to support claims.",
      "Student provides compelling and well-integrated evidence and examples to support claims, demonstrating a mastery of the subject matter."
    ]
  ]
}