{
  "criteria": [
    "Understanding of the Marshall Plan's Goals and Implementation",
    "Analysis of the Impact on Western Europe",
    "Connection to the U.S. Economy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the Marshall Plan or its goals.",
      "Student shows a vague awareness of the Marshall Plan but cannot articulate its purpose or implementation.",
      "Student identifies the Marshall Plan as aid to Europe but lacks details on its specific goals or how it was implemented.",
      "Student describes the Marshall Plan as a U.S. aid program to rebuild Western Europe but has limited knowledge of the specifics of its implementation (e.g., sectors targeted, conditions attached).",
      "Student accurately explains the Marshall Plan's primary goals (economic recovery, preventing the spread of communism) and provides some details on how it was implemented, such as key sectors targeted for aid.",
      "Student comprehensively explains the Marshall Plan's goals and provides detailed examples of its implementation, including specific countries that received aid, the types of projects funded, and the conditions the U.S. placed on the aid."
    ],
    [
      "Student does not address the impact of the Marshall Plan on Western Europe.",
      "Student makes a general statement about the Marshall Plan helping Europe, without specifics.",
      "Student identifies that the Marshall Plan helped rebuild Europe but does not explain how.",
      "Student describes the Marshall Plan's positive impact on Western Europe's recovery with limited details, such as increased production or infrastructure development.",
      "Student explains how the Marshall Plan contributed to Western Europe's economic recovery, providing specific examples such as increased industrial output, infrastructure improvements, and reduced poverty.",
      "Student thoroughly analyzes the Marshall Plan's impact on Western Europe, including its effects on economic growth, political stability, and social development. The student also discusses any criticisms or unintended consequences of the plan."
    ],
    [
      "Student does not address the importance of a rebuilt Europe to the U.S. economy.",
      "Student vaguely mentions that a rebuilt Europe was good for the U.S. economy, without explaining why.",
      "Student identifies that a rebuilt Europe benefited the U.S. economy but cannot explain the connection.",
      "Student explains how a rebuilt Europe helped the U.S. economy through increased trade, but the explanation lacks depth.",
      "Student explains how a rebuilt Europe stimulated the U.S. economy by creating markets for American goods, increasing trade, and strengthening alliances against communism.",
      "Student provides a nuanced analysis of how a rebuilt Europe was vital to the U.S. economy, discussing the interconnectedness of trade, investment, and geopolitical strategy. The student also considers alternative perspectives or potential drawbacks of the relationship."
    ]
  ]
}