{
  "criteria": [
    "Identification and Description of Key Individuals",
    "Understanding of Views and Motivations",
    "Analysis of Impact"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify or describe any of the key individuals of the American Revolution.",
      "The student identifies at least one key individual with minimal description.",
      "The student identifies multiple key individuals but struggles to accurately describe their roles or impact.",
      "The student can identify and describe the roles and impact of several key individuals during the American Revolution with minor inaccuracies.",
      "The student demonstrates a strong understanding of the roles, views and impact of most key individuals during the American Revolution with accurate supporting details.",
      "The student demonstrates a comprehensive understanding of the roles, views and impact of all key individuals during the American Revolution, including nuanced perspectives and accurate supporting details."
    ],
    [
      "The student does not demonstrate an understanding of the views and motivations of the individuals.",
      "The student attempts to explain views but demonstrates a limited understanding of the motivations behind them.",
      "The student describes views and motivations with some inaccuracies or generalizations.",
      "The student accurately explains the views and motivations of some key individuals, reflecting an understanding of their perspectives.",
      "The student explains the views and motivations of most key individuals with a high degree of accuracy, showing a strong understanding of their historical context.",
      "The student demonstrates a deep understanding of the complex views and motivations of all key individuals, analyzing their historical context and impact on the American Revolution."
    ],
    [
      "The student does not address the impact of the individuals discussed.",
      "The student mentions the impact of one or more individuals but does not provide supporting details.",
      "The student attempts to describe the impact of these individuals but provides limited or inaccurate details.",
      "The student accurately describes the impact of key individuals on the events of the American Revolution.",
      "The student provides a detailed analysis of the impact of key individuals, including social, political, and economic impacts.",
      "The student offers a comprehensive analysis of the long-term impacts of these individuals, assessing their influence on the course of American history with nuanced insights."
    ]
  ]
}