{
  "criteria": [
    "Understanding of Community's Founding",
    "Tracing Community Development Over Time",
    "Use of Historical Resources"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of why the community was established or the contributions of individuals and families.",
      "Shows a limited understanding of the community's establishment and individual contributions, with significant gaps in knowledge.",
      "Displays a basic understanding of the community's founding and some key figures but lacks depth and detail.",
      "Exhibits a satisfactory understanding of the reasons for the community's establishment and the roles of individuals and families in its development.",
      "Demonstrates a strong understanding of the historical context of the community's founding and the impact of key individuals and families.",
      "Shows a comprehensive and nuanced understanding of the multifaceted reasons for the community's establishment, along with a detailed analysis of the contributions of various individuals and families, including lesser-known figures."
    ],
    [
      "Unable to trace the community's development or identify any changes over time.",
      "Provides a fragmented and incomplete trace of the community's development, missing key periods and changes.",
      "Outlines a basic timeline of the community's development but lacks specific details and connections between events.",
      "Presents a clear trace of the community's development, highlighting significant changes and events over time.",
      "Demonstrates a thorough trace of the community's development, analyzing the causes and consequences of various changes and events.",
      "Offers an insightful and detailed trace of the community's evolution, exploring the complex interplay of factors that influenced its development, including social, economic, and environmental forces. Demonstrates synthesis of information."
    ],
    [
      "Does not use any historical resources or relies solely on secondary sources without proper analysis.",
      "Uses limited historical resources, primarily secondary sources, with minimal analysis or interpretation.",
      "Incorporates some historical resources, but their use is superficial and lacks critical analysis.",
      "Effectively uses a variety of historical resources, including maps, photographs, and primary sources, to support their understanding of the community's history.",
      "Critically analyzes a wide range of historical resources, drawing insightful conclusions about the community's past.",
      "Demonstrates mastery in the use and analysis of diverse historical resources, integrating them seamlessly to construct a compelling and original narrative of the community's history. Exhibits creativity."
    ]
  ]
}