{
  "criteria": [
    "Understanding of the Immigration Act of 1965",
    "Analysis of the reasons for changing immigration policy",
    "Discussion of the transformation of American society"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Immigration Act of 1965.",
      "Demonstrates a minimal understanding of the Immigration Act of 1965, with significant inaccuracies.",
      "Demonstrates a basic understanding of the Immigration Act of 1965, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the Immigration Act of 1965, including its main provisions.",
      "Demonstrates a strong understanding of the Immigration Act of 1965, including its historical context and immediate effects.",
      "Demonstrates a comprehensive and nuanced understanding of the Immigration Act of 1965, including its long-term consequences and debates surrounding it."
    ],
    [
      "Presents no analysis of the reasons for the nation's changing immigration policy.",
      "Offers a superficial analysis of the reasons for changing immigration policy, lacking specific examples.",
      "Identifies some of the reasons for changing immigration policy, but the analysis is underdeveloped.",
      "Analyzes several reasons for the changing immigration policy, providing some supporting evidence.",
      "Provides a well-supported and insightful analysis of the reasons for the changing immigration policy, connecting them to broader social and political trends.",
      "Offers a comprehensive and nuanced analysis of the reasons for the changing immigration policy, demonstrating an understanding of the complex interplay of factors involved."
    ],
    [
      "Does not discuss how the Immigration Act of 1965 and successor acts have transformed American society.",
      "Offers a vague and unsubstantiated discussion of the transformation of American society.",
      "Identifies some ways in which American society has been transformed, but lacks specific examples and analysis.",
      "Discusses several ways in which the Immigration Act of 1965 and successor acts have transformed American society, providing some supporting evidence.",
      "Provides a detailed and insightful discussion of the transformation of American society, connecting immigration policy to demographic shifts, cultural changes, and economic trends.",
      "Offers a comprehensive and nuanced discussion of the transformation of American society, demonstrating an understanding of the complex and multifaceted impacts of immigration policy."
    ]
  ]
}