{
  "criteria": [
    "Understanding of Pre-Columbian Societies",
    "Knowledge of the Spanish Mission Period",
    "Knowledge of the Mexican Rancho Period",
    "Understanding of Interactions and Cultural Exchange"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of pre-Columbian societies in California.",
      "Shows minimal awareness of pre-Columbian societies, with significant inaccuracies.",
      "Identifies some characteristics of pre-Columbian societies but lacks depth and detail.",
      "Describes the basic social, political, cultural, and economic aspects of pre-Columbian societies with some clarity.",
      "Explains the social, political, cultural, and economic life of pre-Columbian societies in detail, showing a solid understanding.",
      "Provides a comprehensive and nuanced account of pre-Columbian societies, including their interactions and adaptations to the environment."
    ],
    [
      "Demonstrates no understanding of the Spanish mission period in California.",
      "Shows minimal awareness of the Spanish mission period, with significant inaccuracies.",
      "Identifies some aspects of the Spanish mission period but lacks depth and detail.",
      "Describes the basic social, political, cultural, and economic impacts of the Spanish missions with some clarity.",
      "Explains the social, political, cultural, and economic changes brought about by the Spanish missions, showing a solid understanding.",
      "Provides a comprehensive and nuanced account of the Spanish mission period, including its effects on indigenous populations and the environment."
    ],
    [
      "Demonstrates no understanding of the Mexican rancho period in California.",
      "Shows minimal awareness of the Mexican rancho period, with significant inaccuracies.",
      "Identifies some characteristics of the Mexican rancho period but lacks depth and detail.",
      "Describes the basic social, political, cultural, and economic aspects of the Mexican rancho period with some clarity.",
      "Explains the social, political, cultural, and economic life during the Mexican rancho period, showing a solid understanding.",
      "Provides a comprehensive and nuanced account of the Mexican rancho period, including its social hierarchy, economic activities, and cultural traditions."
    ],
    [
      "Demonstrates no understanding of the interactions and cultural exchange among different groups during this time.",
      "Shows minimal awareness of the interactions, with significant inaccuracies.",
      "Identifies some instances of interaction but lacks depth and detail.",
      "Describes basic interactions and cultural exchange among pre-Columbian societies, Spanish missions, and Mexican ranchos with some clarity.",
      "Explains the complex interactions and cultural exchange among different groups, showing a solid understanding.",
      "Provides a comprehensive and nuanced account of the interactions and cultural exchange, including the consequences for all groups involved."
    ]
  ]
}