{
  "criteria": [
    "Understanding the Geographic Spread of Christianity",
    "Knowledge of the Early Church's Role",
    "Understanding the Monasteries' Role",
    "Understanding the Context After the Fall of Rome"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the geographic areas where Christianity spread north of the Alps.",
      "Identifies only one or two geographic areas where Christianity spread with limited accuracy.",
      "Identifies some of the key geographic areas of Christian expansion but lacks detail or precision.",
      "Accurately identifies several key geographic areas and provides some context for the spread of Christianity.",
      "Clearly describes the key geographic areas and provides context of the spread, including challenges and routes.",
      "Provides a comprehensive and nuanced description of the geographic spread of Christianity, including detailed examples and analysis of its impact on local cultures."
    ],
    [
      "Shows no awareness of the early church's involvement in spreading Christianity.",
      "Mentions the early church but provides no specific details about its role.",
      "Identifies the early church as important but struggles to explain its specific contributions to the diffusion of Christianity.",
      "Describes the role of the early church with limited details, providing specific examples such as missionary work.",
      "Explains the early church's role, offering clear examples and insight into its strategies and influences.",
      "Analyzes the early church's multifaceted role, offering nuanced perspectives on its effectiveness, challenges, and lasting impacts."
    ],
    [
      "Shows no understanding of the role monasteries played in the spread of Christianity.",
      "Mentions monasteries but provides no details about their activities.",
      "Recognizes that monasteries were important but does not explain what they did to promote Christianity.",
      "Describes some functions of monasteries, such as preserving texts or providing hospitality, but does not connect them directly to the spread of Christianity.",
      "Explains the role of monasteries in spreading Christianity, citing specific examples, such as education, manuscript preservation, or agricultural innovation.",
      "Analyzes the multifaceted roles of monasteries in the diffusion of Christianity, highlighting their intellectual, economic, and social contributions."
    ],
    [
      "Demonstrates no understanding of the historical context following the fall of the Western Roman Empire.",
      "Mentions the fall of Rome but does not connect it to the spread of Christianity.",
      "Acknowledges that the fall of Rome was important but cannot explain its impact on the spread of Christianity.",
      "Describes some consequences of the fall of Rome and attempts to connect them to the spread of Christianity with limited success.",
      "Explains how the fall of Rome created opportunities and challenges for the spread of Christianity, providing clear supporting details.",
      "Analyzes the complex relationship between the fall of Rome and the spread of Christianity, offering a nuanced understanding of how political instability, social change, and cultural shifts influenced religious diffusion."
    ]
  ]
}