{
  "criteria": [
    "Understanding the Rise of Industrialization",
    "Analyzing Rural-to-Urban Migration",
    "Explaining Immigration Patterns",
    "Connecting Industrialization, Migration, and Immigration"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the rise of industrialization.",
      "Shows a limited understanding of industrialization, with significant gaps in knowledge.",
      "Identifies some factors contributing to industrialization but lacks depth in explanation.",
      "Explains the main factors leading to industrialization, such as technological advancements and availability of resources, with reasonable clarity.",
      "Analyzes the causes of industrialization, including technological innovation, resource availability, and economic policies, providing a comprehensive explanation.",
      "Critically evaluates the complex interplay of factors that led to industrialization, demonstrating a nuanced understanding of its historical context and long-term effects."
    ],
    [
      "Demonstrates no understanding of rural-to-urban migration.",
      "Shows a limited understanding of rural-to-urban migration, with significant gaps in knowledge.",
      "Identifies some factors contributing to rural-to-urban migration but lacks depth in explanation.",
      "Explains the main factors leading to rural-to-urban migration, such as economic opportunities and better living conditions, with reasonable clarity.",
      "Analyzes the causes and consequences of rural-to-urban migration, including economic opportunities, social changes, and challenges faced by migrants.",
      "Critically evaluates the complex interplay of factors that led to rural-to-urban migrations, demonstrating a nuanced understanding of its historical context and long-term effects."
    ],
    [
      "Demonstrates no understanding of immigration patterns from Southern and Eastern Europe.",
      "Shows a limited understanding of immigration patterns from Southern and Eastern Europe, with significant gaps in knowledge.",
      "Identifies some factors contributing to immigration from Southern and Eastern Europe but lacks depth in explanation.",
      "Explains the main factors leading to immigration from Southern and Eastern Europe, such as poverty, persecution, and opportunities in America, with reasonable clarity.",
      "Analyzes the causes and consequences of immigration from Southern and Eastern Europe, including economic factors, social changes, and cultural integration.",
      "Critically evaluates the complex interplay of factors that led to immigration from Southern and Eastern Europe, demonstrating a nuanced understanding of its historical context and long-term effects."
    ],
    [
      "Fails to connect industrialization, migration, and immigration.",
      "Shows a limited ability to connect these three phenomena, with significant gaps in understanding.",
      "Identifies some connections between industrialization, migration, and immigration but lacks depth in explanation.",
      "Explains the basic relationships between industrialization, migration, and immigration, such as how industrialization created jobs that attracted migrants and immigrants.",
      "Analyzes the complex relationships between industrialization, migration, and immigration, providing a comprehensive explanation of how they influenced each other.",
      "Critically evaluates the intricate connections between industrialization, migration, and immigration, demonstrating a nuanced understanding of their historical context and long-term effects on society."
    ]
  ]
}