{
  "criteria": [
    "Understanding of the Causes and Context of the Texas War for Independence",
    "Knowledge of Key Events and Figures in the Texas War for Independence and the Mexican-American War",
    "Understanding of Territorial Settlements and the Aftermath of the Wars",
    "Analysis of the Effects of the Wars on Americans, Including Mexican Americans"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes or context of the Texas War for Independence.",
      "Demonstrates a minimal understanding of the causes or context of the Texas War for Independence.",
      "Identifies some causes and contextual factors of the Texas War for Independence, but lacks depth.",
      "Explains several causes and contextual factors of the Texas War for Independence with reasonable accuracy.",
      "Analyzes the causes and context of the Texas War for Independence, demonstrating a strong understanding of the key factors.",
      "Provides a comprehensive and insightful analysis of the causes and context of the Texas War for Independence, including nuanced perspectives."
    ],
    [
      "Shows no knowledge of key events or figures in either war.",
      "Shows limited knowledge of key events or figures in either war; information is largely inaccurate.",
      "Identifies a few key events and figures, but with some inaccuracies or omissions.",
      "Describes several key events and figures from both wars with general accuracy.",
      "Explains key events and figures from both wars, demonstrating a strong understanding of their significance.",
      "Provides a detailed and nuanced account of key events and figures, demonstrating a deep understanding of their roles and impacts."
    ],
    [
      "Demonstrates no understanding of the territorial settlements or aftermath of the wars.",
      "Demonstrates a minimal understanding of territorial settlements or the aftermath of the wars.",
      "Identifies some territorial settlements and aftermath aspects, but lacks depth and accuracy.",
      "Explains several territorial settlements and aftermath aspects with reasonable accuracy.",
      "Analyzes the territorial settlements and aftermath, demonstrating a strong understanding of the key outcomes and consequences.",
      "Provides a comprehensive and insightful analysis of the territorial settlements and aftermath, including nuanced perspectives on long-term impacts."
    ],
    [
      "Shows no awareness of the effects of the wars on Americans, including Mexican Americans.",
      "Shows limited awareness of the effects of the wars, with significant inaccuracies or omissions.",
      "Identifies some effects of the wars on Americans and\/or Mexican Americans, but lacks depth.",
      "Describes several effects of the wars on Americans and Mexican Americans with general accuracy.",
      "Analyzes the effects of the wars on Americans and Mexican Americans, demonstrating a strong understanding of the social, political, and economic impacts.",
      "Provides a comprehensive and insightful analysis of the effects of the wars, including nuanced perspectives on the experiences of different groups of Americans, particularly Mexican Americans."
    ]
  ]
}