{
  "criteria": [
    "Understanding of the American Revolution's Unique Character",
    "Knowledge of the American Revolution's Spread and Global Impact",
    "Awareness of the American Revolution's Continuing Significance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the American Revolution's unique aspects.",
      "Identifies a few basic characteristics of the American Revolution but lacks depth.",
      "Describes some unique characteristics of the American Revolution, such as its focus on individual liberty and self-government, but with limited detail.",
      "Explains several unique characteristics of the American Revolution and provides some context.",
      "Analyzes the unique characteristics of the American Revolution, comparing it to other revolutions and explaining its distinctive features in detail.",
      "Provides a comprehensive and insightful analysis of the American Revolution's unique character, demonstrating a nuanced understanding of its political, social, and economic factors."
    ],
    [
      "Shows no awareness of the American Revolution's influence beyond the United States.",
      "Suggests that the American Revolution may have had some impact on other countries, but without specifics.",
      "Identifies one or two examples of how the American Revolution influenced other parts of the world.",
      "Describes how the American Revolution influenced political thought and movements in other nations.",
      "Explains the American Revolution's influence on specific events and movements in other parts of the world, providing examples and context.",
      "Analyzes the multifaceted ways in which the American Revolution spread to and influenced other nations, including its impact on political expectations for self-government and individual liberty worldwide."
    ],
    [
      "Does not recognize any continuing significance of the American Revolution.",
      "Suggests that the American Revolution is important for Americans but does not explain why.",
      "Identifies one or two ways in which the American Revolution remains relevant today.",
      "Explains the continuing significance of the American Revolution in terms of its ideals and principles.",
      "Analyzes the American Revolution's continuing significance to other nations, connecting its ideals to contemporary political movements and aspirations.",
      "Evaluates the complex and enduring legacy of the American Revolution, demonstrating a deep understanding of its continuing significance to both the United States and other nations in the 21st century."
    ]
  ]
}