{
  "criteria": [
    "Understanding of the context and causes leading to the Armenian Genocide.",
    "Knowledge of the key events and actions during the Armenian Genocide.",
    "Analysis of the human rights violations and the scale\/scope of the genocide.",
    "Evaluation of the Ottoman government's role and responsibility in the Armenian Genocide."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context or the causes leading to the Armenian Genocide.",
      "Shows a minimal understanding of the historical context and some causes, but with significant gaps.",
      "Displays a basic understanding of the historical context and several causes, but lacks depth and detail.",
      "Exhibits a solid understanding of the historical context and the main causes of the Armenian Genocide.",
      "Demonstrates a comprehensive understanding of the historical context, including complex political and social factors contributing to the genocide.",
      "Shows an exceptional and nuanced understanding of the historical context, including intricate causes and long-term consequences of the Armenian Genocide."
    ],
    [
      "Shows no knowledge of the key events or actions that occurred during the Armenian Genocide.",
      "Identifies very few key events or actions with significant inaccuracies.",
      "Lists some key events and actions but lacks specific details and understanding.",
      "Describes the main events and actions during the genocide, demonstrating a good general knowledge.",
      "Presents a detailed and accurate account of the key events, including specific actions taken against Armenian citizens.",
      "Provides an exhaustive and precise account of the key events, including nuanced details and a sophisticated understanding of the actions taken against Armenian citizens."
    ],
    [
      "Unable to identify any human rights violations or provide any information on the scale\/scope of the genocide.",
      "Identifies one or two human rights violations with limited understanding of the scale\/scope.",
      "Recognizes several human rights violations and offers a basic description of the scale\/scope of the genocide.",
      "Analyzes multiple human rights violations and describes the scale\/scope of the genocide with reasonable accuracy.",
      "Provides a comprehensive analysis of various human rights violations, supported by evidence, and accurately portrays the scale\/scope of the genocide.",
      "Offers an insightful and thorough analysis of human rights violations, linking them to broader historical patterns, and provides a nuanced understanding of the scale\/scope and its impact."
    ],
    [
      "Unable to evaluate the role or responsibility of the Ottoman government in the Armenian Genocide.",
      "Presents a superficial evaluation with minimal supporting information.",
      "Provides a basic evaluation of the Ottoman government's role but lacks in-depth analysis.",
      "Evaluates the Ottoman government's role and provides some justification for the assessment.",
      "Offers a well-reasoned evaluation of the Ottoman government's responsibility, supported by historical evidence and context.",
      "Presents a sophisticated and nuanced evaluation of the Ottoman government’s role, considering multiple perspectives and complex factors, supported by extensive evidence."
    ]
  ]
}