{
  "criteria": [
    "Understanding the Economic Impact of the Gold Rush",
    "Understanding the Social Impact of the Gold Rush",
    "Understanding the Political Impact of the Gold Rush",
    "Understanding the Environmental Impact of the Gold Rush"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Gold Rush's economic impact.",
      "Identifies isolated economic effects of the Gold Rush with significant inaccuracies.",
      "Describes basic economic effects of the Gold Rush, such as increased trade, but lacks depth and accuracy.",
      "Explains several economic effects of the Gold Rush on California, including the growth of industries and changes in commerce, but may miss some nuances.",
      "Analyzes the economic effects of the Gold Rush, discussing the rise of industries, impact on agriculture, and changes in trade, with accurate details and examples.",
      "Provides a comprehensive analysis of the long-term economic transformations caused by the Gold Rush, including its impact on California's financial systems, infrastructure, and integration into the global economy, supported by detailed evidence."
    ],
    [
      "Demonstrates no understanding of the Gold Rush's social impact.",
      "Identifies isolated social effects of the Gold Rush with significant inaccuracies.",
      "Describes basic social effects of the Gold Rush, such as population growth, but lacks depth and accuracy.",
      "Explains several social effects of the Gold Rush on California, including demographic shifts, cultural interactions, and the emergence of new communities, but may miss some nuances.",
      "Analyzes the social effects of the Gold Rush, discussing the impact on different ethnic groups, the rise of social institutions, and changes in community structures, with accurate details and examples.",
      "Provides a comprehensive analysis of the long-term social transformations caused by the Gold Rush, including its impact on California's cultural identity, social inequalities, and development of diverse communities, supported by detailed evidence."
    ],
    [
      "Demonstrates no understanding of the Gold Rush's political impact.",
      "Identifies isolated political effects of the Gold Rush with significant inaccuracies.",
      "Describes basic political effects of the Gold Rush, such as the push for statehood, but lacks depth and accuracy.",
      "Explains several political effects of the Gold Rush on California, including the development of state governance, legal systems, and political conflicts, but may miss some nuances.",
      "Analyzes the political effects of the Gold Rush, discussing the impact on statehood, governance structures, and political ideologies, with accurate details and examples.",
      "Provides a comprehensive analysis of the long-term political transformations caused by the Gold Rush, including its impact on California's role in national politics, legal precedents, and the development of its unique political culture, supported by detailed evidence."
    ],
    [
      "Demonstrates no understanding of the Gold Rush's environmental impact.",
      "Identifies isolated environmental effects of the Gold Rush with significant inaccuracies.",
      "Describes basic environmental effects of the Gold Rush, such as mining's impact on land, but lacks depth and accuracy.",
      "Explains several environmental effects of the Gold Rush on California, including deforestation, river pollution, and habitat destruction, but may miss some nuances.",
      "Analyzes the environmental effects of the Gold Rush, discussing the impact on ecosystems, resource depletion, and early conservation efforts, with accurate details and examples.",
      "Provides a comprehensive analysis of the long-term environmental transformations caused by the Gold Rush, including its impact on California's landscape, biodiversity, and the development of environmental policies, supported by detailed evidence."
    ]
  ]
}