{
  "criteria": [
    "Understanding of Population Growth during the Industrial Revolution",
    "Analysis of Rural to Urban Migration",
    "Knowledge of the Growth of Cities",
    "Connections Between Population Growth, Migration, and Urbanization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of population growth during the Industrial Revolution.",
      "Shows minimal understanding of population growth with significant inaccuracies.",
      "Identifies population growth but lacks specific details or explanations.",
      "Describes population growth and provides some basic details about its causes and consequences.",
      "Explains population growth with clear details about factors such as increased food production and declining death rates.",
      "Provides a comprehensive analysis of population growth, including statistical data and insightful explanations of its impact on society."
    ],
    [
      "Demonstrates no understanding of rural to urban migration.",
      "Shows minimal understanding of rural to urban migration with significant inaccuracies.",
      "Identifies rural to urban migration but lacks specific details or explanations.",
      "Describes rural to urban migration and provides some basic details about its causes and consequences.",
      "Explains rural to urban migration with clear details about factors such as job opportunities and urbanization.",
      "Provides a comprehensive analysis of rural to urban migration, including its social and economic effects on both rural and urban areas."
    ],
    [
      "Demonstrates no knowledge of the growth of cities during the Industrial Revolution.",
      "Shows minimal knowledge of the growth of cities with significant inaccuracies.",
      "Identifies the growth of cities but lacks specific details or explanations.",
      "Describes the growth of cities and provides some basic details about its causes and consequences.",
      "Explains the growth of cities with clear details about factors such as industrialization and infrastructure development.",
      "Provides a comprehensive analysis of the growth of cities, including discussions of urban planning, social challenges, and technological advancements."
    ],
    [
      "Fails to make any connections between population growth, migration, and urbanization.",
      "Attempts to connect the concepts but demonstrates a weak understanding of their relationships.",
      "Identifies some connections between the concepts but lacks depth in explanation.",
      "Describes how population growth, migration, and urbanization are related, providing some supporting details.",
      "Explains the complex relationships between population growth, migration, and urbanization with clear examples and reasoning.",
      "Provides a sophisticated analysis of the interconnectedness of population growth, migration, and urbanization, demonstrating a deep understanding of their combined impact on society and the environment."
    ]
  ]
}