{
  "criteria": [
    "Understanding of Basic Labor Market Elements",
    "Analysis of U.S. Labor Market in a Global Context",
    "Identification of Factors Affecting the Labor Market"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of labor market elements such as supply, demand, wages, and employment.",
      "Identifies very few labor market elements with significant inaccuracies.",
      "Identifies some labor market elements but struggles to define them accurately.",
      "Identifies and defines basic labor market elements with minor inaccuracies.",
      "Clearly identifies and accurately defines key labor market elements.",
      "Demonstrates a comprehensive understanding of labor market elements with precise definitions and insightful explanations."
    ],
    [
      "Fails to connect the U.S. labor market to the global setting.",
      "Attempts to connect the U.S. labor market to the global setting but with significant misunderstandings.",
      "Describes some connections between the U.S. labor market and the global setting, but lacks depth.",
      "Analyzes the U.S. labor market within a global context with some supporting evidence.",
      "Provides a well-reasoned analysis of the U.S. labor market in a global setting, using relevant examples.",
      "Offers a sophisticated and nuanced analysis of the U.S. labor market in a global setting, demonstrating a deep understanding of the interconnectedness and providing compelling evidence."
    ],
    [
      "Does not identify any factors influencing the U.S. labor market.",
      "Identifies very few factors influencing the labor market and struggles to explain their impact.",
      "Identifies some factors influencing the labor market but with limited explanation of their effects.",
      "Identifies and explains several factors (e.g., technology, trade, immigration) influencing the labor market.",
      "Clearly identifies and explains multiple factors and their complex interactions within the labor market.",
      "Provides an exhaustive and insightful analysis of various factors and their intricate relationships, demonstrating a comprehensive understanding of the dynamics affecting the U.S. labor market."
    ]
  ]
}