{
  "criteria": [
    "Understanding of Key Civil Rights Legislation",
    "Analysis of the Development of Federal Civil Rights and Voting Rights",
    "Connections to Contemporary Issues"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of civil rights or voting rights legislation.",
      "Shows minimal understanding of the legislation with significant inaccuracies.",
      "Identifies some key pieces of legislation but struggles to explain their impact.",
      "Explains several key pieces of legislation and their intended impact, but may miss some nuances.",
      "Clearly explains the key pieces of civil rights and voting rights legislation, including their intended impact and some of the challenges in their implementation.",
      "Provides a comprehensive and nuanced explanation of key civil rights and voting rights legislation, including their historical context, intended impact, and ongoing significance."
    ],
    [
      "Presents no analysis of the development of civil rights and voting rights.",
      "Offers a superficial or inaccurate account of the development of these rights.",
      "Identifies some key events in the development but struggles to connect them or explain their significance.",
      "Explains the development of federal civil rights and voting rights with some analysis of the causes and effects.",
      "Presents a clear analysis of the development of civil rights and voting rights, including the key events, figures, and factors that shaped their evolution.",
      "Offers a sophisticated and insightful analysis of the development of civil rights and voting rights, demonstrating a deep understanding of the complex factors and historical context involved."
    ],
    [
      "Makes no connections to contemporary issues related to civil rights and voting rights.",
      "Attempts to connect to contemporary issues, but connections are vague or unsubstantiated.",
      "Identifies a contemporary issue related to civil rights or voting rights.",
      "Explains a relevant contemporary issue in the context of historical civil rights and voting rights.",
      "Analyzes a contemporary issue related to civil rights or voting rights, drawing direct parallels to the historical development of these rights.",
      "Provides a comprehensive analysis of a contemporary issue related to civil rights or voting rights, exploring its historical roots, current implications, and potential future developments."
    ]
  ]
}