{
  "criteria": [
    "Identification of Similarities and Differences: Demonstrates the ability to identify similarities and differences between earlier generations and the present in areas such as work, dress, manners, stories, games, and festivals.",
    "Use of Source Material: Effectively uses biographies, oral histories, and folklore to support comparisons and contrasts.",
    "Contextual Understanding: Demonstrates an understanding of the historical context and its influence on the similarities and differences identified."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify any similarities or differences between past and present generations.",
      "Identifies only one area (e.g., work, dress) of similarity or difference with limited detail.",
      "Identifies similarities or differences in at least two areas with some detail, but lacks depth in analysis.",
      "Identifies similarities and differences in at least three areas, providing reasonable detail and examples from biographies, oral histories, or folklore.",
      "Identifies similarities and differences in at least four areas, providing specific details and examples, and demonstrating a good understanding of the context.",
      "Identifies similarities and differences across multiple areas, providing detailed examples from various sources, and demonstrating insightful analysis of the continuities and changes over time."
    ],
    [
      "Does not use or reference any source materials (biographies, oral histories, folklore).",
      "Attempts to use source material, but it is irrelevant or inaccurately presented.",
      "Uses one type of source material (e.g., a biography) but does not integrate it effectively into the comparison.",
      "Uses two types of source materials to support comparisons, with reasonable integration and citation.",
      "Effectively uses multiple source materials, providing clear citations and integrating the information to support analysis.",
      "Masterfully uses a variety of source materials to provide a rich and nuanced comparison, demonstrating excellent research and analytical skills."
    ],
    [
      "Shows no understanding of the historical context influencing the lives of earlier generations.",
      "Demonstrates a minimal understanding of historical context; inaccuracies may be present.",
      "Acknowledges some historical context but does not clearly connect it to the identified similarities and differences.",
      "Connects historical context to the similarities and differences in a clear and logical manner.",
      "Explains how historical context influenced the identified similarities and differences, demonstrating a solid understanding of cause and effect.",
      "Provides a sophisticated analysis of how historical context shapes both the continuities and changes in various aspects of life, demonstrating deep insight."
    ]
  ]
}