{
  "criteria": [
    "Understanding of Federalism and Separation of Powers",
    "Identification of Conflict Resolution Mechanisms",
    "Application to Real-World Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of federalism or the separation of powers within the government.",
      "Student shows a minimal understanding of federalism or separation of powers, with significant inaccuracies.",
      "Student identifies federalism and separation of powers but struggles to explain their roles in resolving conflicts.",
      "Student adequately explains federalism and separation of powers and their basic functions in conflict resolution.",
      "Student clearly explains federalism and separation of powers, demonstrating a good understanding of their importance in resolving governmental conflicts.",
      "Student comprehensively explains federalism and separation of powers, demonstrating a deep understanding of their nuanced roles in resolving complex governmental conflicts, including historical context."
    ],
    [
      "Student cannot identify any mechanisms for resolving conflicts between levels or branches of government.",
      "Student vaguely mentions one or two mechanisms but cannot explain how they work.",
      "Student identifies a few conflict resolution mechanisms (e.g., judicial review, negotiation) but struggles to explain them clearly.",
      "Student identifies and explains several mechanisms used to resolve conflicts, such as judicial review, legislative action, and executive orders.",
      "Student thoroughly explains various conflict resolution mechanisms and provides relevant examples of their application.",
      "Student provides a comprehensive analysis of multiple conflict resolution mechanisms, including their strengths, limitations, and historical impact on specific conflicts."
    ],
    [
      "Student does not provide any real-world examples of conflicts or their resolutions.",
      "Student attempts to provide an example but it is inaccurate or irrelevant.",
      "Student provides a basic example of a conflict but struggles to explain how it was resolved.",
      "Student provides a relevant example of a conflict and explains the basic steps taken to resolve it.",
      "Student provides a detailed example of a conflict, explaining the roles of different governmental bodies and the mechanisms used to reach a resolution.",
      "Student provides a sophisticated analysis of a complex conflict, demonstrating a nuanced understanding of the legal, political, and social factors that influenced its resolution. They analyze the effectiveness of the mechanisms used and propose alternative solutions."
    ]
  ]
}