{
  "criteria": [
    "Understanding of Capitalism's Rise",
    "Analysis of Economic Problems and Conflicts",
    "Understanding of Supreme Court's Role",
    "Use of Evidence and Historical Context"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the rise of capitalism in the context of the new nation.",
      "Shows a limited or inaccurate understanding of capitalism's emergence.",
      "Identifies capitalism as an emerging economic system but lacks specific details or historical context.",
      "Explains the basic principles of capitalism and its initial growth in the new nation, but misses key factors.",
      "Analyzes the key factors contributing to the rise of capitalism, providing relevant details and examples.",
      "Provides a comprehensive analysis of the rise of capitalism, including its underlying principles, key figures, and contributing factors, demonstrating a deep understanding."
    ],
    [
      "Fails to identify any economic problems or conflicts associated with the rise of capitalism.",
      "Identifies economic problems or conflicts vaguely, without specific examples or details.",
      "Lists one or two economic problems or conflicts but doesn't explain their connection to capitalism.",
      "Describes some economic problems and conflicts, such as Jackson's opposition to the National Bank, but lacks deeper analysis.",
      "Analyzes the economic problems and conflicts, providing specific examples and explaining their relationship to the rise of capitalism.",
      "Offers a nuanced analysis of various economic problems and conflicts, demonstrating a thorough understanding of their causes, consequences, and connections to the evolving capitalist system."
    ],
    [
      "Shows no understanding of the U.S. Supreme Court's role in shaping the economic system.",
      "Mentions the Supreme Court but doesn't connect its decisions to capitalism or contracts.",
      "Identifies the Supreme Court as a government institution but doesn't explain its impact on the economy.",
      "Describes how the Supreme Court made decisions related to contracts but doesn't fully explain the implications.",
      "Explains how early Supreme Court decisions reinforced the sanctity of contracts and supported a capitalist economic system.",
      "Provides a comprehensive analysis of the Supreme Court's early decisions, explaining how they shaped the legal framework for capitalism and influenced economic development."
    ],
    [
      "Provides no evidence or historical context to support claims.",
      "Offers minimal evidence or historical context, which may be inaccurate or irrelevant.",
      "Uses some evidence and historical context but lacks depth or specific details.",
      "Provides relevant evidence and historical context to support claims about capitalism and its conflicts.",
      "Supports analysis with well-chosen evidence and historical context, demonstrating a strong command of the material.",
      "Uses a wide range of evidence and historical context to craft a compelling and insightful argument about capitalism's rise and its impact on the new nation."
    ]
  ]
}