{
  "criteria": [
    "Understanding the conditions that led to the rise of totalitarian regimes.",
    "Knowledge of key figures and characteristics of totalitarian governments.",
    "Analysis of the impact of totalitarian regimes on society and individuals."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the post-WWI conditions.",
      "Identifies one or two conditions that may have contributed, but explanation lacks depth.",
      "Identifies several conditions (economic hardship, political instability) but doesn't fully explain their impact.",
      "Explains the role of economic hardship and political instability in creating an environment ripe for totalitarianism.",
      "Analyzes the complex interplay of economic, social, and political factors that contributed to the rise of totalitarian regimes.",
      "Provides a nuanced analysis of the multifaceted conditions, including specific examples and insightful connections between factors."
    ],
    [
      "Unable to name any key figures or characteristics.",
      "Names one or two key figures OR characteristics, but with inaccuracies.",
      "Identifies several figures (Mussolini, Stalin) and\/or characteristics (one-party rule, propaganda) but lacks detail.",
      "Accurately names key figures AND characteristics of totalitarian regimes with basic descriptions.",
      "Provides detailed descriptions of key figures and characteristics, explaining their significance and impact.",
      "Offers an in-depth analysis of key figures and characteristics, connecting them to specific regimes and historical events, demonstrating a comprehensive understanding."
    ],
    [
      "Shows no awareness of the impact.",
      "States that there was an impact but provides no specifics.",
      "Identifies basic impacts such as loss of freedom or oppression but without elaboration.",
      "Explains how totalitarian regimes affected daily life, including restrictions on freedom and the use of propaganda.",
      "Analyzes the social, cultural, and economic consequences of totalitarian rule, providing specific examples.",
      "Offers a sophisticated analysis of the long-term and far-reaching consequences of totalitarianism, connecting it to contemporary issues and historical patterns, with strong supporting evidence."
    ]
  ]
}