{
  "criteria": [
    "Understanding the Origins of the Ku Klux Klan",
    "Describing the Activities and Methods of the KKK",
    "Analyzing the Effects and Consequences of the KKK"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the KKK's origins or historical context.",
      "Shows minimal understanding of the KKK's origins, with significant inaccuracies.",
      "Identifies the KKK's origins but lacks depth in explaining the Reconstruction era context.",
      "Explains the KKK's emergence during Reconstruction, mentioning some contributing factors.",
      "Clearly explains the KKK's origins within the context of Reconstruction, detailing key motivations and social conditions.",
      "Provides a comprehensive analysis of the KKK's origins, thoroughly explaining the Reconstruction era context and the complex interplay of factors that led to its rise."
    ],
    [
      "Unable to describe any of the KKK's activities or methods.",
      "Describes KKK activities with significant inaccuracies or generalizations.",
      "Identifies a few KKK activities but lacks detail or specific examples.",
      "Describes several KKK activities and methods, providing some context.",
      "Clearly describes the KKK's activities and methods, providing specific examples of violence and intimidation.",
      "Provides a detailed and nuanced account of the KKK's activities, including specific methods of violence, intimidation, and political influence, with a clear understanding of their impact."
    ],
    [
      "Demonstrates no understanding of the KKK's effects or consequences.",
      "Shows minimal understanding of the KKK's effects, with significant inaccuracies.",
      "Identifies some effects of the KKK but lacks depth or supporting evidence.",
      "Explains several effects and consequences of the KKK on individuals and communities.",
      "Clearly analyzes the KKK's effects on African Americans, the political landscape, and social structures during Reconstruction.",
      "Provides a comprehensive analysis of the KKK's lasting consequences, including its impact on racial inequality, political disenfranchisement, and social divisions, with insightful connections to contemporary issues."
    ]
  ]
}