{
  "criteria": [
    "Understanding of the Roman Republic's Government Structure",
    "Significance of the Written Constitution and Tripartite Government",
    "Application of Checks and Balances",
    "Awareness of Civic Duty"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Roman Republic's government structure.",
      "Shows minimal understanding of the Roman Republic's government structure, with significant inaccuracies.",
      "Displays a basic understanding of the Roman Republic's government structure, but lacks detail and clarity.",
      "Exhibits a satisfactory understanding of the Roman Republic's government structure, including key components like the Senate and assemblies.",
      "Presents a strong understanding of the Roman Republic's government structure, including the roles of different branches and officials.",
      "Demonstrates a comprehensive and nuanced understanding of the Roman Republic's government structure, including its evolution and complexities."
    ],
    [
      "Does not recognize the significance of a written constitution or tripartite government in the Roman Republic.",
      "Shows limited awareness of the importance of a written constitution and tripartite government.",
      "Acknowledges the existence of a written constitution and tripartite government but does not explain their significance.",
      "Explains the basic significance of a written constitution and tripartite government in maintaining order and preventing tyranny.",
      "Analyzes the significance of a written constitution and tripartite government in promoting stability, justice, and representation in the Roman Republic.",
      "Evaluates the long-term impact and significance of a written constitution and tripartite government on the development of legal and political systems, drawing comparisons to modern systems."
    ],
    [
      "Does not understand the concept of checks and balances in the Roman Republic.",
      "Shows a vague understanding of checks and balances but cannot provide specific examples.",
      "Identifies checks and balances but struggles to explain how they functioned in practice.",
      "Describes how checks and balances operated between different branches of the Roman government.",
      "Explains the effectiveness of checks and balances in preventing abuse of power and maintaining political stability.",
      "Critically analyzes the strengths and limitations of the checks and balances system in the Roman Republic, considering its impact on different social groups."
    ],
    [
      "Shows no awareness of the concept of civic duty in the Roman Republic.",
      "Demonstrates a superficial understanding of civic duty.",
      "Defines civic duty but provides limited examples of its manifestation in Roman society.",
      "Explains the importance of civic duty in maintaining the Roman Republic, citing examples such as voting, military service, and public service.",
      "Analyzes the role of civic duty in promoting social cohesion and political participation in the Roman Republic.",
      "Evaluates the extent to which civic duty was upheld in the Roman Republic, considering factors such as social class, political corruption, and individual ambition."
    ]
  ]
}