{
  "criteria": [
    "Understanding of Reconstruction's Goals and Plans",
    "Analysis of the Impact on Different Groups",
    "Knowledge of Reconstruction's Failure",
    "Understanding of Lasting Consequences and their Relevance Today"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the goals or plans for Reconstruction.",
      "Shows minimal awareness of Reconstruction's goals, with significant inaccuracies.",
      "Identifies some goals of Reconstruction but struggles to explain the plans to achieve them.",
      "Describes the main goals and plans of Reconstruction with general accuracy.",
      "Explains the goals and specific plans of Reconstruction, including political, social, and economic aspects.",
      "Provides a comprehensive analysis of Reconstruction's goals and plans, including the motivations behind them and the various approaches taken."
    ],
    [
      "Shows no understanding of how Reconstruction affected different groups (e.g., formerly enslaved people, Southern landowners, etc.).",
      "Demonstrates minimal awareness of Reconstruction's impact, with significant inaccuracies or omissions.",
      "Identifies a few ways Reconstruction affected some groups, but misses key impacts or groups.",
      "Describes how Reconstruction affected several different groups, including both positive and negative impacts.",
      "Analyzes the impact of Reconstruction on various groups, explaining both intended and unintended consequences.",
      "Provides a nuanced and detailed analysis of Reconstruction's impact on different groups, considering diverse perspectives and long-term effects."
    ],
    [
      "Demonstrates no understanding of Reconstruction's ultimate failure.",
      "Shows minimal awareness of the reasons Reconstruction failed, with significant inaccuracies.",
      "Identifies one or two reasons for the failure of Reconstruction, but lacks depth or supporting evidence.",
      "Explains several reasons for Reconstruction's failure, such as political resistance, economic challenges, and social tensions.",
      "Analyzes the complex factors that led to Reconstruction's failure, including the roles of different groups and institutions.",
      "Provides a comprehensive and insightful analysis of the multifaceted reasons for Reconstruction's failure, considering both short-term and long-term causes."
    ],
    [
      "Shows no understanding of the lasting consequences of Reconstruction or their relevance to contemporary society.",
      "Demonstrates minimal awareness of the lasting consequences of Reconstruction, with significant inaccuracies or omissions.",
      "Identifies a few lasting consequences of Reconstruction, but does not connect them to contemporary issues.",
      "Explains several lasting consequences of Reconstruction, such as continued racial inequality and political divisions.",
      "Analyzes the lasting consequences of Reconstruction and their relevance to contemporary issues like civil rights and social justice.",
      "Provides a nuanced and insightful analysis of the enduring consequences of Reconstruction and their deep relevance to contemporary American society."
    ]
  ]
}