{
  "criteria": [
    "Understanding of the key figures and their contributions during the Scientific Revolution (e.g., Copernicus, Galileo, Newton).",
    "Analysis of the shift from traditional religious and philosophical explanations to scientific reasoning.",
    "Evaluation of the lasting effects of the Scientific Revolution on religious, political, and cultural institutions.",
    "Understanding of the scientific method and its development during the Scientific Revolution."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of key figures or their contributions.",
      "Identifies one or two key figures but struggles to explain their contributions.",
      "Identifies some key figures and provides a basic description of their contributions, but lacks depth.",
      "Identifies most key figures and accurately describes their main contributions, demonstrating a good understanding.",
      "Identifies key figures, accurately details their contributions, and explains the significance of their work in advancing scientific thought.",
      "Provides a comprehensive overview of key figures, their contributions, the significance of their work, and connects their ideas to broader scientific advancements with insightful analysis."
    ],
    [
      "Shows no understanding of the shift from traditional explanations to scientific reasoning.",
      "Mentions the conflict between traditional views and scientific reasoning but doesn't explain it clearly.",
      "Describes the shift, identifying that scientific reasoning challenged traditional views but provides limited detail.",
      "Explains how scientific reasoning challenged traditional religious and philosophical explanations with specific examples.",
      "Analyzes the shift, explaining the challenges to traditional views and the impact of scientific reasoning on society.",
      "Critically evaluates the shift, providing a nuanced understanding of the challenges to traditional views, the profound impact on society, and the long-term consequences of embracing scientific reasoning."
    ],
    [
      "Unable to identify any lasting effects of the Scientific Revolution.",
      "Identifies one or two effects without much explanation.",
      "Describes some effects on religious, political, or cultural institutions but lacks depth.",
      "Explains the effects on religious, political, and cultural institutions with some specific examples.",
      "Evaluates the lasting effects, providing a detailed analysis of the changes in religious, political, and cultural institutions.",
      "Critically evaluates the complex lasting effects, offering insightful analysis of the transformations in religious, political, and cultural institutions and their continued relevance today."
    ],
    [
      "Demonstrates no understanding of the scientific method.",
      "Has a vague idea of the scientific method but cannot explain its components.",
      "Identifies the basic steps of the scientific method but struggles to relate it to the Scientific Revolution.",
      "Explains the key components of the scientific method and how it was developed and applied during the Scientific Revolution.",
      "Analyzes the development and application of the scientific method, highlighting its impact on scientific discovery.",
      "Critically evaluates the development and impact of the scientific method, drawing connections to modern scientific practices and its broader influence on intellectual thought."
    ]
  ]
}