{
  "criteria": [
    "Understanding of Colonial Powers' Objectives",
    "Knowledge of Competition and Conflict",
    "Understanding of Indian Nations' Role",
    "Use of Specific Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the objectives of the English, French, Spanish, and Dutch in North America.",
      "Shows a limited understanding of the objectives of only one or two colonial powers.",
      "Identifies the objectives of some colonial powers but lacks depth in explanation.",
      "Describes the objectives of the major colonial powers (English, French, Spanish, Dutch) with some clarity.",
      "Explains the objectives of the English, French, Spanish, and Dutch in detail, including their motivations and goals.",
      "Provides a comprehensive analysis of the objectives of all major colonial powers, comparing and contrasting their motivations and long-term goals."
    ],
    [
      "Shows no awareness of the competition and conflict among European powers and Indian nations.",
      "Demonstrates a limited awareness of competition or conflict in one specific instance.",
      "Identifies instances of competition and conflict but provides limited details.",
      "Describes several instances of competition and conflict with some supporting details.",
      "Explains multiple instances of competition and conflict, including the key players and outcomes.",
      "Analyzes the complex web of competition and conflict among European powers and Indian nations, explaining causes, consequences, and long-term effects."
    ],
    [
      "Does not recognize the role and agency of Indian nations in the competition for North America.",
      "Acknowledges the presence of Indian nations but does not explain their role in the conflict.",
      "Describes Indian nations as passive participants in the competition.",
      "Identifies the involvement of Indian nations in the competition, naming specific alliances or conflicts.",
      "Explains the active role of various Indian nations in the competition, including their alliances, strategies, and motivations.",
      "Provides a nuanced analysis of the diverse roles and strategies employed by different Indian nations, highlighting their agency and impact on the struggle for control of North America."
    ],
    [
      "Provides no specific examples to support claims.",
      "Offers vague or general statements without specific examples.",
      "Includes one or two relevant examples but lacks detail.",
      "Uses several specific examples to illustrate competition and conflict.",
      "Effectively uses a range of specific examples to support explanations and analysis.",
      "Masterfully integrates detailed and relevant examples to create a compelling and insightful account of the competition for North America."
    ]
  ]
}