{
  "criteria": [
    "Understanding of the Reformation's Historical Developments",
    "Knowledge of Missionaries' Impact on Christianity's Diffusion",
    "Ability to Locate Missions on a World Map",
    "Analysis of Christianity's Diffusion from Europe"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical developments of the Reformation.",
      "Shows minimal understanding of the historical developments of the Reformation.",
      "Demonstrates a basic understanding of the historical developments of the Reformation, with some inaccuracies.",
      "Displays a satisfactory understanding of the historical developments of the Reformation, with minor gaps.",
      "Exhibits a strong understanding of the historical developments of the Reformation, demonstrating accuracy and depth.",
      "Demonstrates a comprehensive and nuanced understanding of the historical developments of the Reformation, including complex relationships and long-term impacts."
    ],
    [
      "Shows no awareness of missionaries or their role in spreading Christianity.",
      "Has limited knowledge of missionaries and their impact on Christianity's diffusion.",
      "Demonstrates a basic understanding of missionaries' role in spreading Christianity, with some omissions.",
      "Displays a satisfactory knowledge of missionaries' impact on Christianity's diffusion, with minor inaccuracies.",
      "Exhibits a strong understanding of missionaries' impact on the diffusion of Christianity, accurately describing their influence.",
      "Demonstrates a comprehensive understanding of the multifaceted impact of missionaries on Christianity's diffusion, including both positive and negative consequences."
    ],
    [
      "Cannot locate any missions on a world map.",
      "Can locate only a few missions on a world map, with significant errors.",
      "Can locate some missions on a world map, with several inaccuracies.",
      "Can locate most missions on a world map, with only minor errors.",
      "Can accurately locate most missions on a world map.",
      "Can accurately locate a wide range of missions on a world map and explain their geographical significance."
    ],
    [
      "Provides no analysis of Christianity's diffusion from Europe.",
      "Offers a minimal analysis of Christianity's diffusion from Europe, lacking depth.",
      "Presents a basic analysis of Christianity's diffusion from Europe, with some oversimplifications.",
      "Delivers a satisfactory analysis of Christianity's diffusion from Europe, with minor gaps.",
      "Exhibits a strong analysis of Christianity's diffusion from Europe, demonstrating insights into the process.",
      "Provides a comprehensive and insightful analysis of Christianity's diffusion from Europe, including nuanced explanations of the contributing factors."
    ]
  ]
}