{
  "criteria": [
    "Understanding of Biddy Mason's life and contributions to early California",
    "Connection to broader themes of California history during the specified period (establishment of the Bear Flag Republic through statehood).",
    "Use of supporting evidence and historical accuracy."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Biddy Mason's life or her contributions.",
      "Demonstrates minimal understanding of Biddy Mason's life, with significant inaccuracies.",
      "Identifies a few basic facts about Biddy Mason's life but lacks depth and detail.",
      "Describes Biddy Mason's life and contributions with some accuracy but may miss key details or context.",
      "Explains Biddy Mason's life and her major contributions to early California with good accuracy and relevant details.",
      "Provides a comprehensive and insightful explanation of Biddy Mason's life, highlighting her significant contributions and placing them in the context of early California history."
    ],
    [
      "Fails to connect Biddy Mason's life to any broader themes of California history.",
      "Attempts to connect Biddy Mason to California history, but the connection is weak or inaccurate.",
      "Makes a superficial connection between Biddy Mason's life and one aspect of early California history.",
      "Connects Biddy Mason's life to several aspects of early California history, demonstrating some understanding of the period.",
      "Effectively connects Biddy Mason's life to key themes and events in early California history, showing a solid understanding of the historical context.",
      "Skillfully integrates Biddy Mason's story into a nuanced discussion of economic, social, and political life in California during the specified period, demonstrating a deep understanding of historical complexities."
    ],
    [
      "Presents information with no supporting evidence and\/or significant historical inaccuracies.",
      "Provides minimal supporting evidence, and\/or contains several historical inaccuracies.",
      "Includes some supporting evidence, but may have some inaccuracies.",
      "Supports claims with generally accurate evidence, though some minor inaccuracies may be present.",
      "Uses accurate and relevant evidence to support claims, demonstrating good attention to historical detail.",
      "Presents a well-researched and historically accurate account, using compelling evidence to support all claims and demonstrating a sophisticated understanding of historical sources."
    ]
  ]
}