{
  "criteria": [
    "Understanding the Effects of the Civil War and Reconstruction",
    "Analyzing the Impact of the Industrial Revolution",
    "Understanding Demographic Shifts",
    "Analyzing the Emergence of the US as a World Power"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the effects of the Civil War and Reconstruction.",
      "Shows a minimal understanding of one or two effects of the Civil War or Reconstruction.",
      "Identifies some effects of the Civil War and Reconstruction, but lacks depth and detail.",
      "Explains several effects of the Civil War and Reconstruction with some supporting details.",
      "Analyzes the significant effects of the Civil War and Reconstruction, providing clear examples and explanations.",
      "Provides a comprehensive analysis of the far-reaching effects of the Civil War and Reconstruction, demonstrating a deep understanding of their historical significance."
    ],
    [
      "Demonstrates no understanding of the impact of the Industrial Revolution.",
      "Shows a minimal understanding of one or two aspects of the Industrial Revolution.",
      "Identifies some impacts of the Industrial Revolution, but lacks depth and detail.",
      "Explains several impacts of the Industrial Revolution with some supporting details.",
      "Analyzes the significant impacts of the Industrial Revolution, providing clear examples and explanations.",
      "Provides a comprehensive analysis of the profound impacts of the Industrial Revolution, demonstrating a deep understanding of its transformative effects."
    ],
    [
      "Demonstrates no understanding of demographic shifts during this period.",
      "Shows a minimal understanding of one or two demographic shifts.",
      "Identifies some demographic shifts, but lacks depth and detail.",
      "Explains several demographic shifts with some supporting details.",
      "Analyzes the significant demographic shifts, providing clear examples and explanations.",
      "Provides a comprehensive analysis of the complex demographic shifts, demonstrating a deep understanding of their causes and consequences."
    ],
    [
      "Demonstrates no understanding of the emergence of the US as a world power.",
      "Shows a minimal understanding of one or two factors contributing to the US's rise.",
      "Identifies some factors contributing to the US's rise, but lacks depth and detail.",
      "Explains several factors contributing to the US's rise with some supporting details.",
      "Analyzes the key factors that led to the emergence of the US as a world power, providing clear examples and explanations.",
      "Provides a comprehensive analysis of the complex factors contributing to the US's emergence as a world power, demonstrating a nuanced understanding of its geopolitical transformation."
    ]
  ]
}