{
  "criteria": [
    "Understanding of the Niger River's significance and its relationship to vegetation zones.",
    "Knowledge of trade goods and their importance in the Ghana and Mali empires.",
    "Understanding the growth and development of the Ghana and Mali empires."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Niger River or its relation to the vegetation zones.",
      "Shows a very limited understanding of the Niger River's location or its connection to any vegetation zones.",
      "Identifies the Niger River and some of the vegetation zones (forest, savannah, desert) but does not explain their relationship.",
      "Explains the Niger River's importance and identifies the forest, savannah, and desert zones, and offers a basic explanation of their relationship.",
      "Clearly explains the geographic relationship between the Niger River and the vegetation zones of forest, savannah, and desert, including how the river influences these zones.",
      "Provides a comprehensive explanation of the geographic relationship between the Niger River and the vegetation zones, detailing the nuances of their interactions and influences on each other."
    ],
    [
      "Shows no awareness of any trade goods or their significance in the Ghana and Mali empires.",
      "Identifies one or two trade goods (gold, salt, food, or slaves) with no understanding of their importance.",
      "Lists several trade goods but doesn't explain their specific roles in the Ghana and Mali empires.",
      "Describes the main trade goods (gold, salt, food, slaves) and provides a basic explanation of their importance in trade networks of Ghana and Mali.",
      "Explains the significance of gold, salt, food, and slaves in the trade networks, detailing how these goods contributed to the growth and power of the Ghana and Mali empires.",
      "Offers a detailed analysis of the trade goods, explaining their economic and social impact on the Ghana and Mali empires, including the complexities and ethical considerations of the slave trade."
    ],
    [
      "Demonstrates no knowledge of the Ghana and Mali empires.",
      "Shows minimal awareness of Ghana or Mali as empires but cannot provide any details about them.",
      "Identifies Ghana and Mali as empires but offers no explanation of their growth or characteristics.",
      "Describes the Ghana and Mali empires and provides a basic overview of their growth and development.",
      "Explains the key factors that contributed to the growth of the Ghana and Mali empires, such as trade, political structures, and geographic influences.",
      "Provides an in-depth analysis of the growth and development of the Ghana and Mali empires, integrating geographic, political, economic, and social factors to explain their rise and significance in Medieval Africa."
    ]
  ]
}