{
  "criteria": [
    "Understanding of the Age of Exploration's Impact",
    "Analysis of the Enlightenment and the Age of Reason",
    "Understanding Political Changes",
    "Understanding Economic Changes"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Age of Exploration or its consequences.",
      "Shows a very limited understanding of the Age of Exploration, with significant inaccuracies.",
      "Identifies the Age of Exploration but struggles to explain its political and economic impacts with some accuracy.",
      "Explains some political and economic impacts of the Age of Exploration, such as mercantilism and the rise of European powers.",
      "Analyzes the political and economic transformations during the Age of Exploration, including colonialism and trade networks.",
      "Provides a comprehensive analysis of the profound political and economic changes triggered by the Age of Exploration, including its long-term effects on global power dynamics."
    ],
    [
      "Shows no recognition of the Enlightenment or the Age of Reason.",
      "Displays minimal awareness of the Enlightenment and Age of Reason, with major misconceptions.",
      "Identifies the Enlightenment and Age of Reason but cannot adequately explain their core ideas or impacts.",
      "Explains some key ideas from the Enlightenment and Age of Reason, such as natural rights and separation of powers.",
      "Analyzes the political and economic impacts of Enlightenment thought, including revolutions and the rise of capitalism.",
      "Offers a sophisticated analysis of how the Enlightenment and Age of Reason reshaped political and economic systems, fostering new ideologies and challenging existing norms with supporting evidence."
    ],
    [
      "Demonstrates no understanding of political changes during the period.",
      "Shows a very limited understanding of political changes, with significant inaccuracies.",
      "Identifies some political events but struggles to explain their significance.",
      "Explains some political shifts, such as the rise of nation-states and constitutional monarchies.",
      "Analyzes the political transformations, including revolutions and reforms, and their causes and effects.",
      "Provides a comprehensive analysis of the political restructuring, including the emergence of new ideologies and power structures, supported by relevant examples."
    ],
    [
      "Demonstrates no understanding of economic changes during the period.",
      "Shows a very limited understanding of economic changes, with significant inaccuracies.",
      "Identifies some economic developments but struggles to explain their significance.",
      "Explains some economic shifts, such as the growth of trade and the development of mercantilism.",
      "Analyzes the economic transformations, including the rise of capitalism and industrialization, and their causes and effects.",
      "Provides a comprehensive analysis of the economic restructuring, including the emergence of new economic theories and global trade networks, supported by detailed evidence."
    ]
  ]
}