{
  "criteria": [
    "Understanding of the causes and motivations behind the uprisings in Poland (1952), Hungary (1956), and Czechoslovakia (1968).",
    "Knowledge of the key events and figures involved in the uprisings in Poland (1952), Hungary (1956), and Czechoslovakia (1968).",
    "Explanation of the resurgence in Poland, Hungary, and Czechoslovakia in the 1970s and 1980s and the factors that contributed to it.",
    "Analysis of the impact of Soviet control on the populations of Poland, Hungary, and Czechoslovakia, and the consequences of the uprisings."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the causes or motivations behind the uprisings.",
      "The student shows minimal understanding, with significant inaccuracies or omissions regarding the causes and motivations.",
      "The student identifies some causes and motivations but lacks depth or clarity in their explanation.",
      "The student accurately identifies several causes and motivations for the uprisings, demonstrating a basic understanding of the historical context.",
      "The student provides a clear and comprehensive explanation of the causes and motivations behind the uprisings, demonstrating a strong understanding of the historical context.",
      "The student offers a nuanced and insightful analysis of the causes and motivations, connecting them to broader themes of Soviet control and the desire for freedom."
    ],
    [
      "The student is unable to recall any key events or figures associated with the uprisings.",
      "The student recalls one or two isolated events or figures, but with significant inaccuracies or omissions.",
      "The student identifies a few key events and figures, but lacks detail or context.",
      "The student accurately describes several key events and figures involved in the uprisings, demonstrating a basic understanding of the historical timeline.",
      "The student provides a detailed and comprehensive account of the key events and figures, demonstrating a strong understanding of the historical timeline and the roles of different actors.",
      "The student offers a sophisticated analysis of the key events and figures, connecting them to broader themes of political resistance and social change."
    ],
    [
      "The student demonstrates no understanding of the resurgence in these countries.",
      "The student shows minimal understanding, with significant inaccuracies or omissions regarding the resurgence and its causes.",
      "The student identifies some factors contributing to the resurgence, but lacks depth or clarity in their explanation.",
      "The student accurately identifies several factors contributing to the resurgence, demonstrating a basic understanding of the political and social changes that occurred.",
      "The student provides a clear and comprehensive explanation of the factors contributing to the resurgence, demonstrating a strong understanding of the political and social changes that occurred and their impact on these countries.",
      "The student offers a nuanced and insightful analysis of the factors contributing to the resurgence, connecting them to broader themes of economic reform, political liberalization, and the decline of Soviet influence."
    ],
    [
      "The student demonstrates no understanding of the impact of Soviet control or the consequences of the uprisings.",
      "The student shows minimal understanding, with significant inaccuracies or omissions regarding the impact of Soviet control and the consequences of the uprisings.",
      "The student identifies some impacts and consequences, but lacks depth or clarity in their explanation.",
      "The student accurately identifies several impacts of Soviet control and consequences of the uprisings, demonstrating a basic understanding of the political, social, and economic effects.",
      "The student provides a clear and comprehensive explanation of the impacts of Soviet control and the consequences of the uprisings, demonstrating a strong understanding of the political, social, and economic effects on these countries.",
      "The student offers a nuanced and insightful analysis of the impacts of Soviet control and the consequences of the uprisings, connecting them to broader themes of human rights, political oppression, and the struggle for national identity."
    ]
  ]
}