{
  "criteria": [
    "Understanding of the Weakness of the Command Economy",
    "Analysis of the Burdens of Military Commitments",
    "Assessment of Resistance to Soviet Rule"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Soviet command economy.",
      "Shows a minimal understanding of the Soviet command economy, with significant gaps in knowledge.",
      "Identifies some weaknesses of the Soviet command economy but lacks depth in explanation.",
      "Explains several weaknesses of the Soviet command economy, such as lack of innovation and inefficiency, with reasonable clarity.",
      "Thoroughly explains the key weaknesses of the Soviet command economy and their impact on the Soviet Union's stability.",
      "Provides a comprehensive analysis of the Soviet command economy's failures, including detailed examples and insightful observations about its long-term unsustainability."
    ],
    [
      "Displays no awareness of the Soviet Union's military commitments.",
      "Shows a vague understanding of the Soviet Union's military spending and commitments.",
      "Identifies the Soviet Union's military commitments as a contributing factor to its collapse, without specifics.",
      "Explains how military commitments, such as the arms race and the war in Afghanistan, strained the Soviet economy.",
      "Analyzes the significant economic and social burdens placed on the Soviet Union by its extensive military commitments, providing specific examples.",
      "Offers a nuanced perspective on the multifaceted impact of Soviet military commitments, including geopolitical implications and internal dissent."
    ],
    [
      "Shows no recognition of resistance movements within the Soviet Union and satellite states.",
      "Acknowledges the existence of resistance to Soviet rule but provides no details.",
      "Identifies resistance movements in satellite states or non-Russian republics but lacks specific examples.",
      "Describes resistance movements and dissidents' activities in challenging Soviet authority.",
      "Explains how resistance movements in satellite states and non-Russian republics contributed to the weakening of the Soviet Union.",
      "Evaluates the diverse forms of resistance to Soviet rule, highlighting their interconnectedness and cumulative impact on the Soviet system's legitimacy."
    ]
  ]
}