{
  "criteria": [
    "Understanding of the Declaration's Philosophy on Individual Rights",
    "Connection between 'All men are created equal' and Individual Rights",
    "Analysis of 'Unalienable Rights' in the Declaration"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Declaration of Independence or its emphasis on individual rights.",
      "Shows minimal understanding of the Declaration of Independence, struggling to identify its core ideas about individual rights.",
      "Identifies some elements of the Declaration's philosophy regarding individual rights, but lacks depth in analysis.",
      "Explains the Declaration of Independence's emphasis on government securing individual rights with moderate clarity, but may miss nuances.",
      "Clearly analyzes the Declaration of Independence, explaining its philosophy on government and its role in protecting individual rights.",
      "Provides a comprehensive and insightful analysis of the Declaration of Independence, thoroughly explaining its philosophy on government as a means of securing individual rights, including nuanced interpretations."
    ],
    [
      "Does not recognize or make any connection between the phrase 'all men are created equal' and the concept of individual rights.",
      "Struggles to connect the phrase 'all men are created equal' with individual rights; connection is vague or unclear.",
      "Identifies a basic connection between 'all men are created equal' and individual rights, but explanation lacks detail.",
      "Explains the connection between 'all men are created equal' and individual rights with some clarity, but may not fully grasp the implications.",
      "Clearly explains how the phrase 'all men are created equal' relates to the Declaration's philosophy on individual rights and equality.",
      "Offers a sophisticated analysis of the relationship between 'all men are created equal' and individual rights, demonstrating a deep understanding of the phrase's significance in the context of the Declaration of Independence."
    ],
    [
      "Unable to identify or explain the concept of 'unalienable rights' as presented in the Declaration of Independence.",
      "Identifies 'unalienable rights' but struggles to explain what they are or why they are significant.",
      "Provides a basic explanation of 'unalienable rights' but lacks depth in understanding their origin or importance.",
      "Explains 'unalienable rights' with moderate clarity, but might not fully explore their philosophical basis or historical context.",
      "Clearly defines and explains the concept of 'unalienable rights' within the context of the Declaration of Independence.",
      "Presents a comprehensive analysis of 'unalienable rights,' exploring their philosophical origins, historical context, and enduring significance in American constitutional democracy."
    ]
  ]
}