{
  "criteria": [
    "Understanding of the events that prompted attacks on civil liberties.",
    "Analysis of the responses of organizations such as the ACLU, NAACP, and Anti-Defamation League.",
    "Clarity and coherence of explanation."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the events leading to attacks on civil liberties in the 1920s.",
      "The student demonstrates a minimal understanding, with significant gaps in knowledge of the events leading to attacks on civil liberties in the 1920s.",
      "The student identifies some of the events (e.g., Palmer Raids, Marcus Garvey movement, KKK, immigration quotas) but struggles to explain their significance or interrelation.",
      "The student accurately identifies most of the key events and provides a basic explanation of their role in prompting attacks on civil liberties.",
      "The student demonstrates a strong understanding of the key events and clearly explains how they prompted attacks on civil liberties. Student can also explain the domestic and international interests and philosophies involved.",
      "The student demonstrates a comprehensive understanding of the events, providing nuanced explanations of their causes and effects, and thoroughly analyzes the interests and philosophies that contributed to the attacks on civil liberties."
    ],
    [
      "The student is unaware of the responses from organizations such as the ACLU, NAACP and Anti-Defamation League",
      "The student mentions the existence of organizations like the ACLU, NAACP, and Anti-Defamation League but does not describe their responses.",
      "The student identifies some of the organizations and vaguely describes their responses to attacks on civil liberties.",
      "The student describes the actions of the ACLU, NAACP, and Anti-Defamation League in response to attacks on civil liberties, but with limited detail.",
      "The student analyzes the responses of the ACLU, NAACP, and Anti-Defamation League, providing specific examples of their actions and explaining their significance.",
      "The student provides an in-depth analysis of the strategies and impact of the ACLU, NAACP, and Anti-Defamation League, evaluating their effectiveness and considering the challenges they faced."
    ],
    [
      "The student's explanation is unclear, disorganized, and difficult to understand.",
      "The student's explanation lacks clarity and organization, making it difficult to follow the reasoning.",
      "The student presents information in a somewhat organized manner, but the explanation may lack clarity or coherence in certain areas.",
      "The student presents a clear and organized explanation of the topic, with logical connections between ideas.",
      "The student communicates ideas effectively, using precise language and a logical structure to present a coherent argument.",
      "The student presents a sophisticated and insightful explanation, demonstrating mastery of the subject matter through clear, concise, and compelling communication."
    ]
  ]
}