{
  "criteria": [
    "Understanding Julius Caesar's Influence",
    "Understanding Augustus' Influence",
    "Explaining the Transition from Republic to Empire",
    "Demonstrates effective use of historical evidence to support claims"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Julius Caesar's role.",
      "Identifies Julius Caesar but struggles to explain his influence.",
      "Describes Julius Caesar's role with limited detail.",
      "Explains Julius Caesar's significant actions and their impact on Rome.",
      "Analyzes Julius Caesar's influence on Rome's political landscape and transition.",
      "Provides a comprehensive analysis of Julius Caesar's strategies, motivations, and lasting impact on Rome's shift from republic to empire."
    ],
    [
      "Demonstrates no understanding of Augustus' role.",
      "Identifies Augustus but struggles to explain his influence.",
      "Describes Augustus' role with limited detail.",
      "Explains Augustus' key policies and their impact on Rome.",
      "Analyzes Augustus' influence on Rome's political structure and imperial development.",
      "Provides a comprehensive analysis of Augustus' reforms, consolidation of power, and establishment of the Roman Empire."
    ],
    [
      "Shows no understanding of Rome's transition.",
      "Identifies the transition but struggles to explain the reasons.",
      "Describes the transition with limited detail.",
      "Explains key factors leading to the transition from republic to empire.",
      "Analyzes the political, social, and economic factors that contributed to the transition.",
      "Offers a nuanced analysis of the complex factors driving Rome's transition, including the decline of republican values and the rise of autocratic rule."
    ],
    [
      "Does not use historical evidence to support claims",
      "Attempts to use historical evidence but it is irrelevant or inaccurate",
      "Uses some historical evidence, but it is not well-integrated or explained",
      "Uses relevant historical evidence to support claims, but explanation is limited",
      "Effectively uses historical evidence to support claims, with clear explanations",
      "Skillfully uses a variety of historical evidence to support claims, providing insightful analysis and interpretation"
    ]
  ]
}