{
  "criteria": [
    "Understanding the Role of Family Structures",
    "Analysis of Labor Specialization",
    "Understanding of Regional Commerce",
    "Connection Between Economic Activities and State Development"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of family structures in West African societies.",
      "Shows a minimal understanding of family structures, lacking specific details.",
      "Identifies family structures (e.g., extended families) but does not explain their importance.",
      "Explains the basic role of family structures in social organization and support networks.",
      "Analyzes the significant roles of family structures in providing social stability, transmitting cultural values, and organizing labor.",
      "Provides a comprehensive analysis of how family structures influenced social, economic, and political life, including specific examples of their impact on community development and governance."
    ],
    [
      "Shows no understanding of labor specialization in West African states.",
      "Demonstrates a vague awareness of different jobs or tasks performed by people.",
      "Identifies a few specialized jobs (e.g., farming, blacksmithing) without explaining their significance.",
      "Describes how certain tasks were specialized, leading to more efficient production of goods and services.",
      "Explains how labor specialization contributed to economic growth and the development of craft industries and trade networks.",
      "Analyzes the complex nature of labor specialization and its impact on social classes, economic interdependence, and technological advancements within West African societies."
    ],
    [
      "Shows no understanding of regional commerce in West Africa.",
      "Demonstrates a minimal understanding of trade, lacking specific details or examples.",
      "Identifies trade routes and some common goods traded (e.g., gold, salt) without explaining their broader impact.",
      "Describes the importance of regional commerce in connecting different regions and facilitating the exchange of goods and ideas.",
      "Explains how regional commerce led to the growth of cities, the accumulation of wealth, and the spread of cultural influences.",
      "Provides an in-depth analysis of the impact of regional commerce on the political power, social structures, and cultural exchanges in West Africa, including the role of key trading cities and merchants."
    ],
    [
      "Does not connect economic activities to the development of states and cities.",
      "Suggests a possible relationship but provides no supporting evidence.",
      "Lists economic activities and elements of state development separately.",
      "Shows how one or two economic activities supported state development.",
      "Explains multiple ways in which family structures, labor specialization, and\/or regional commerce supported the growth of West African states and cities.",
      "Analyzes the interconnectedness of family roles, labor specialization, and regional commerce in driving the economic engine that fueled state and city development in West Africa, providing nuanced insights into the long-term impacts."
    ]
  ]
}