{
  "criteria": [
    "Understanding of Major Debates: Assesses the student's comprehension of the significant debates during the Constitution's development.",
    "Resolution of Debates: Evaluates the student's knowledge of how these debates were ultimately resolved.",
    "Areas of Debate: Assesses the student's coverage of specific areas of debate, such as shared power, state-federal power, slavery, individual rights, and the status of American Indian nations.",
    "Connections to the Constitution: Assesses the student's capability to link the debates and their resolutions to specific aspects of the U.S. Constitution."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the major debates during the development of the Constitution.",
      "Identifies one or two major debates but lacks depth in explanation or understanding.",
      "Recognizes several major debates, providing basic descriptions of each.",
      "Explains most of the major debates with reasonable clarity and accuracy.",
      "Clearly and accurately explains the major debates, demonstrating a strong understanding of their context and significance.",
      "Provides an insightful and comprehensive analysis of the major debates, including nuances and complexities, demonstrating mastery."
    ],
    [
      "Shows no awareness of how the debates were resolved.",
      "Mentions one or two resolutions without explaining their connection to the original debates.",
      "Identifies some resolutions and attempts to link them to the relevant debates.",
      "Explains most of the resolutions clearly and accurately, connecting them to the corresponding debates.",
      "Clearly and accurately explains the resolutions, demonstrating a strong understanding of their impact and historical context.",
      "Provides an insightful and comprehensive analysis of the resolutions, including their long-term consequences and continued relevance."
    ],
    [
      "Fails to address any of the specified areas of debate.",
      "Addresses only one or two areas superficially.",
      "Touches on several areas, providing basic information about each.",
      "Covers most areas with reasonable detail and accuracy.",
      "Thoroughly covers all specified areas with clear explanations and accurate information.",
      "Provides a comprehensive and nuanced discussion of all areas, demonstrating a deep understanding of their interconnections and historical significance."
    ],
    [
      "Demonstrates no connection between the debates\/resolutions and the U.S. Constitution.",
      "Makes vague or inaccurate connections between a few debates\/resolutions and the Constitution.",
      "Identifies some connections between the debates\/resolutions and the Constitution, but explanations are limited.",
      "Clearly connects most of the debates\/resolutions to relevant aspects of the Constitution.",
      "Clearly and accurately connects all the debates\/resolutions to specific parts of the Constitution, demonstrating a strong understanding of constitutional principles.",
      "Provides an insightful analysis of the connections between the debates\/resolutions and the Constitution, demonstrating a mastery of constitutional law and history."
    ]
  ]
}