{
  "criteria": [
    "Understanding of Natural Resources: Assesses the student's comprehension of how natural resources influenced industrial development.",
    "Understanding of Entrepreneurship: Assesses the student's comprehension of how entrepreneurship influenced industrial development.",
    "Understanding of Labor: Assesses the student's comprehension of how labor influenced industrial development.",
    "Understanding of Capital: Assesses the student's comprehension of how capital influenced industrial development.",
    "Connections: Assesses the student's comprehension of how all 4 concepts are linked and the effects of the link."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the role of natural resources in industrial economies.",
      "Shows minimal awareness of natural resources but fails to connect them to industrial development.",
      "Identifies some natural resources and their general relevance to industry, but lacks specific examples.",
      "Explains the role of several natural resources in the Industrial Revolution with some specific examples.",
      "Clearly explains the significant impact of various natural resources on industrial growth, providing detailed examples.",
      "Provides a comprehensive analysis of how natural resources shaped industrial economies, including nuanced examples and consideration of regional variations."
    ],
    [
      "Demonstrates no understanding of the role of entrepreneurship in industrial economies.",
      "Shows minimal awareness of entrepreneurship but fails to connect them to industrial development.",
      "Identifies some entrepreneurs and their general relevance to industry, but lacks specific examples.",
      "Explains the role of several entrepreneurs in the Industrial Revolution with some specific examples.",
      "Clearly explains the significant impact of entrepreneurship on industrial growth, providing detailed examples.",
      "Provides a comprehensive analysis of how entrepreneurship shaped industrial economies, including nuanced examples and consideration of regional variations."
    ],
    [
      "Demonstrates no understanding of the role of labor in industrial economies.",
      "Shows minimal awareness of labor but fails to connect them to industrial development.",
      "Identifies some labor and their general relevance to industry, but lacks specific examples.",
      "Explains the role of several labor in the Industrial Revolution with some specific examples.",
      "Clearly explains the significant impact of labor on industrial growth, providing detailed examples.",
      "Provides a comprehensive analysis of how labor shaped industrial economies, including nuanced examples and consideration of regional variations."
    ],
    [
      "Demonstrates no understanding of the role of capital in industrial economies.",
      "Shows minimal awareness of capital but fails to connect them to industrial development.",
      "Identifies some capital and their general relevance to industry, but lacks specific examples.",
      "Explains the role of several capital in the Industrial Revolution with some specific examples.",
      "Clearly explains the significant impact of capital on industrial growth, providing detailed examples.",
      "Provides a comprehensive analysis of how capital shaped industrial economies, including nuanced examples and consideration of regional variations."
    ],
    [
      "Demonstrates no understanding of the connections of natural resources, entrepreneurship, labor, and capital in an industrial economy.",
      "Shows minimal awareness of the connections of natural resources, entrepreneurship, labor, and capital in an industrial economy.",
      "Identifies some connections of natural resources, entrepreneurship, labor, and capital in an industrial economy, but lacks specific examples.",
      "Explains the connections of natural resources, entrepreneurship, labor, and capital in an industrial economy with some specific examples.",
      "Clearly explains the connections of natural resources, entrepreneurship, labor, and capital in an industrial economy providing detailed examples.",
      "Provides a comprehensive analysis of how natural resources, entrepreneurship, labor, and capital shaped industrial economies, including nuanced examples and consideration of regional variations."
    ]
  ]
}