{
  "criteria": [
    "Understanding of Geographic Factors: Assesses the student's ability to explain how geography influenced the development of Medieval European civilizations.",
    "Analysis of Political Structures: Assesses the student's knowledge and analysis of the political systems and power dynamics in Medieval Europe.",
    "Evaluation of Economic Systems: Assesses the student's understanding of the economic systems that shaped Medieval European society, including trade, agriculture, and labor.",
    "Examination of Religious Influences: Assesses the student's understanding of the role of religion, particularly Christianity, in shaping Medieval European life and society.",
    "Understanding of Social Structures: Assesses the student's ability to describe and analyze the social hierarchies, roles, and daily life in Medieval European societies."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the role of geography in shaping Medieval Europe.",
      "Shows a limited understanding of geographic factors, with significant inaccuracies.",
      "Identifies some geographic influences but struggles to explain their impact on civilizations.",
      "Explains how geography influenced the development of civilizations with general accuracy.",
      "Analyzes the relationship between geography and the development of civilizations, providing specific examples.",
      "Provides a comprehensive and insightful analysis of the critical geographic factors and their lasting impact on Medieval European civilizations, demonstrating a nuanced understanding."
    ],
    [
      "Displays no understanding of political structures in Medieval Europe.",
      "Shows a very basic understanding of political structures, with major inaccuracies.",
      "Identifies some political structures but cannot explain their functions or importance.",
      "Describes the main political structures and power dynamics of Medieval Europe with some accuracy.",
      "Analyzes the functions and importance of the political systems, providing relevant examples.",
      "Presents a comprehensive and insightful analysis of political structures, power dynamics, and their impact on Medieval European civilizations, demonstrating sophisticated understanding."
    ],
    [
      "Displays no understanding of economic systems in Medieval Europe.",
      "Shows a very basic understanding of economic systems, with major inaccuracies.",
      "Identifies some economic activities but cannot explain their functions or importance.",
      "Describes the main economic activities and their impact on Medieval European society with some accuracy.",
      "Analyzes the functions and importance of the economic systems, providing relevant examples.",
      "Presents a comprehensive and insightful analysis of the economic systems, their impact on society, and their role in shaping Medieval European civilizations, demonstrating sophisticated understanding."
    ],
    [
      "Displays no understanding of religious influences in Medieval Europe.",
      "Shows a very basic understanding of religious influences, with major inaccuracies.",
      "Identifies some religious aspects but cannot explain their functions or importance.",
      "Describes the main religious influences and their impact on Medieval European society with some accuracy.",
      "Analyzes the functions and importance of religion in Medieval European life, providing relevant examples.",
      "Presents a comprehensive and insightful analysis of religious influences, their impact on society, and their role in shaping Medieval European civilizations, demonstrating sophisticated understanding."
    ],
    [
      "Displays no understanding of social structures in Medieval Europe.",
      "Shows a very basic understanding of social structures, with major inaccuracies.",
      "Identifies some social structures but cannot explain their functions or importance.",
      "Describes the main social structures and their impact on Medieval European society with some accuracy.",
      "Analyzes the functions and importance of social structures in Medieval European life, providing relevant examples.",
      "Presents a comprehensive and insightful analysis of social structures, their impact on society, and their role in shaping Medieval European civilizations, demonstrating sophisticated understanding."
    ]
  ]
}