{
  "criteria": [
    "Identification of Principal Theaters of Battle",
    "Explanation of Major Turning Points",
    "Analysis of the Importance of Geographic Factors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any of the principal theaters of battle in World War I.",
      "The student identifies one principal theater of battle but provides no supporting details.",
      "The student identifies two principal theaters of battle with limited supporting details.",
      "The student identifies three principal theaters of battle and provides basic details for each.",
      "The student identifies four principal theaters of battle and provides clear details for each, demonstrating a good understanding.",
      "The student comprehensively identifies the principal theaters of battle, providing detailed descriptions and demonstrating a deep understanding of their significance."
    ],
    [
      "The student does not identify any major turning points of World War I.",
      "The student identifies one major turning point but does not explain its significance.",
      "The student identifies one major turning point and provides a limited explanation of its significance.",
      "The student identifies two major turning points and adequately explains their significance.",
      "The student identifies three major turning points and clearly explains their significance in the context of the war.",
      "The student identifies and thoroughly explains multiple major turning points, demonstrating a comprehensive understanding of their impact on the war's course."
    ],
    [
      "The student does not discuss the impact of geographic factors on military decisions and outcomes.",
      "The student mentions geographic factors but does not explain their impact.",
      "The student briefly explains how one geographic factor influenced military decisions or outcomes.",
      "The student explains how two geographic factors influenced military decisions or outcomes with some supporting evidence.",
      "The student analyzes how multiple geographic factors (e.g., topography, waterways, distance, climate) significantly influenced military decisions and outcomes.",
      "The student provides a detailed and insightful analysis of how various geographic factors shaped military strategies and outcomes throughout World War I, demonstrating a sophisticated understanding."
    ]
  ]
}