{
  "criteria": [
    "Understanding of the Aims and Roles of World Leaders",
    "Analysis of the Treaty of Versailles and Wilson's Fourteen Points",
    "Understanding the Causes and Effects of the U.S. Rejection of the League of Nations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the aims or negotiating roles of world leaders during World War I.",
      "Student demonstrates minimal understanding, with significant inaccuracies or omissions regarding the aims and roles of world leaders.",
      "Student identifies some aims and roles of world leaders but lacks depth and detail. Contains some inaccuracies.",
      "Student accurately describes the aims and negotiating roles of several key world leaders but may miss some nuances or details.",
      "Student thoroughly explains the aims and negotiating roles of major world leaders, providing context and relevant details.",
      "Student provides a comprehensive and insightful analysis of the aims and negotiating roles of various world leaders, demonstrating a nuanced understanding of their motivations and impact."
    ],
    [
      "Student shows no understanding of the Treaty of Versailles or Wilson's Fourteen Points.",
      "Student demonstrates a superficial understanding, with significant inaccuracies or omissions regarding the terms and influence of the Treaty and the Fourteen Points.",
      "Student identifies some aspects of the Treaty and the Fourteen Points but lacks depth and detail. Contains some inaccuracies.",
      "Student accurately describes the main terms and influence of the Treaty of Versailles and Wilson's Fourteen Points but may miss some complexities.",
      "Student thoroughly analyzes the terms and influence of the Treaty of Versailles and Wilson's Fourteen Points, providing context and relevant details.",
      "Student provides a comprehensive and insightful analysis of the Treaty of Versailles and Wilson's Fourteen Points, demonstrating a nuanced understanding of their long-term impact and significance."
    ],
    [
      "Student demonstrates no understanding of the causes or effects of the U.S. rejection of the League of Nations.",
      "Student demonstrates minimal understanding, with significant inaccuracies or omissions regarding the causes and effects of the U.S. rejection.",
      "Student identifies some causes and effects of the U.S. rejection but lacks depth and detail. Contains some inaccuracies.",
      "Student accurately describes the main causes and effects of the U.S. rejection of the League of Nations but may miss some complexities.",
      "Student thoroughly analyzes the causes and effects of the U.S. rejection of the League of Nations, providing context and relevant details.",
      "Student provides a comprehensive and insightful analysis of the causes and effects of the U.S. rejection of the League of Nations, demonstrating a nuanced understanding of its impact on world politics."
    ]
  ]
}