{
  "criteria": [
    "Understanding of Enlightenment Ideals and Their Impact on Views of Slavery",
    "Analysis of the Declaration of Independence and its Implications for Slavery",
    "Evidence of Research and Use of Primary and Secondary Sources"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Enlightenment ideals or their connection to changing views on slavery.",
      "Shows minimal understanding of Enlightenment ideals and struggles to connect them to the shift in perspectives on slavery.",
      "Displays a basic understanding of Enlightenment ideals, but the connection to changing views on slavery is vague and superficial.",
      "Demonstrates a satisfactory understanding of Enlightenment ideals and can make some connections to how they influenced perspectives on slavery.",
      "Exhibits a strong understanding of Enlightenment ideals and clearly articulates how these ideals challenged existing views on slavery, providing specific examples.",
      "Shows a comprehensive and nuanced understanding of Enlightenment ideals and their profound impact on changing views of slavery, offering insightful analysis and historical context."
    ],
    [
      "Unable to identify or explain any of the principles set forth in the Declaration of Independence relevant to the discussion of slavery.",
      "Identifies one or two principles from the Declaration of Independence but cannot articulate their implications for the issue of slavery.",
      "Identifies some key principles from the Declaration of Independence and makes a superficial attempt to connect them to the slavery debate.",
      "Analyzes the key principles of the Declaration of Independence and explains how they created a tension with the existence of slavery.",
      "Provides a thorough analysis of the Declaration of Independence, explaining how its principles directly challenged and undermined the justification for slavery.",
      "Offers a sophisticated and insightful analysis of the Declaration of Independence, exploring the complex and often contradictory ways its principles were used in debates about slavery, demonstrating a deep understanding of the historical context."
    ],
    [
      "No evidence of research or use of sources is present.",
      "Relies solely on personal opinion with no support from credible sources.",
      "Cites only one source with limited connection to the topic.",
      "Cites at least two sources but demonstrates a lack of critical evaluation.",
      "Cites multiple sources and demonstrates a good understanding of the material.",
      "Demonstrates excellent research skills, using a variety of primary and secondary sources to develop a compelling and well-supported argument."
    ]
  ]
}