{
  "criteria": [
    "Understanding of Trade-offs: Demonstrates comprehension of the concept that every economic choice involves giving up something else.",
    "Evaluation of Benefits and Costs: Assesses the benefits and costs associated with individual economic choices.",
    "Application to Local Economy: Applies the understanding of trade-offs and cost-benefit analysis to the local economy."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of trade-offs in economic decision-making.",
      "Identifies trade-offs superficially, without explaining them.",
      "Identifies and lists trade-offs in simple economic decisions.",
      "Explains trade-offs in a variety of economic choices, showing a basic understanding of opportunity cost.",
      "Analyzes trade-offs effectively, explaining the concept of opportunity cost and its implications.",
      "Demonstrates a sophisticated understanding of trade-offs, including opportunity costs, and applies this understanding to complex economic scenarios."
    ],
    [
      "Does not attempt to evaluate benefits and costs.",
      "Identifies benefits or costs, but not both, in economic decisions.",
      "Lists some benefits and costs associated with economic choices.",
      "Explains benefits and costs in simple economic decisions, and understands that those are part of decision making.",
      "Analyzes and compares the benefits and costs in a variety of economic choices.",
      "Conducts a comprehensive analysis of benefits and costs, considering both short-term and long-term impacts on decision making."
    ],
    [
      "Unable to relate trade-offs and cost-benefit analysis to the local economy.",
      "Mentions the local economy but does not connect it to economic choices.",
      "Describes how trade-offs and cost-benefit analysis might apply in general to local economic decisions.",
      "Provides examples of trade-offs and cost-benefit analysis in the local economy.",
      "Analyzes specific economic choices in the local economy, explaining trade-offs and evaluating benefits and costs.",
      "Evaluates multiple economic scenarios in the local economy, conducts a through analysis explaining trade-offs, and evaluates benefits and costs and can project future impacts."
    ]
  ]
}