{
  "criteria": [
    "Understanding of the Causes of the Great Depression",
    "Analysis of New Deal Economic Policies",
    "Understanding the Expanded Role of the Federal Government",
    "Knowledge of Specific New Deal Programs"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes of the Great Depression.",
      "Identifies one or two basic causes of the Great Depression.",
      "Identifies several causes of the Great Depression but lacks depth in explanation.",
      "Explains multiple causes of the Great Depression with reasonable depth and accuracy.",
      "Explains the complex interplay of factors contributing to the Great Depression, including economic and social aspects.",
      "Provides a comprehensive and nuanced analysis of the various causes of the Great Depression, demonstrating a deep understanding of the historical context."
    ],
    [
      "Shows no understanding of New Deal economic policies.",
      "Identifies one or two New Deal policies.",
      "Describes several New Deal policies but lacks analysis of their effects.",
      "Analyzes the effects of multiple New Deal policies with reasonable accuracy.",
      "Evaluates the successes and failures of New Deal policies and their impact on society and the economy.",
      "Provides a critical and insightful analysis of the long-term effects and controversies surrounding New Deal economic policies."
    ],
    [
      "Demonstrates no understanding of the expanded role of the federal government.",
      "Identifies that the federal government's role expanded during the New Deal.",
      "Describes how the federal government's role expanded but lacks specific examples.",
      "Explains the expanded role of the federal government with specific examples from the New Deal era.",
      "Analyzes the lasting impact of the New Deal on the role of the federal government in society and the economy.",
      "Critically evaluates the long-term consequences of the expanded federal government, including debates about its effectiveness and scope."
    ],
    [
      "Is unable to name any New Deal programs.",
      "Names one or two New Deal programs.",
      "Lists several New Deal programs but provides no detail.",
      "Describes the purpose and function of several key New Deal programs (e.g., WPA, Social Security).",
      "Explains the impact of specific New Deal programs on different groups in society.",
      "Demonstrates expert knowledge of a wide range of New Deal programs and their complex effects."
    ]
  ]
}