{
  "criteria": [
    "Understanding of Greek Mythology's Significance: Assesses the student's grasp of how Greek mythology influenced daily life in ancient Greece.",
    "Connection to Modern Literature and Language: Evaluates the student's ability to connect Greek literature to its continuing influence on modern works.",
    "Use of Examples from Greek Epics and Fables: Assesses the student's use of specific examples from Homer's Iliad and Odyssey, and Aesop's Fables to support their explanations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the role of Greek mythology in the daily lives of ancient Greeks.",
      "Shows minimal understanding of Greek mythology's influence on daily life, with limited or inaccurate examples.",
      "Identifies some ways Greek mythology impacted daily life but lacks depth or specific examples.",
      "Explains several aspects of how Greek mythology influenced the daily lives of ancient Greeks, providing relevant examples.",
      "Clearly explains the significant impact of Greek mythology on the everyday life of ancient Greeks, providing detailed and accurate examples.",
      "Demonstrates a comprehensive understanding of Greek mythology's pervasive influence on daily life in ancient Greece, offering insightful examples and analysis."
    ],
    [
      "Shows no awareness of Greek literature's influence on modern literature or language.",
      "Suggests a vague connection between Greek and modern works but lacks specific examples or reasoning.",
      "Identifies a few instances where Greek literature appears in modern contexts but does not explain the significance.",
      "Describes how Greek literature has influenced modern literature and language, providing some examples from works like the Iliad, Odyssey, or Aesop's Fables.",
      "Clearly explains the lasting impact of Greek literature on contemporary literature and language, with well-supported examples and analysis.",
      "Provides a sophisticated analysis of how Greek literature continues to shape modern literature and language, demonstrating an in-depth understanding of its enduring relevance and impact."
    ],
    [
      "Does not reference or include any examples from Greek epics or fables.",
      "Mentions Greek epics or fables but does not provide relevant examples to support explanations.",
      "Provides one or two basic examples from Greek epics or fables, with limited explanation of their relevance.",
      "Uses several relevant examples from the Iliad, Odyssey, or Aesop's Fables to illustrate points, with adequate explanation.",
      "Effectively uses detailed examples from Greek epics and fables to enhance explanations, demonstrating a strong understanding of their context and significance.",
      "Skillfully integrates a wide range of examples from Greek epics and fables, providing insightful analysis and demonstrating a deep understanding of their impact on the subject."
    ]
  ]
}