{
  "criteria": [
    "Understanding of Ancient Hebrew Geographic Structures",
    "Analysis of Ancient Hebrew Political Structures",
    "Examination of Ancient Hebrew Economic Structures",
    "Knowledge of Ancient Hebrew Religious Structures",
    "Insight into Ancient Hebrew Social Structures"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Ancient Hebrew geographic structures.",
      "Demonstrates a minimal understanding of Ancient Hebrew geographic structures, with significant inaccuracies.",
      "Demonstrates a basic understanding of Ancient Hebrew geographic structures, but with some gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Ancient Hebrew geographic structures, including key locations and their significance.",
      "Demonstrates a strong understanding of Ancient Hebrew geographic structures and their impact on society.",
      "Demonstrates a comprehensive and nuanced understanding of Ancient Hebrew geographic structures, including their long-term effects and connections to other aspects of society."
    ],
    [
      "Demonstrates no understanding of Ancient Hebrew political structures.",
      "Demonstrates a minimal understanding of Ancient Hebrew political structures, with significant inaccuracies.",
      "Demonstrates a basic understanding of Ancient Hebrew political structures, but with some gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Ancient Hebrew political structures, including key leaders and institutions.",
      "Demonstrates a strong understanding of Ancient Hebrew political structures and their impact on society.",
      "Demonstrates a comprehensive and nuanced understanding of Ancient Hebrew political structures, including their evolution, complexities, and connections to other aspects of society."
    ],
    [
      "Demonstrates no understanding of Ancient Hebrew economic structures.",
      "Demonstrates a minimal understanding of Ancient Hebrew economic structures, with significant inaccuracies.",
      "Demonstrates a basic understanding of Ancient Hebrew economic structures, but with some gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Ancient Hebrew economic structures, including key industries and trade routes.",
      "Demonstrates a strong understanding of Ancient Hebrew economic structures and their impact on society.",
      "Demonstrates a comprehensive and nuanced understanding of Ancient Hebrew economic structures, including their evolution, complexities, and connections to other aspects of society."
    ],
    [
      "Demonstrates no understanding of Ancient Hebrew religious structures.",
      "Demonstrates a minimal understanding of Ancient Hebrew religious structures, with significant inaccuracies.",
      "Demonstrates a basic understanding of Ancient Hebrew religious structures, but with some gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Ancient Hebrew religious structures, including key beliefs, rituals, and figures.",
      "Demonstrates a strong understanding of Ancient Hebrew religious structures and their impact on society.",
      "Demonstrates a comprehensive and nuanced understanding of Ancient Hebrew religious structures, including their evolution, complexities, and connections to other aspects of society."
    ],
    [
      "Demonstrates no understanding of Ancient Hebrew social structures.",
      "Demonstrates a minimal understanding of Ancient Hebrew social structures, with significant inaccuracies.",
      "Demonstrates a basic understanding of Ancient Hebrew social structures, but with some gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Ancient Hebrew social structures, including key social classes, family structures, and cultural practices.",
      "Demonstrates a strong understanding of Ancient Hebrew social structures and their impact on society.",
      "Demonstrates a comprehensive and nuanced understanding of Ancient Hebrew social structures, including their evolution, complexities, and connections to other aspects of society."
    ]
  ]
}