{
  "criteria": [
    "Understanding of the causes of the Industrial Revolution in each country.",
    "Analysis of the social effects of the Industrial Revolution.",
    "Analysis of the economic effects of the Industrial Revolution.",
    "Comparison of the Industrial Revolution in the different countries."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the causes of the Industrial Revolution in any of the countries.",
      "The student can identify at least one cause in one of the countries, but the explanation is vague or inaccurate.",
      "The student can identify some causes in a couple of countries, but lacks depth in explanation.",
      "The student can explain several causes of the Industrial Revolution in at least three countries.",
      "The student clearly explains multiple causes of the Industrial Revolution in four or five countries, demonstrating a good understanding of the complexities involved.",
      "The student provides a comprehensive and nuanced explanation of the various causes of the Industrial Revolution across all five countries, demonstrating a deep understanding of the historical context."
    ],
    [
      "The student does not address the social effects of the Industrial Revolution.",
      "The student mentions at least one social effect, but there is no analysis or explanation.",
      "The student identifies a few social effects, but analysis is superficial.",
      "The student analyzes several social effects of the Industrial Revolution, providing a basic understanding of their impact.",
      "The student provides a detailed analysis of the social effects, including changes in class structure, urbanization, and living conditions.",
      "The student offers a comprehensive and insightful analysis of the profound and lasting social effects of the Industrial Revolution, including its impact on various social groups and the emergence of new social problems."
    ],
    [
      "The student does not address the economic effects of the Industrial Revolution.",
      "The student mentions at least one economic effect, but there is no analysis or explanation.",
      "The student identifies a few economic effects, but analysis is superficial.",
      "The student analyzes several economic effects of the Industrial Revolution, providing a basic understanding of their impact.",
      "The student provides a detailed analysis of the economic effects, including changes in trade, manufacturing, and the rise of capitalism.",
      "The student offers a comprehensive and insightful analysis of the economic effects of the Industrial Revolution, including its impact on global trade, the rise of industrial capitalism, and the creation of new economic systems."
    ],
    [
      "The student does not compare the Industrial Revolution in the different countries.",
      "The student mentions some of the differences but does not make comparisons between them.",
      "The student makes some comparisons of the effects in the countries, but the analysis lacks depth.",
      "The student compares the Industrial Revolution in at least three countries, identifying similarities and differences.",
      "The student provides a detailed comparison of the Industrial Revolution in four or five countries, demonstrating a good understanding of the unique aspects of each.",
      "The student offers a comprehensive and nuanced comparison of the Industrial Revolution across all five countries, including the causes and effects, demonstrating a deep understanding of the historical context and unique challenges faced."
    ]
  ]
}