{
  "criteria": [
    "Understanding the Origins of Modern Capitalism",
    "Influence of Mercantilism and Cottage Industry",
    "Elements and Importance of a Market Economy in 17th-Century Europe",
    "Changing International Trading and Marketing Patterns",
    "Influence of Explorers and Map Makers"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the origins of modern capitalism.",
      "The student shows a very limited understanding of the origins of modern capitalism, with significant gaps in knowledge.",
      "The student identifies some aspects of the origins of modern capitalism, but lacks depth and clarity.",
      "The student explains the origins of modern capitalism with reasonable accuracy, but may miss some details or connections.",
      "The student clearly explains the origins of modern capitalism, providing relevant details and demonstrating a good understanding of the key factors.",
      "The student provides a comprehensive and insightful explanation of the origins of modern capitalism, demonstrating a deep understanding of the complexities and nuances involved."
    ],
    [
      "The student demonstrates no understanding of the influence of mercantilism and cottage industry.",
      "The student shows a very limited understanding of the influence of mercantilism and cottage industry, with significant gaps in knowledge.",
      "The student identifies some aspects of the influence of mercantilism and cottage industry, but lacks depth and clarity.",
      "The student explains the influence of mercantilism and cottage industry with reasonable accuracy, but may miss some details or connections.",
      "The student clearly explains the influence of mercantilism and cottage industry, providing relevant details and demonstrating a good understanding of their impact.",
      "The student provides a comprehensive and insightful explanation of the influence of mercantilism and cottage industry, demonstrating a deep understanding of their historical significance."
    ],
    [
      "The student demonstrates no understanding of the elements and importance of a market economy in 17th-century Europe.",
      "The student shows a very limited understanding of the elements and importance of a market economy in 17th-century Europe, with significant gaps in knowledge.",
      "The student identifies some elements and importance of a market economy in 17th-century Europe, but lacks depth and clarity.",
      "The student explains the elements and importance of a market economy in 17th-century Europe with reasonable accuracy, but may miss some details or connections.",
      "The student clearly explains the elements and importance of a market economy in 17th-century Europe, providing relevant details and demonstrating a good understanding of its key features.",
      "The student provides a comprehensive and insightful explanation of the elements and importance of a market economy in 17th-century Europe, demonstrating a deep understanding of its functioning and impact."
    ],
    [
      "The student demonstrates no understanding of the changing international trading and marketing patterns.",
      "The student shows a very limited understanding of the changing international trading and marketing patterns, with significant gaps in knowledge.",
      "The student identifies some aspects of the changing international trading and marketing patterns, but lacks depth and clarity.",
      "The student describes the changing international trading and marketing patterns with reasonable accuracy, but may miss some key developments or locations.",
      "The student clearly describes the changing international trading and marketing patterns, including their locations on a world map, and demonstrates a good understanding of their significance.",
      "The student provides a comprehensive and insightful analysis of the changing international trading and marketing patterns, including their geographical dimensions and broader historical context."
    ],
    [
      "The student demonstrates no understanding of the influence of explorers and map makers.",
      "The student shows a very limited understanding of the influence of explorers and map makers, with significant gaps in knowledge.",
      "The student identifies some aspects of the influence of explorers and map makers, but lacks depth and clarity.",
      "The student explains the influence of explorers and map makers with reasonable accuracy, but may miss some details or connections.",
      "The student clearly explains the influence of explorers and map makers, providing relevant details and demonstrating a good understanding of their impact on trade and economic development.",
      "The student provides a comprehensive and insightful analysis of the influence of explorers and map makers, demonstrating a deep understanding of their contributions to geographical knowledge and global trade networks."
    ]
  ]
}