{
  "criteria": [
    "Understanding the Origins of the Renaissance",
    "Knowledge of Renaissance Accomplishments",
    "Understanding the Geographic Diffusion of the Renaissance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the origins of the Renaissance.",
      "Shows a very limited understanding of the factors that led to the Renaissance.",
      "Identifies some of the key factors contributing to the Renaissance, but lacks depth.",
      "Explains several factors that led to the Renaissance, such as economic changes or rediscovery of classical texts.",
      "Clearly explains the key factors (economic, political, social) that led to the Renaissance, providing relevant examples.",
      "Provides a comprehensive analysis of the multiple, interconnected factors that led to the Renaissance, demonstrating insightful understanding."
    ],
    [
      "Unable to identify any significant accomplishments of the Renaissance.",
      "Identifies one or two very basic accomplishments with little detail.",
      "Lists a few accomplishments in art, literature, or science, but lacks elaboration.",
      "Describes several significant accomplishments of the Renaissance in different fields (e.g., art, science, literature).",
      "Explains the significance and impact of major Renaissance accomplishments, such as specific works of art or scientific discoveries.",
      "Provides an in-depth analysis of Renaissance accomplishments, evaluating their long-term impact on European society and culture."
    ],
    [
      "Shows no awareness of how the Renaissance spread geographically.",
      "Has a vague idea that the Renaissance spread, but cannot name any specific locations.",
      "Identifies a few key cities or regions where the Renaissance spread, but lacks specifics.",
      "Describes the general pattern of the Renaissance's spread from Italy to other parts of Europe.",
      "Explains how the Renaissance spread to different parts of Europe, highlighting key cities and cultural centers and providing reasons of the spread (e.g., trade routes, patronage).",
      "Analyzes the factors that influenced the geographic diffusion of the Renaissance, considering regional variations and the impact of local contexts on Renaissance ideas and art."
    ]
  ]
}