{
  "criteria": [
    "Understanding of Political Institutions: Demonstrates knowledge of the development and function of political structures in the colonies (e.g., colonial assemblies, governance systems).",
    "Understanding of Religious Institutions: Demonstrates knowledge of the role and impact of religious organizations and movements in the colonies (e.g., the Great Awakening, established churches).",
    "Understanding of Social Institutions: Demonstrates knowledge of the social structures and hierarchies that developed in the colonies (e.g., class systems, family structures, slavery).",
    "Understanding of Economic Institutions: Demonstrates knowledge of the economic systems and practices that shaped the colonial era (e.g., mercantilism, trade routes, labor systems)."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding of political institutions in the colonial era.",
      "Minimal understanding; struggles to identify basic political institutions.",
      "Identifies a few political institutions but lacks depth in explaining their function or evolution.",
      "Describes the main political institutions and their basic functions with some clarity.",
      "Explains the political institutions in detail, including their evolution and impact on colonial society.",
      "Demonstrates comprehensive understanding, including nuanced analysis of the political institutions and their lasting effects."
    ],
    [
      "No understanding of religious institutions in the colonial era.",
      "Minimal understanding; struggles to identify basic religious institutions.",
      "Identifies a few religious institutions but lacks depth in explaining their function or evolution.",
      "Describes the main religious institutions and their basic functions with some clarity.",
      "Explains the religious institutions in detail, including their evolution, impact on colonial society and religious tolerance.",
      "Demonstrates comprehensive understanding, including nuanced analysis of the religious institutions and their lasting effects, including those of religious intolerance."
    ],
    [
      "No understanding of social institutions in the colonial era.",
      "Minimal understanding; struggles to identify basic social institutions.",
      "Identifies a few social institutions but lacks depth in explaining their function or evolution.",
      "Describes the main social institutions and their basic functions with some clarity.",
      "Explains the social institutions in detail, including their evolution, impact on colonial society and intersectionality.",
      "Demonstrates comprehensive understanding, including nuanced analysis of the social institutions and their lasting effects, including inequality."
    ],
    [
      "No understanding of economic institutions in the colonial era.",
      "Minimal understanding; struggles to identify basic economic institutions.",
      "Identifies a few economic institutions but lacks depth in explaining their function or evolution.",
      "Describes the main economic institutions and their basic functions with some clarity.",
      "Explains the economic institutions in detail, including their evolution and impact on colonial society.",
      "Demonstrates comprehensive understanding, including nuanced analysis of the economic institutions and their lasting effects."
    ]
  ]
}