{
  "criteria": [
    "Understanding of Geographic Factors",
    "Analysis of Political Structures",
    "Economic Systems and Trade",
    "Religious Influences and Impact",
    "Social Structures and Daily Life"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how geographic factors influenced the development of Islamic civilizations.",
      "Shows a limited understanding of one or two geographic factors.",
      "Identifies some geographic factors but struggles to explain their influence.",
      "Explains how geographic factors influenced some aspects of Islamic civilizations.",
      "Thoroughly explains how geographic factors shaped multiple aspects of Islamic civilizations, providing specific examples.",
      "Demonstrates a sophisticated understanding of the complex interplay between geographic factors and the development of Islamic civilizations, including nuanced examples and exceptions."
    ],
    [
      "Demonstrates no understanding of the political structures of Islamic civilizations.",
      "Identifies a single political structure but cannot explain its function.",
      "Identifies some political structures but struggles to explain their roles and relationships.",
      "Describes the main political structures and their functions within Islamic civilizations.",
      "Analyzes the key political structures, explaining their functions, relationships, and impact on society with specific examples.",
      "Provides a nuanced analysis of the evolution, complexities, and impact of political structures in Islamic civilizations, including comparisons and connections to other civilizations."
    ],
    [
      "Demonstrates no understanding of the economic systems of Islamic civilizations.",
      "Mentions trade or a single economic activity without further explanation.",
      "Identifies some economic activities but struggles to explain their significance.",
      "Explains the main economic activities and trade networks within Islamic civilizations.",
      "Analyzes the economic systems, trade networks, and their impact on the development and spread of Islamic civilizations with specific examples.",
      "Demonstrates a comprehensive understanding of the economic systems, their global connections, and their lasting impact on Islamic civilizations and beyond."
    ],
    [
      "Demonstrates no understanding of the role of religion in Islamic civilizations.",
      "Mentions Islam without explaining its influence.",
      "Identifies some religious practices but struggles to explain their significance.",
      "Explains the main religious influences and practices within Islamic civilizations.",
      "Analyzes the ways in which religious beliefs and practices shaped the social, political, and cultural aspects of Islamic civilizations, providing specific examples.",
      "Demonstrates a deep understanding of the multifaceted relationship between religion and society in Islamic civilizations, including an understanding of different interpretations and their impact."
    ],
    [
      "Demonstrates no understanding of the social structures of Islamic civilizations.",
      "Mentions a single social group without further explanation.",
      "Identifies some social groups but struggles to explain their roles and relationships.",
      "Describes the main social structures and aspects of daily life within Islamic civilizations.",
      "Analyzes the social structures, daily life, and cultural achievements of Islamic civilizations, explaining the relationships between different groups and providing specific examples.",
      "Provides a nuanced analysis of the complexities and dynamics of social structures in Islamic civilizations, including insights into social mobility, cultural exchange, and diverse perspectives."
    ]
  ]
}