{
  "criteria": [
    "Understanding of Geographic Factors: Assesses the student's ability to explain how geography influenced the development of Chinese civilization during the Middle Ages.",
    "Analysis of Political Structures: Assesses the student's knowledge of the political systems and dynasties that governed China during the Middle Ages.",
    "Examination of Economic Systems: Assesses the student's ability to describe the economic activities and trade networks in China during the Middle Ages.",
    "Understanding of Religious and Philosophical Influences: Assesses the student's understanding of the role of major religions and philosophies (e.g., Confucianism, Buddhism) in shaping Chinese society and culture.",
    "Analysis of Social Structures: Assesses the student's ability to describe the social hierarchy, roles, and cultural practices of people in medieval China."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the geographic factors influencing Chinese civilization in the Middle Ages.",
      "Identifies geographic factors but struggles to explain their influence on Chinese civilization.",
      "Describes some geographic factors (e.g., rivers, mountains) and provides a basic explanation of their impact.",
      "Explains how key geographic features (e.g., Yellow River, Silk Road) influenced agriculture, trade, and settlement patterns in medieval China.",
      "Analyzes the complex relationship between geographic factors and various aspects of Chinese society (e.g., urbanization, defense strategies).",
      "Demonstrates a comprehensive understanding of the intricate ways in which geographic factors shaped the political, economic, and social development of Chinese civilization during the Middle Ages, including comparisons to other civilizations."
    ],
    [
      "Shows no understanding of the political structures of medieval China.",
      "Identifies dynasties or rulers but cannot describe their roles or the political systems.",
      "Describes the basic structure of the Chinese government (e.g., dynastic rule, bureaucracy) with limited detail.",
      "Explains the roles and functions of key political institutions and figures in medieval China (e.g., the Emperor, scholar-officials).",
      "Analyzes the strengths and weaknesses of the political systems in medieval China, including factors leading to stability and decline.",
      "Evaluates the effectiveness of different political structures in medieval China, comparing them to other contemporary political systems and explaining their long-term impact on Chinese history."
    ],
    [
      "Shows no understanding of economic systems in medieval China.",
      "Identifies some economic activities but struggles to describe their significance.",
      "Describes basic economic activities (e.g., agriculture, trade) with limited detail.",
      "Explains the importance of agriculture, trade routes (like the Silk Road), and technological innovations in the Chinese economy.",
      "Analyzes the economic policies and practices that contributed to China's wealth and prosperity during the Middle Ages.",
      "Evaluates the impact of economic factors on social structures and political power in medieval China, including the role of trade, taxation, and technological advancements."
    ],
    [
      "Shows no understanding of religious or philosophical influences in medieval China.",
      "Identifies religious or philosophical traditions but cannot explain their influence.",
      "Describes the basic tenets of major religions or philosophies with limited detail.",
      "Explains how Confucianism, Buddhism, and other belief systems influenced ethics, governance, and social order.",
      "Analyzes the interactions between different religious and philosophical traditions and their impact on Chinese culture and intellectual life.",
      "Evaluates the long-term significance of religious and philosophical ideas in shaping Chinese civilization, comparing their influence to that of other major world religions and philosophies."
    ],
    [
      "Shows no understanding of social structures in medieval China.",
      "Identifies social groups but cannot describe their roles or relationships.",
      "Describes the basic social hierarchy (e.g., scholar-officials, peasants, merchants) with limited detail.",
      "Explains the roles and responsibilities of different social groups and their interactions within the social hierarchy.",
      "Analyzes the impact of social structures on people's lives and opportunities in medieval China.",
      "Evaluates the factors that contributed to social mobility and stability in medieval China, comparing the social structures to those of other contemporary societies."
    ]
  ]
}