{
  "criteria": [
    "Understanding the Aims and Motivations of European Explorers",
    "Knowledge of Obstacles Faced by Explorers",
    "Recognition of Accomplishments and Key Figures",
    "Understanding of the Reasons for European Colonization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the aims and motivations behind European exploration.",
      "Shows a limited understanding of one or two aims of European explorers (e.g., wealth, religious conversion).",
      "Identifies multiple aims of European explorers but lacks depth in explaining the underlying motivations.",
      "Explains several aims of European explorers, including economic, religious, and political motivations, with some supporting details.",
      "Clearly explains the aims of European explorers, thoroughly detailing the economic, religious, and political factors that drove exploration. Connects motivations to specific historical events like the Reconquista and Reformation.",
      "Provides a comprehensive and nuanced explanation of the aims and motivations of European explorers, demonstrating a deep understanding of the complex interplay between economic, religious, and political factors. Connects these motivations to long-term consequences and global impacts."
    ],
    [
      "Shows no awareness of the obstacles faced by European explorers.",
      "Identifies one or two general obstacles, such as weather or lack of supplies.",
      "Lists several obstacles but provides limited detail on the impact of these challenges.",
      "Explains several significant obstacles faced by explorers, such as navigational challenges, disease, and conflicts with indigenous populations.",
      "Thoroughly explains the major obstacles faced by explorers, providing specific examples and analyzing the impact of these obstacles on exploration outcomes.",
      "Offers a detailed and insightful analysis of the obstacles faced by explorers, connecting these challenges to broader themes of technological limitations, environmental factors, and intercultural relations. Analyzes how these obstacles shaped the course of exploration and colonization."
    ],
    [
      "Does not recognize any accomplishments of European explorers or key figures.",
      "Identifies one or two explorers or accomplishments with minimal context.",
      "Lists multiple explorers and accomplishments but lacks depth in explaining their significance.",
      "Explains several key accomplishments of European explorers and identifies important figures, providing some context for their roles.",
      "Clearly explains the major accomplishments of European explorers, detailing the roles of key figures and analyzing the significance of their contributions. Connects accomplishments to long-term impacts.",
      "Provides a comprehensive and insightful analysis of the accomplishments of European explorers, demonstrating a deep understanding of their lasting impact on global trade, cultural exchange, and geopolitical power dynamics. Critically assesses the legacy of key figures."
    ],
    [
      "Demonstrates no understanding of the reasons why Europeans chose to colonize the world.",
      "Shows a limited understanding of one reason for European colonization (e.g., resources).",
      "Identifies multiple reasons for European colonization but lacks depth in explaining the underlying motivations.",
      "Explains several reasons for European colonization, including economic, religious, and political motivations, with some supporting details.",
      "Clearly explains the reasons for European colonization, thoroughly detailing the economic, religious, and political factors that drove colonization. Connects motivations to specific historical events like the Reconquista and Reformation.",
      "Provides a comprehensive and nuanced explanation of the reasons for European colonization, demonstrating a deep understanding of the complex interplay between economic, religious, and political factors. Connects these motivations to long-term consequences and global impacts."
    ]
  ]
}