{
  "criteria": [
    "Identification of the location of the Kush civilization",
    "Description of the political relations with Egypt",
    "Description of the commercial relations with Egypt",
    "Description of the cultural relations with Egypt"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify the location of the Kush civilization.",
      "The student vaguely identifies a general area, but lacks specific geographic details.",
      "The student identifies the general region of the Kush civilization (e.g., Nubia) but provides limited detail.",
      "The student accurately identifies the location of the Kush civilization in the region south of Egypt, mentioning its location along the Nile.",
      "The student precisely identifies the location of the Kush civilization, including specific geographic markers, such as its location in modern-day Sudan and its control over key stretches of the Nile.",
      "The student provides a comprehensive description of the Kush civilization's location, including its geographic boundaries, key cities, and its relationship to the Nile River, demonstrating a strong understanding of its spatial context."
    ],
    [
      "The student fails to describe any political relations between Kush and Egypt.",
      "The student mentions that there was some form of interaction between Kush and Egypt but cannot provide details.",
      "The student vaguely describes some political interactions, such as trade or conflict, but lacks specifics.",
      "The student describes basic political relations, such as periods of conflict or alliance, but lacks depth.",
      "The student accurately describes the complex political relationship between Kush and Egypt, including periods of Egyptian control, Kushite independence, and instances of warfare and diplomacy.",
      "The student provides a nuanced analysis of the political relations, including the dynastic connections, power struggles, and the eventual Kushite conquest of Egypt, demonstrating a deep understanding of their political interplay."
    ],
    [
      "The student fails to describe any commercial relations between Kush and Egypt.",
      "The student vaguely mentions that there was trade between Kush and Egypt, but provides no details.",
      "The student describes some goods that were traded, but lacks specifics about the nature or importance of the trade.",
      "The student accurately describes the types of goods traded between Kush and Egypt, such as gold, ivory, and slaves.",
      "The student thoroughly describes the commercial relations, including the goods traded, the trade routes, and the economic impact on both civilizations.",
      "The student analyzes the economic impact of the commercial relations, explaining how trade influenced the development and prosperity of both Kush and Egypt, and its role in regional power dynamics."
    ],
    [
      "The student fails to describe any cultural relations between Kush and Egypt.",
      "The student vaguely mentions cultural exchange, but provides no details.",
      "The student identifies one or two cultural aspects that were shared or exchanged, but lacks depth.",
      "The student describes several aspects of cultural exchange, such as religious practices, artistic styles, or architectural influences.",
      "The student comprehensively describes the cultural relations between Kush and Egypt, including examples of Egyptian influence on Kushite culture and vice versa.",
      "The student provides a detailed analysis of the cultural relations, explaining how Egyptian culture influenced Kushite identity and state formation, and how Kushite culture impacted Egypt, demonstrating a sophisticated understanding of cultural diffusion and syncretism."
    ]
  ]
}