{
  "criteria": [
    "Identification of Virtues in Historical Contexts",
    "Explanation of Significance",
    "Use of Stories and Folklore"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any examples of honesty, courage, determination, individual responsibility, or patriotism in American and world history.",
      "The student identifies one virtue but struggles to provide a clear historical example or misinterprets the context.",
      "The student identifies two virtues with basic historical examples but lacks depth in explaining their significance.",
      "The student identifies three virtues with relevant historical examples and provides a satisfactory explanation of their importance.",
      "The student identifies four virtues, providing clear historical examples and explaining their significance with considerable depth.",
      "The student accurately identifies all five virtues (honesty, courage, determination, individual responsibility, and patriotism) and provides detailed historical examples from stories and folklore, demonstrating a comprehensive understanding of their significance."
    ],
    [
      "The student fails to explain the significance of the virtues in the context of American and world history.",
      "The student attempts to explain the significance but demonstrates a limited understanding or provides irrelevant information.",
      "The student offers a superficial explanation of the significance of the virtues, lacking depth and insight.",
      "The student provides a satisfactory explanation of the significance of the virtues, connecting them to broader historical themes.",
      "The student offers a thoughtful and well-reasoned explanation of the significance of the virtues, demonstrating a strong understanding of their impact on historical events and societal values.",
      "The student provides a nuanced and insightful explanation of the significance of the virtues, demonstrating a sophisticated understanding of their complex interplay with historical forces and enduring relevance to contemporary society."
    ],
    [
      "The student does not reference any stories or folklore in their examples.",
      "The student makes a vague reference to stories or folklore but does not provide specific details or examples.",
      "The student mentions stories or folklore but struggles to connect them effectively to the virtues being discussed.",
      "The student incorporates stories or folklore to illustrate the virtues but provides a limited analysis of their cultural or historical context.",
      "The student effectively integrates stories and folklore to illustrate the virtues, providing relevant details and demonstrating an understanding of their cultural or historical context.",
      "The student skillfully weaves together stories and folklore to provide compelling examples of the virtues, offering insightful analysis of their cultural or historical context and demonstrating a deep appreciation for their enduring power."
    ]
  ]
}