{
  "criteria": [
    "Understanding the context of Black Americans gaining freedom in the North during the 1800s",
    "Knowledge of key figures, schools, and churches founded by Black Americans.",
    "Explanation of the impact of schools and churches on advancing rights and communities.",
    "Ability to connect historical events to contemporary issues."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context or the timeframe.",
      "Shows minimal awareness of the historical period or the challenges faced by Black Americans.",
      "Identifies the timeframe (early to mid-1800s) but struggles to explain the broader historical context.",
      "Explains the historical context with some accuracy, including the general timeframe and the concept of freedom in the North, but lacks depth.",
      "Demonstrates a solid understanding of the historical context, including key events and social dynamics affecting Black Americans seeking freedom.",
      "Demonstrates a comprehensive understanding of the nuanced historical context, including specific policies, societal attitudes, and the overall impact on Black communities."
    ],
    [
      "Is unable to name any key figures, schools, or churches.",
      "Names one or two figures, schools, or churches with limited additional information.",
      "Names a few figures, schools, or churches, but lacks detail or accuracy in their descriptions.",
      "Accurately names and identifies several key figures, schools, and churches, providing basic information about their roles.",
      "Provides detailed information about key figures, schools, and churches, including their founders, missions, and impact.",
      "Demonstrates extensive knowledge, including lesser-known figures and institutions, and offers insightful analysis of their contributions and challenges."
    ],
    [
      "Unable to articulate the impact of schools and churches.",
      "Offers vague or unsubstantiated statements about the impact.",
      "Identifies a general impact (e.g., education, community building) but lacks specific evidence.",
      "Explains the impact of schools and churches on education and community cohesion, providing some specific examples.",
      "Analyzes the impact of schools and churches on multiple levels, including education, social activism, and political empowerment.",
      "Provides a comprehensive analysis of the multifaceted impact, including long-term effects, resistance to oppression, and contributions to the broader struggle for civil rights."
    ],
    [
      "Shows no ability to connect historical events to contemporary issues.",
      "Attempts to make connections but is unfocused.",
      "Draws one or two simplistic connections with some degree of accuracy.",
      "Identifies a number of connections between the past and the present, including the enduring relevance of social justice and equality.",
      "Compares the historical situation with current ones, and discusses the parallels and the degree to which things have improved",
      "Performs in-depth analysis of historical situations, and extrapolates ways to improve modern society."
    ]
  ]
}