{
  "criteria": [
    "Understanding of the Counter-Reformation's Goals",
    "Knowledge of Key Figures and Groups",
    "Analysis of Forces Fostering the Movement",
    "Understanding of Catholic Church Revitalization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Counter-Reformation or its goals.",
      "Shows minimal awareness of the Counter-Reformation, with significant misunderstandings about its objectives.",
      "Identifies the Counter-Reformation but struggles to articulate its goals beyond a superficial level.",
      "Accurately describes the Counter-Reformation and its primary goals, such as revitalizing the Catholic Church and combating Protestantism.",
      "Explains the Counter-Reformation's goals with clarity and provides specific examples of the strategies employed to achieve them.",
      "Offers a comprehensive analysis of the Counter-Reformation's goals, including nuanced understanding of the political, religious, and social factors that shaped them."
    ],
    [
      "Unable to name any key figures or groups associated with the Counter-Reformation.",
      "Names one key figure or group but provides inaccurate or incomplete information.",
      "Identifies St. Ignatius of Loyola and the Jesuits, or the Council of Trent, but lacks detail about their roles.",
      "Describes the roles of St. Ignatius of Loyola and the Jesuits OR the Council of Trent in the Counter-Reformation with reasonable accuracy.",
      "Explains the significant contributions of both St. Ignatius of Loyola and the Jesuits AND the Council of Trent to the Counter-Reformation.",
      "Provides an in-depth analysis of the roles and impacts of key figures and groups, including St. Ignatius of Loyola and the Jesuits AND the Council of Trent, within the broader context of the Counter-Reformation."
    ],
    [
      "Does not identify any forces that fostered the Counter-Reformation.",
      "Lists one or more forces but does not explain how they fostered the Counter-Reformation.",
      "Identifies some forces fostering the Counter-Reformation (e.g., response to Protestantism) but lacks depth in explanation.",
      "Explains several forces that fostered the Counter-Reformation, such as the desire to combat heresy, reform the Church, and regain lost followers.",
      "Analyzes the complex interplay of forces that fostered the Counter-Reformation, demonstrating an understanding of cause and effect.",
      "Offers a nuanced and insightful analysis of the various forces (political, social, religious) that contributed to the Counter-Reformation, including their long-term consequences."
    ],
    [
      "Demonstrates no understanding of how the Counter-Reformation revitalized the Catholic Church.",
      "Shows minimal awareness that the Catholic Church was revitalized during the Counter-Reformation.",
      "States that the Counter-Reformation revitalized the Catholic Church but does not provide specific examples.",
      "Describes how the Counter-Reformation led to some revitalization within the Catholic Church, such as addressing corruption or clarifying doctrine.",
      "Explains multiple ways in which the Counter-Reformation revitalized the Catholic Church, providing concrete examples of reforms and renewed focus.",
      "Offers a comprehensive analysis of the revitalization of the Catholic Church, considering both the successes and limitations of the Counter-Reformation's efforts."
    ]
  ]
}