{
  "criteria": [
    "Understanding of the First Continental Congress",
    "Understanding of the Second Continental Congress",
    "Understanding of the Committees of Correspondence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the First Continental Congress.",
      "Student shows minimal understanding, with significant inaccuracies or omissions regarding the purpose and outcomes of the First Continental Congress.",
      "Student identifies the First Continental Congress but struggles to explain its significance or key actions.",
      "Student accurately describes the First Continental Congress, including its main goals and resolutions, such as the Declaration of Rights and Grievances.",
      "Student demonstrates a clear understanding of the First Continental Congress, its goals, key figures, and its impact on the growing conflict with Britain.",
      "Student provides a comprehensive analysis of the First Continental Congress, including its context, debates, outcomes, and its role in escalating tensions and setting the stage for independence."
    ],
    [
      "Student demonstrates no understanding of the Second Continental Congress.",
      "Student shows minimal understanding, with significant inaccuracies or omissions regarding the purpose and outcomes of the Second Continental Congress.",
      "Student identifies the Second Continental Congress but struggles to explain its significance or key actions.",
      "Student accurately describes the Second Continental Congress, including its main actions such as forming the Continental Army and appointing George Washington as commander.",
      "Student demonstrates a clear understanding of the Second Continental Congress, its evolution from addressing grievances to declaring independence, and its key decisions.",
      "Student provides a comprehensive analysis of the Second Continental Congress, including its context, internal divisions, critical decisions (like the Declaration of Independence), and its long-term impact on the Revolution."
    ],
    [
      "Student demonstrates no understanding of the Committees of Correspondence.",
      "Student shows minimal understanding, with significant inaccuracies or omissions regarding the purpose and function of the Committees of Correspondence.",
      "Student identifies the Committees of Correspondence but struggles to explain their role in the lead-up to the Revolution.",
      "Student accurately describes the Committees of Correspondence, including their purpose of communication and coordination among the colonies.",
      "Student demonstrates a clear understanding of the Committees of Correspondence, their effectiveness in disseminating information, and their role in fostering colonial unity.",
      "Student provides a comprehensive analysis of the Committees of Correspondence, including their origins, structure, key figures, and their impact on mobilizing colonial resistance and shaping public opinion."
    ]
  ]
}