{
  "criteria": [
    "Identification of Roman Territories and Expansion",
    "Understanding of Economic Growth through Currency and Trade Routes"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student cannot identify the location of Roman territories or explain the reasons for their growth and expansion.",
      "Student can identify the location of some Roman territories but struggles to explain the reasons for growth and expansion.",
      "Student can identify the location of major Roman territories and offers a limited explanation of the reasons for growth and expansion.",
      "Student can accurately identify the location of major Roman territories and provides a satisfactory explanation of the political and geographic reasons for their growth and expansion.",
      "Student can accurately identify the location of major Roman territories and provides a detailed explanation of the political and geographic reasons for their growth and expansion, including the impact of these factors.",
      "Student demonstrates a comprehensive understanding of the location of Roman territories and provides a nuanced explanation of the political and geographic reasons for their growth and expansion, including insightful analysis of the long-term impact."
    ],
    [
      "Student demonstrates no understanding of how the Roman Empire fostered economic growth.",
      "Student shows a limited understanding of how the Roman Empire fostered economic growth, with no mention of currency or trade routes.",
      "Student mentions currency and\/or trade routes but does not explain how they contributed to economic growth.",
      "Student explains how currency and trade routes fostered economic growth in the Roman Empire, providing some supporting details.",
      "Student provides a thorough explanation of how currency and trade routes fostered economic growth in the Roman Empire, including specific examples and analysis of their impact.",
      "Student demonstrates a sophisticated understanding of how currency and trade routes fostered economic growth in the Roman Empire, offering insightful analysis of the complex interplay between these factors and the empire's prosperity."
    ]
  ]
}