{
  "criteria": [
    "Understanding the balance of power between federal and state governments as defined by the Constitution.",
    "Comprehension of the specific powers granted to citizens, Congress, the president, and the Supreme Court.",
    "Analysis of how the Constitution secures liberty by both empowering and limiting central government."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the division of powers between the federal and state governments.",
      "The student shows a minimal understanding of the division of powers, with significant misconceptions.",
      "The student identifies some powers of the federal and state governments but struggles to articulate the constitutional basis for this division.",
      "The student generally understands the division of powers and can provide basic examples of powers granted to each level of government.",
      "The student clearly explains the division of powers, providing relevant examples and demonstrating an understanding of the Constitution's role in defining this balance.",
      "The student comprehensively analyzes the balance of power, offering insightful examples, discussing historical context, and evaluating the effectiveness of the constitutional design."
    ],
    [
      "The student is unable to identify any specific powers of the different branches of government or the rights of citizens.",
      "The student identifies a few powers or rights but demonstrates significant confusion and inaccuracies.",
      "The student identifies some basic powers and rights but lacks depth and understanding of their constitutional basis.",
      "The student accurately identifies several powers and rights, demonstrating a general understanding of their roles.",
      "The student demonstrates a strong understanding of the powers and rights, explaining their significance and providing relevant examples.",
      "The student provides a comprehensive and nuanced understanding of the powers and rights, analyzing their historical development, contemporary relevance, and potential limitations."
    ],
    [
      "The student shows no understanding of how the Constitution protects liberty through both empowering and limiting government.",
      "The student expresses a vague understanding of the concept but cannot provide specific examples or explanations.",
      "The student identifies either the empowering or limiting aspects of the Constitution but not both.",
      "The student recognizes that the Constitution both empowers and limits government, providing simple examples.",
      "The student clearly explains how the Constitution secures liberty through both empowering and limiting government, using specific examples.",
      "The student provides a sophisticated analysis of how the Constitution balances power and liberty, discussing potential tensions, historical interpretations, and ongoing debates."
    ]
  ]
}