{
  "criteria": [
    "Understanding the geographic importance of major rivers in the West (e.g., Mississippi, Missouri, Colorado, Columbia)",
    "Knowledge of historical struggles over water rights in the West.",
    "Analysis of the economic impact of rivers and water rights on westward expansion.",
    "Understanding of the social and political consequences of water rights struggles."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the importance of rivers in the American West.",
      "Shows minimal awareness of the existence of major rivers but cannot explain their significance.",
      "Identifies a few major rivers and provides a limited explanation of their geographic importance.",
      "Describes several major rivers and explains their importance for transportation, agriculture, and settlement.",
      "Provides a comprehensive overview of the major rivers and analyzes their geographic significance in shaping the American West.",
      "Offers a nuanced understanding of the rivers' geographic importance, including their impact on ecosystems, resource distribution, and regional development, with insightful connections to historical events."
    ],
    [
      "Shows no knowledge of any conflicts or issues related to water rights.",
      "Demonstrates minimal awareness of the concept of water rights but no specific historical knowledge.",
      "Identifies one or two instances of water rights disputes with limited detail.",
      "Describes several historical struggles over water rights, including the key parties and issues involved.",
      "Analyzes the causes and consequences of historical struggles over water rights, including their impact on different groups and regions.",
      "Provides a sophisticated analysis of the complex factors driving historical water rights struggles, including legal, economic, social, and environmental dimensions, with detailed examples and insightful conclusions."
    ],
    [
      "Fails to connect rivers and water rights to economic developments in the West.",
      "Mentions the connection vaguely but provides no specific details or examples.",
      "Identifies a basic economic impact (e.g., irrigation) but lacks depth in analysis.",
      "Explains how rivers and access to water influenced agriculture, industry, and trade in the West.",
      "Analyzes the economic impacts of water rights on various stakeholders, such as farmers, ranchers, and businesses, considering both benefits and drawbacks.",
      "Offers a nuanced analysis of the long-term economic consequences of water management policies and legal precedents related to water rights, including their effects on regional disparities and sustainability."
    ],
    [
      "Shows no understanding of the social or political dimensions of water rights.",
      "Demonstrates minimal awareness of potential social or political impacts.",
      "Identifies a simple social or political effect (e.g., conflicts between farmers) with limited explanation.",
      "Describes the social and political tensions arising from competition over water resources, including impacts on communities and governance.",
      "Analyzes how water rights issues shaped political alliances, legal frameworks, and social inequalities in the West.",
      "Provides a comprehensive examination of the intersectionality of water rights with issues of race, class, gender, and power, offering insightful conclusions about the long-term social and political legacies of water management policies."
    ]
  ]
}