{
  "criteria": [
    "Identification of Key Muslim Scholars and Their Contributions",
    "Explanation of Intellectual Exchanges Among Muslim Scholars of Eurasia and Africa",
    "Connection of Muslim Scholars' Contributions to Later Civilizations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student cannot identify any Muslim scholars or their contributions to science, geography, mathematics, philosophy, medicine, art, or literature.",
      "Student identifies at least one Muslim scholar or contribution with significant inaccuracies or lack of detail.",
      "Student identifies one or two Muslim scholars and\/or contributions but demonstrates limited understanding of their significance.",
      "Student identifies multiple Muslim scholars and their contributions across several fields with reasonable accuracy and some detail.",
      "Student identifies several key Muslim scholars and their contributions across multiple fields, demonstrating a good understanding of their significance and providing supporting details.",
      "Student comprehensively identifies numerous key Muslim scholars and their contributions across all specified fields, demonstrating a deep understanding of their significance and providing detailed supporting evidence."
    ],
    [
      "Student does not address the concept of intellectual exchanges or demonstrates no understanding of the geographic regions involved.",
      "Student attempts to explain intellectual exchanges but provides inaccurate information or lacks geographic context.",
      "Student identifies some intellectual exchanges among Muslim scholars but provides limited explanation of their nature or impact.",
      "Student explains intellectual exchanges among Muslim scholars, including the regions of Eurasia and Africa, with reasonable accuracy and some detail.",
      "Student clearly explains the intellectual exchanges among Muslim scholars, including the regions of Eurasia and Africa, demonstrating a good understanding of their impact on various fields of study.",
      "Student provides a comprehensive and nuanced explanation of the intellectual exchanges among Muslim scholars of Eurasia and Africa, demonstrating a deep understanding of their complex interactions and far-reaching impact."
    ],
    [
      "Student fails to connect Muslim scholars' contributions to the development of later civilizations.",
      "Student makes a vague or inaccurate attempt to connect Muslim scholars' contributions to later civilizations.",
      "Student identifies a connection between Muslim scholars' contributions and later civilizations but provides limited explanation.",
      "Student explains a connection between Muslim scholars' contributions and later civilizations with reasonable accuracy and some supporting details.",
      "Student clearly explains several connections between Muslim scholars' contributions and later civilizations, demonstrating a good understanding of their lasting impact.",
      "Student comprehensively explains numerous connections between Muslim scholars' contributions and later civilizations, demonstrating a deep understanding of their profound and lasting influence with detailed examples and evidence."
    ]
  ]
}