{
  "criteria": [
    "Understanding of Population Movement",
    "Analysis of the International Economy",
    "Knowledge of Shifts in Geographic and Political Borders"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding of how WWI and peace treaties affected population movement.",
      "Demonstrates a minimal understanding of population movement, with significant inaccuracies or omissions.",
      "Identifies population shifts after WWI, but lacks detail or explanation of causes and consequences.",
      "Describes the effects of the war and peace treaties on population movement with some specific examples, but analysis is superficial.",
      "Explains the effects of WWI and peace treaties on population movement, providing specific examples and analyzing their causes and consequences.",
      "Provides a comprehensive analysis of the effects of WWI and peace treaties on population movement, including nuanced understanding of causes, consequences, and broader historical context."
    ],
    [
      "No understanding of how WWI and peace treaties affected the international economy.",
      "Demonstrates a minimal understanding of the international economy, with significant inaccuracies or omissions.",
      "Identifies economic shifts after WWI, but lacks detail or explanation of causes and consequences.",
      "Describes the effects of the war and peace treaties on the international economy with some specific examples, but analysis is superficial.",
      "Explains the effects of WWI and peace treaties on the international economy, providing specific examples and analyzing their causes and consequences.",
      "Provides a comprehensive analysis of the effects of WWI and peace treaties on the international economy, including nuanced understanding of causes, consequences, and broader historical context."
    ],
    [
      "No understanding of how WWI and peace treaties caused shifts in geographic and political borders.",
      "Demonstrates a minimal understanding of geographic and political borders, with significant inaccuracies or omissions.",
      "Identifies shifts in borders after WWI, but lacks detail or explanation of causes and consequences.",
      "Describes the effects of the war and peace treaties on geographic and political borders with some specific examples, but analysis is superficial.",
      "Explains the effects of WWI and peace treaties on geographic and political borders, providing specific examples and analyzing their causes and consequences.",
      "Provides a comprehensive analysis of the effects of WWI and peace treaties on geographic and political borders, including nuanced understanding of causes, consequences, and broader historical context."
    ]
  ]
}