{
  "criteria": [
    "Understanding of Westward Expansion Motives",
    "Knowledge of Challenges Faced by Settlers",
    "Understanding of Divergent Paths"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the reasons behind westward expansion.",
      "Identifies one or two reasons for westward expansion with minimal explanation.",
      "Lists several reasons for westward expansion but lacks depth in explanation.",
      "Explains the major motivations for westward expansion, including economic, social, and political factors.",
      "Analyzes the complex interplay of motivations driving westward expansion, providing specific examples.",
      "Critically evaluates the motivations behind westward expansion, considering diverse perspectives and long-term consequences."
    ],
    [
      "Shows no awareness of the challenges faced by American people in the West.",
      "Identifies one or two challenges with no elaboration.",
      "Lists several challenges but lacks specific details or context.",
      "Describes the major challenges faced by settlers, such as environmental hardships, conflicts with Native Americans, and economic difficulties.",
      "Explains the challenges faced by settlers with specific examples and connects them to broader historical trends.",
      "Analyzes the impact of these challenges on the lives of settlers and the development of the American West, demonstrating nuanced understanding."
    ],
    [
      "Does not recognize the different experiences of people in the West.",
      "Acknowledges some differences but does not elaborate.",
      "Lists different groups of people in the West but lacks insight into their distinct paths.",
      "Describes the varying experiences of different groups (e.g., farmers, miners, Native Americans) in the West.",
      "Compares and contrasts the divergent paths of different groups, explaining the factors that shaped their experiences.",
      "Evaluates the long-term consequences of these divergent paths and their impact on the social, economic, and political landscape of the American West."
    ]
  ]
}