{
  "criteria": [
    "Understanding of International Interactions: Demonstrates comprehension of the various methods groups and nations employ to address shared challenges.",
    "Application of Knowledge: Applies understanding of international interactions to real-world scenarios and historical contexts.",
    "Clarity and Precision: Communicates ideas clearly and uses precise language to describe complex interactions."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of how groups and nations interact to resolve problems.",
      "Demonstrates a minimal understanding of one or two methods of international interaction, such as trade or diplomacy, but lacks depth.",
      "Identifies several methods of interaction (e.g., trade, cultural contacts) but provides superficial explanations.",
      "Explains multiple methods of international interaction, providing basic examples of how they are used to resolve problems.",
      "Analyzes various methods of international interaction, offering specific examples and discussing their effectiveness in problem-solving.",
      "Critically evaluates the strengths and limitations of different methods of international interaction, providing detailed case studies to support analysis."
    ],
    [
      "Unable to apply knowledge of international interactions to any real-world scenarios or historical contexts.",
      "Attempts to apply knowledge but struggles to connect concepts to specific examples.",
      "Provides basic connections between methods of interaction and real-world events, but lacks detail.",
      "Applies understanding to explain how specific interactions (e.g., treaties) have influenced historical or contemporary issues.",
      "Analyzes complex scenarios, demonstrating how multiple forms of interaction intersect to impact outcomes.",
      "Synthesizes knowledge from various sources to construct well-supported arguments about the impact of international interactions on global issues."
    ],
    [
      "Communication is unclear and lacks precision; uses vague language.",
      "Struggles to articulate ideas clearly; language is imprecise and confusing.",
      "Communicates basic ideas adequately but lacks precision in language; some ambiguity.",
      "Expresses ideas clearly and uses appropriate language to describe interactions accurately.",
      "Communicates complex ideas with clarity and precision; uses sophisticated language effectively.",
      "Demonstrates exceptional clarity and precision in communication; language is articulate and nuanced, enhancing understanding."
    ]
  ]
}