{
  "criteria": [
    "Understanding of the Transition from Tyranny and Oligarchy to Democracy",
    "Significance of Citizenship in Ancient Greece",
    "Understanding of the return to dictatorship"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the different forms of government in ancient Greece.",
      "Student can identify some of the forms of government (tyranny, oligarchy, democracy) but cannot explain the transition between them.",
      "Student can generally describe the forms of government but struggles to accurately explain the progression from one to another.",
      "Student accurately describes the transition from tyranny and oligarchy to early democratic forms of government in ancient Greece.",
      "Student clearly explains the transition, including specific examples and details about the characteristics of each form of government.",
      "Student provides a comprehensive and insightful analysis of the transition, including historical context and nuanced understanding of the factors driving the changes."
    ],
    [
      "Student demonstrates no understanding of the concept of citizenship in ancient Greece.",
      "Student can define citizenship but cannot connect it to the historical context of ancient Greece.",
      "Student describes citizenship in ancient Greece with limited details and struggles to explain its significance.",
      "Student explains the significance of the invention of the idea of citizenship in ancient Greece, including key aspects.",
      "Student thoroughly explains the significance of citizenship, referencing Pericles' Funeral Oration or similar primary sources.",
      "Student provides a deep and nuanced analysis of the concept of citizenship in ancient Greece, including its impact on society and its legacy."
    ],
    [
      "Student does not acknowledge the return to dictatorship in ancient Greece",
      "Student mentions the return to dictatorship but can not give supporting details.",
      "Student demonstrates limited understanding of the reasons and events that led to the return to dictatorship.",
      "Student explains the circumstances that led from early democracy back to dictatorship.",
      "Student gives a detailed description of the political turmoil and power struggles that led to the return of dictatorship.",
      "Student provides an insightful analysis of why the return to dictatorship happened, including an understanding of inherent weaknesses in the early democratic system."
    ]
  ]
}