{
  "criteria": [
    "Understanding the economic hardships faced by families during the American Revolution.",
    "Understanding the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering.",
    "Understanding the personal impact of the war on families."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the economic hardships faced by families during the American Revolution.",
      "The student shows a minimal understanding of the economic hardships faced by families during the American Revolution, with significant gaps in knowledge.",
      "The student identifies some economic hardships faced by families during the American Revolution but lacks depth in explanation.",
      "The student adequately explains the economic hardships faced by families during the American Revolution, providing some specific examples.",
      "The student thoroughly explains the economic hardships faced by families during the American Revolution, providing detailed examples and showing a strong understanding of the topic.",
      "The student demonstrates an exceptional understanding of the economic hardships faced by families during the American Revolution, providing insightful analysis and going beyond the basic requirements."
    ],
    [
      "The student demonstrates no understanding of the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering.",
      "The student shows a minimal understanding of the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering, with significant gaps in knowledge.",
      "The student identifies some problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering but lacks depth in explanation.",
      "The student adequately explains the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering, providing some specific examples.",
      "The student thoroughly explains the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering, providing detailed examples and showing a strong understanding of the topic.",
      "The student demonstrates an exceptional understanding of the problems of financing the war, wartime inflation, and laws against hoarding goods and materials and profiteering, providing insightful analysis and going beyond the basic requirements."
    ],
    [
      "The student demonstrates no understanding of the personal impact of the war on families.",
      "The student shows a minimal understanding of the personal impact of the war on families, with significant gaps in knowledge.",
      "The student identifies some personal impacts of the war on families but lacks depth in explanation.",
      "The student adequately explains the personal impact of the war on families, providing some specific examples.",
      "The student thoroughly explains the personal impact of the war on families, providing detailed examples and showing a strong understanding of the topic.",
      "The student demonstrates an exceptional understanding of the personal impact of the war on families, providing insightful analysis and going beyond the basic requirements."
    ]
  ]
}