{
  "criteria": [
    "Accuracy of comparison between the lives and opportunities of free blacks in the North and South.",
    "Depth of analysis regarding the opportunities available to free blacks in the North versus the South.",
    "Use of historical evidence to support claims."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the differences or similarities between the lives of free blacks in the North and South.",
      "Demonstrates a minimal understanding, with significant inaccuracies or omissions.",
      "Identifies a few basic differences and\/or similarities, but lacks depth and contains some inaccuracies.",
      "Presents a mostly accurate comparison, identifying several key differences and similarities with reasonable depth.",
      "Provides a comprehensive and accurate comparison, thoroughly exploring key differences and similarities with strong supporting details.",
      "Offers an exceptionally insightful and nuanced comparison, demonstrating a deep understanding of the complexities of the lives of free blacks in both regions, and providing compelling evidence."
    ],
    [
      "Shows no understanding of the opportunities available to free blacks in either region.",
      "Demonstrates a limited understanding of opportunities, with vague or unsubstantiated claims.",
      "Identifies some basic opportunities in each region, but lacks detailed analysis or supporting evidence.",
      "Analyzes the opportunities in both regions with reasonable depth, providing some supporting evidence and recognizing limitations.",
      "Provides a thorough analysis of the opportunities, including economic, social, and political factors, with strong supporting evidence.",
      "Offers an insightful and nuanced analysis, exploring the complexities and contradictions of the opportunities available, and demonstrating exceptional understanding of the historical context."
    ],
    [
      "Provides no historical evidence.",
      "Provides minimal and\/or irrelevant historical evidence.",
      "Provides some relevant historical evidence, but it is limited or not well-integrated.",
      "Provides relevant historical evidence to support most claims, but could be more thorough.",
      "Effectively uses a variety of relevant historical evidence to support all claims.",
      "Masterfully integrates a wide range of compelling historical evidence, demonstrating a sophisticated understanding of source material."
    ]
  ]
}