{
  "criteria": [
    "Understanding of Separated and Shared Powers",
    "Understanding the Role of Organized Interests (Federalist Paper No. 10)",
    "Understanding Checks and Balances (Federalist Paper No. 51)",
    "Understanding the Importance of an Independent Judiciary (Federalist Paper No. 78)",
    "Knowledge of Enumerated Powers, Rule of Law, Federalism, and Civilian Control of the Military"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of separated and shared powers.",
      "Student demonstrates a minimal understanding of separated and shared powers, with significant inaccuracies.",
      "Student demonstrates a basic understanding of separated and shared powers but struggles to explain key aspects.",
      "Student demonstrates a satisfactory understanding of separated and shared powers and can explain most aspects accurately.",
      "Student demonstrates a strong understanding of separated and shared powers, explaining them clearly and accurately with minor details missing.",
      "Student demonstrates a comprehensive understanding of separated and shared powers, explaining them clearly, accurately, and with relevant examples."
    ],
    [
      "Student demonstrates no understanding of the role of organized interests as described in Federalist Paper No. 10.",
      "Student demonstrates a minimal understanding of the role of organized interests, with significant misconceptions.",
      "Student demonstrates a basic understanding but struggles to explain the significance of Federalist Paper No. 10.",
      "Student demonstrates a satisfactory understanding and can explain the main arguments of Federalist Paper No. 10.",
      "Student demonstrates a strong understanding, explaining the arguments clearly and accurately with some historical context.",
      "Student demonstrates a comprehensive understanding, explaining the arguments clearly, accurately, with historical context and modern implications."
    ],
    [
      "Student demonstrates no understanding of checks and balances as described in Federalist Paper No. 51.",
      "Student demonstrates a minimal understanding of checks and balances, with significant inaccuracies.",
      "Student demonstrates a basic understanding but struggles to provide examples of checks and balances in action.",
      "Student demonstrates a satisfactory understanding and can provide some accurate examples of checks and balances.",
      "Student demonstrates a strong understanding, explaining the system clearly and accurately with multiple examples.",
      "Student demonstrates a comprehensive understanding, explaining the system clearly, accurately, with multiple examples, and analyzing its effectiveness."
    ],
    [
      "Student demonstrates no understanding of the importance of an independent judiciary as described in Federalist Paper No. 78.",
      "Student demonstrates a minimal understanding of the judiciary's role, with significant misconceptions.",
      "Student demonstrates a basic understanding but struggles to explain why independence is crucial.",
      "Student demonstrates a satisfactory understanding and can explain why an independent judiciary is important.",
      "Student demonstrates a strong understanding, explaining the importance clearly and accurately with supporting arguments.",
      "Student demonstrates a comprehensive understanding, explaining the importance clearly, accurately, with supporting arguments, and discussing potential challenges to judicial independence."
    ],
    [
      "Student demonstrates no knowledge of enumerated powers, rule of law, federalism, or civilian control of the military.",
      "Student demonstrates minimal knowledge of these concepts, with significant inaccuracies and omissions.",
      "Student demonstrates a basic understanding of some of these concepts but struggles to explain their significance or provide examples.",
      "Student demonstrates a satisfactory understanding of these concepts and can explain their basic significance with some examples.",
      "Student demonstrates a strong understanding of these concepts, explaining them clearly and accurately with relevant examples.",
      "Student demonstrates a comprehensive understanding of these concepts, explaining them clearly, accurately, with relevant examples, and analyzing their impact on American democracy."
    ]
  ]
}