{
  "criteria": [
    "Understanding of the Trans-Saharan Trade Network",
    "Knowledge of Islamic Influence",
    "Explanation of Religious and Cultural Changes",
    "Historical Context and Accuracy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the trans-Saharan trade network or its significance.",
      "Demonstrates a minimal understanding of the trans-Saharan trade network; struggles to identify its key components.",
      "Identifies the trans-Saharan trade network but lacks depth in explaining its operational mechanisms and importance.",
      "Explains the basic workings of the trans-Saharan trade network, including major trade routes and goods exchanged.",
      "Provides a comprehensive explanation of the trans-Saharan trade network, detailing trade routes, goods, and its economic impact.",
      "Offers an insightful analysis of the trans-Saharan trade network, including its complexities, challenges, and profound economic effects."
    ],
    [
      "Shows no awareness of the influence of Islamic beliefs, ethics, and law in West Africa.",
      "Displays a vague awareness of Islamic influence but cannot provide specific examples.",
      "Identifies Islam as a factor in West Africa's development but lacks specifics on beliefs, ethics, or laws.",
      "Describes the general influence of Islamic beliefs, ethics, and law on West African society.",
      "Explains specific examples of how Islamic beliefs, ethics, and law influenced West African society, culture, and governance.",
      "Analyzes the nuanced impact of Islamic beliefs, ethics, and law, including both positive contributions and areas of conflict or adaptation."
    ],
    [
      "Fails to address the religious and cultural changes occurring in West Africa during the period.",
      "Mentions religious and cultural changes but does not connect them to the trans-Saharan trade or Islamic influence.",
      "Identifies some religious and cultural changes, linking them vaguely to trade and Islam.",
      "Describes the religious and cultural changes in West Africa, explaining their connection to the trans-Saharan trade and Islamic influence.",
      "Provides a detailed explanation of the religious and cultural changes, offering specific examples of the impact of trade and Islamic beliefs.",
      "Offers an insightful analysis of the complex interplay between trade, Islamic influence, and religious\/cultural transformations in West Africa, addressing diverse perspectives."
    ],
    [
      "Presents information with significant historical inaccuracies or lacks any context.",
      "Demonstrates limited historical accuracy and struggles with contextualizing events.",
      "Shows a basic understanding of historical context but includes some inaccuracies.",
      "Presents generally accurate information within a reasonable historical context.",
      "Demonstrates strong historical accuracy and provides a well-developed context for understanding events.",
      "Exhibits expert-level historical accuracy and contextualization, offering nuanced insights into the period."
    ]
  ]
}