{
  "criteria": [
    "Understanding of U.S. interests in the Middle East",
    "Knowledge of U.S. Middle East Policy",
    "Understanding of the Gulf War's relation to U.S. interests",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of U.S. interests in the Middle East.",
      "Demonstrates a very limited understanding of U.S. interests in the Middle East.",
      "Identifies a few U.S. interests in the Middle East but lacks depth.",
      "Describes several U.S. interests in the Middle East with some explanation.",
      "Explains U.S. strategic, political, and economic interests in the Middle East with clear examples.",
      "Provides a comprehensive analysis of U.S. strategic, political, and economic interests in the Middle East, demonstrating a nuanced understanding."
    ],
    [
      "Shows no knowledge of U.S. Middle East Policy.",
      "Shows very limited knowledge of U.S. Middle East Policy.",
      "Identifies a few aspects of U.S. Middle East Policy, but lacks context.",
      "Describes U.S. Middle East Policy with some accuracy.",
      "Explains U.S. Middle East Policy, providing relevant historical context.",
      "Provides a detailed explanation of U.S. Middle East Policy, analyzing its evolution and impact."
    ],
    [
      "Shows no understanding of the Gulf War's relation to U.S. interests.",
      "Shows a very limited understanding of the Gulf War's relation to U.S. interests.",
      "Identifies the Gulf War but does not connect it to U.S. interests.",
      "Describes the Gulf War and makes a basic connection to U.S. interests.",
      "Explains the Gulf War's connection to U.S. strategic, political, and economic interests.",
      "Analyzes the Gulf War's impact on U.S. Middle East policy and its long-term implications for U.S. interests."
    ],
    [
      "Provides no evidence or examples to support claims.",
      "Provides minimal and\/or irrelevant evidence or examples.",
      "Provides some evidence or examples, but they are not always relevant or well-explained.",
      "Supports claims with relevant evidence and examples.",
      "Effectively uses a variety of evidence and examples to support claims and enhance understanding.",
      "Demonstrates mastery through the skillful use of diverse and compelling evidence and examples to support claims, showing synthesis and insight."
    ]
  ]
}