{
  "criteria": [
    "Understanding of Aryan Invasions",
    "Analysis of Geographic Impact",
    "Explanation of Political, Economic, Religious, and Social Structures"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Aryan invasions or their impact.",
      "Shows minimal understanding of the Aryan invasions; struggles to identify key aspects.",
      "Identifies the Aryan invasions but provides limited details on their significance.",
      "Explains the Aryan invasions and offers some insight into their political, economic, or social impact.",
      "Discusses the Aryan invasions, explaining their significance and impact on multiple facets of early Indian civilization.",
      "Provides a comprehensive analysis of the Aryan invasions, detailing their significance across geographic, political, economic, religious, and social structures of early India, demonstrating nuanced understanding."
    ],
    [
      "Does not address the geographic impact of the Aryan invasions.",
      "Mentions the geographic aspect but does not elaborate on its significance.",
      "Briefly describes the geographic regions affected by the Aryan invasions.",
      "Explains how the Aryan invasions influenced settlement patterns or resource use.",
      "Analyzes the geographic impact, providing specific examples of how landscapes or regions changed due to the Aryan influence.",
      "Offers an in-depth analysis of the long-term geographic consequences, connecting them to broader historical developments and societal changes in early India."
    ],
    [
      "Fails to mention the political, economic, religious, or social structures.",
      "Mentions one or two structures but provides no explanation of their relevance.",
      "Identifies the political, economic, religious, and social structures of the time but provides little detail.",
      "Describes how the Aryan invasions affected at least three of the political, economic, religious, and social structures.",
      "Explains in detail how the Aryan invasions influenced the political, economic, religious, and social structures of early India, providing specific examples.",
      "Presents a sophisticated analysis of the interconnectedness of the political, economic, religious, and social structures, explaining how the Aryan invasions reshaped early Indian society with lasting effects."
    ]
  ]
}