{
  "criteria": [
    "Understanding of the historical context surrounding federal Indian policy during the Industrial Revolution era.",
    "Identification of reasons for the development of federal Indian policy.",
    "Analysis of the relationship between wars with American Indians and agricultural development and industrialization."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context or the relationship between federal Indian policy and the Industrial Revolution.",
      "Shows a minimal understanding of the historical context with significant gaps in knowledge of the relationship between federal Indian policy and the Industrial Revolution.",
      "Displays a basic understanding of the historical context but struggles to connect federal Indian policy, wars with American Indians, agricultural development, and industrialization.",
      "Exhibits a satisfactory understanding of the historical context, making some connections between federal Indian policy, wars with American Indians, agricultural development, and industrialization.",
      "Demonstrates a strong understanding of the historical context and clearly connects federal Indian policy, wars with American Indians, agricultural development, and industrialization, providing supporting details.",
      "Shows a comprehensive and nuanced understanding of the historical context, expertly connecting federal Indian policy, wars with American Indians, agricultural development, and industrialization with insightful analysis and supporting evidence."
    ],
    [
      "Fails to identify any reasons for the development of federal Indian policy.",
      "Identifies only one or two reasons for the development of federal Indian policy with limited accuracy.",
      "Identifies some reasons for the development of federal Indian policy but lacks depth and detail.",
      "Identifies several reasons for the development of federal Indian policy with reasonable accuracy and detail.",
      "Identifies multiple reasons for the development of federal Indian policy, providing specific examples and explanations.",
      "Provides a thorough and insightful analysis of the reasons for the development of federal Indian policy, demonstrating a deep understanding of the complexities involved."
    ],
    [
      "Demonstrates no understanding of the relationship between wars with American Indians and agricultural development and industrialization.",
      "Shows a minimal understanding of the relationship, with significant misconceptions or omissions.",
      "Describes a superficial relationship between wars with American Indians and agricultural development and industrialization.",
      "Explains a reasonable relationship between wars with American Indians and agricultural development and industrialization, but lacks depth of analysis.",
      "Analyzes the relationship between wars with American Indians and agricultural development and industrialization, providing specific examples and supporting evidence.",
      "Offers a comprehensive and insightful analysis of the complex relationship between wars with American Indians, agricultural development, and industrialization, demonstrating a nuanced understanding of the historical forces at play."
    ]
  ]
}