{
  "criteria": [
    "Understanding of Causes and Effects of Conflicts",
    "Knowledge of Specific Conflicts (Pequot War, King Philip's War, Powhatan Wars, French and Indian War)",
    "Connection to Overarching Standard (Cooperation and Conflict between American Indians and Settlers)"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes or effects of the conflicts before the Revolutionary War.",
      "Demonstrates a minimal understanding of the causes or effects of the conflicts before the Revolutionary War, with significant inaccuracies.",
      "Identifies some causes or effects of the conflicts, but lacks depth or accuracy in explanations.",
      "Explains several causes and effects of the conflicts before the Revolutionary War with reasonable accuracy.",
      "Explains the major causes and effects of the conflicts before the Revolutionary War with accuracy and provides relevant details.",
      "Provides a comprehensive and nuanced explanation of the causes and effects of multiple conflicts before the Revolutionary War, demonstrating a deep understanding of their historical significance."
    ],
    [
      "Shows no awareness of the specific conflicts listed (Pequot War, King Philip's War, Powhatan Wars, French and Indian War).",
      "Demonstrates very limited knowledge of the specific conflicts, with significant confusion or inaccuracies.",
      "Identifies at least one of the specific conflicts but struggles to provide accurate details.",
      "Provides basic information about several of the specific conflicts with reasonable accuracy.",
      "Accurately describes multiple specific conflicts, including key events and figures.",
      "Demonstrates in-depth knowledge of all specified conflicts, including causes, key events, figures, and consequences, and connects them to broader historical themes."
    ],
    [
      "Fails to connect the specific conflicts to the broader theme of cooperation and conflict between American Indians and settlers.",
      "Makes a weak or inaccurate connection between the specific conflicts and the overarching theme.",
      "Attempts to connect the specific conflicts to the overarching theme, but the explanation is superficial.",
      "Explains how the specific conflicts illustrate the tensions between American Indians and settlers.",
      "Clearly and accurately explains how the specific conflicts exemplify the complex relationship between American Indians and settlers, including elements of both cooperation and conflict.",
      "Provides a sophisticated analysis of how the specific conflicts illuminate the multifaceted relationship between American Indians and settlers, considering political, economic, and social factors, and acknowledging the diverse experiences of different groups."
    ]
  ]
}