{
  "criteria": [
    "Understanding of Meso-American achievements in astronomy and mathematics",
    "Explanation of the development of the Meso-American calendar.",
    "Analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Meso-American achievements in astronomy and mathematics.",
      "Demonstrates a minimal understanding of Meso-American achievements in astronomy and mathematics.",
      "Demonstrates a basic understanding of Meso-American achievements in astronomy and mathematics.",
      "Demonstrates a satisfactory understanding of Meso-American achievements in astronomy and mathematics, including the calendar and seasonal changes.",
      "Demonstrates a strong understanding of Meso-American achievements in astronomy and mathematics, including the calendar and seasonal changes, with some specific examples.",
      "Demonstrates a comprehensive understanding of Meso-American achievements in astronomy and mathematics, including the calendar and seasonal changes, with detailed examples and insightful analysis."
    ],
    [
      "Unable to explain the development of the Meso-American calendar.",
      "Provides a vague or inaccurate explanation of the development of the Meso-American calendar.",
      "Provides a basic explanation of the development of the Meso-American calendar with some inaccuracies.",
      "Provides a clear explanation of the development of the Meso-American calendar, including its purpose and structure.",
      "Provides a detailed explanation of the development of the Meso-American calendar, including its purpose, structure, and significance.",
      "Provides a comprehensive and insightful explanation of the development of the Meso-American calendar, including its purpose, structure, significance, and its impact on Meso-American society."
    ],
    [
      "Unable to analyze the Meso-American knowledge of seasonal changes and its relation to agricultural systems.",
      "Provides a superficial or inaccurate analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems.",
      "Provides a basic analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems with some inaccuracies.",
      "Provides a clear analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems.",
      "Provides a detailed analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems, including specific examples.",
      "Provides a comprehensive and insightful analysis of the Meso-American knowledge of seasonal changes and its relation to agricultural systems, including specific examples and a discussion of its impact on Meso-American civilization."
    ]
  ]
}