{
  "criteria": [
    "Understanding of German, Italian, and Japanese Expansionist Drives",
    "Knowledge of Key Events and Atrocities",
    "Comparison of Imperialistic Drives"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s.",
      "Demonstrates a very limited understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s. Information is vague or inaccurate.",
      "Demonstrates a basic understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s, providing some supporting details.",
      "Demonstrates a strong understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s, providing clear and accurate supporting details.",
      "Demonstrates a comprehensive understanding of the expansionist drives of Germany, Italy, and Japan in the 1930s, providing insightful and well-supported details, including nuances and complexities."
    ],
    [
      "Shows no awareness of key events like the Rape of Nanking, other atrocities in China, or the Stalin-Hitler Pact.",
      "Shows minimal awareness of key events like the Rape of Nanking, other atrocities in China, or the Stalin-Hitler Pact; information may be significantly inaccurate.",
      "Identifies key events like the Rape of Nanking, other atrocities in China, and the Stalin-Hitler Pact, but lacks detail and context.",
      "Describes key events like the Rape of Nanking, other atrocities in China, and the Stalin-Hitler Pact with some relevant details.",
      "Explains key events like the Rape of Nanking, other atrocities in China, and the Stalin-Hitler Pact with accurate and specific details.",
      "Analyzes key events like the Rape of Nanking, other atrocities in China, and the Stalin-Hitler Pact with thorough, accurate, and insightful details, demonstrating a nuanced understanding of their significance."
    ],
    [
      "Offers no comparison of the German, Italian, and Japanese drives for empire.",
      "Offers a superficial or inaccurate comparison of the German, Italian, and Japanese drives for empire.",
      "Provides a limited comparison of the German, Italian, and Japanese drives for empire, identifying few similarities or differences.",
      "Compares the German, Italian, and Japanese drives for empire, identifying some similarities and differences with supporting information.",
      "Compares the German, Italian, and Japanese drives for empire effectively, clearly articulating similarities and differences with specific examples.",
      "Provides a sophisticated comparison of the German, Italian, and Japanese drives for empire, analyzing the underlying motivations, strategies, and consequences of each with insightful observations."
    ]
  ]
}