{
  "criteria": [
    "Understanding of Lincoln's Key Writings and Speeches",
    "Connection to the Declaration of Independence",
    "Historical Context and Significance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of Lincoln's writings or speeches.",
      "The student can identify one of Lincoln's key writings or speeches but shows limited understanding of its content or significance.",
      "The student can identify several of Lincoln's key writings and speeches and demonstrates a basic understanding of their content.",
      "The student accurately describes Lincoln's 'House Divided' speech, Gettysburg Address, Emancipation Proclamation, and inaugural addresses, and their historical context.",
      "The student analyzes the key themes and arguments presented in Lincoln's writings and speeches and explains their significance during the Civil War era.",
      "The student provides a nuanced analysis of Lincoln's writings and speeches, connecting them to the broader context of the Civil War, the Declaration of Independence, and the evolution of American political thought, demonstrating a deep understanding of their lasting impact and rhetorical devices used."
    ],
    [
      "The student fails to make any connection between Lincoln's writings\/speeches and the Declaration of Independence.",
      "The student vaguely mentions the Declaration of Independence but does not explain its relationship to Lincoln's work.",
      "The student identifies a general connection between Lincoln's ideas and the principles of the Declaration of Independence.",
      "The student explains how Lincoln used the principles of the Declaration of Independence (e.g., equality, liberty) in his arguments and policies.",
      "The student analyzes how Lincoln interpreted and applied the Declaration of Independence to address the challenges of the Civil War, particularly slavery and national unity.",
      "The student critically evaluates Lincoln's use of the Declaration of Independence, considering both its successes and limitations in shaping his policies and rhetoric, and exploring alternative interpretations and perspectives of the time."
    ],
    [
      "The student demonstrates no understanding of the historical context surrounding Lincoln's presidency and the Civil War.",
      "The student mentions the Civil War but does not explain how it influenced Lincoln's writings and speeches.",
      "The student describes the basic historical context of the Civil War and its impact on Lincoln's actions.",
      "The student explains how the events and challenges of the Civil War shaped Lincoln's writings, speeches, and policies.",
      "The student analyzes the social, political, and economic factors that influenced Lincoln's decisions and rhetoric during the Civil War.",
      "The student synthesizes a comprehensive understanding of the historical context, analyzing the long-term consequences of Lincoln's actions and ideas on American society, politics, and culture, and evaluating his leadership in the face of unprecedented challenges."
    ]
  ]
}