{
  "criteria": [
    "Understanding of the American Revolution's Impact on France",
    "Connection to Broader European Context",
    "Use of Historical Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the American Revolution's impact on France or other nations.",
      "Demonstrates a minimal understanding of the American Revolution's impact, with limited or inaccurate information regarding France.",
      "Identifies the American Revolution as an influence, but provides superficial details on its effects on France.",
      "Explains some of the key ways the American Revolution affected France, such as inspiring revolutionary ideas, but lacks depth.",
      "Analyzes the significant ways the American Revolution influenced France, providing specific examples of political, social, or economic impacts.",
      "Provides a comprehensive analysis of the multifaceted impacts of the American Revolution on France, including specific details and nuanced connections to French society and politics, demonstrating a thorough understanding of the topic."
    ],
    [
      "Does not connect the American Revolution's impact to any broader European context.",
      "Attempts to connect the American Revolution's impact, but the connection is vague or inaccurate.",
      "Identifies other nations besides France potentially affected by the American Revolution but provides limited detail.",
      "Describes the general effects of the American Revolution on European societes, without much detail.",
      "Analyzes the ways the American Revolution influenced France as part of a broader European transformation, with specific examples and good detail.",
      "Provides a comprehensive analysis of the American Revolution's impact on France within the broader European context, including insightful details and nuanced connections, and demonstrating a thorough understanding of the topic."
    ],
    [
      "Provides no historical evidence to support claims.",
      "Provides minimal and\/or inaccurate historical evidence.",
      "Provides some historical evidence, but it is not well-integrated or fully relevant.",
      "Supports claims with relevant historical evidence, but analysis is somewhat limited.",
      "Effectively uses historical evidence to support claims with clear and insightful analysis.",
      "Uses a wide range of historical evidence expertly, offering nuanced and compelling analysis that demonstrates a sophisticated understanding of the topic."
    ]
  ]
}