{
  "criteria": [
    "Understanding of the Great Depression's Impact on Presidential Power",
    "Understanding of World War II's Impact on Presidential Power",
    "Understanding of the Cold War's Impact on Presidential Power",
    "Ability to Connect Historical Events to the Expansion of Presidential Power"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how the Great Depression influenced the powers of the presidency.",
      "Shows a limited awareness of the Great Depression and its connection to the presidency, but lacks specifics.",
      "Identifies the Great Depression as a factor, but provides only superficial details on its impact on presidential power.",
      "Explains how the Great Depression led to some expansion of presidential power, citing examples such as the New Deal, but lacks depth.",
      "Analyzes the specific ways in which the Great Depression expanded presidential power, providing detailed examples and explanations of policies and their effects.",
      "Offers a comprehensive analysis of the Great Depression's lasting impact on presidential power, including nuanced discussion of its constitutional implications and historical context."
    ],
    [
      "Demonstrates no understanding of how World War II influenced the powers of the presidency.",
      "Shows a limited awareness of World War II and its connection to the presidency, but lacks specifics.",
      "Identifies World War II as a factor, but provides only superficial details on its impact on presidential power.",
      "Explains how World War II led to some expansion of presidential power, citing examples such as war mobilization, but lacks depth.",
      "Analyzes the specific ways in which World War II expanded presidential power, providing detailed examples and explanations of executive orders, wartime agencies, and their effects.",
      "Offers a comprehensive analysis of World War II's lasting impact on presidential power, including nuanced discussion of its impact on civil liberties and the balance of power between the executive and legislative branches."
    ],
    [
      "Demonstrates no understanding of how the Cold War influenced the powers of the presidency.",
      "Shows a limited awareness of the Cold War and its connection to the presidency, but lacks specifics.",
      "Identifies the Cold War as a factor, but provides only superficial details on its impact on presidential power.",
      "Explains how the Cold War led to some expansion of presidential power, citing examples such as the creation of national security agencies, but lacks depth.",
      "Analyzes the specific ways in which the Cold War expanded presidential power, providing detailed examples and explanations of covert operations, defense spending, and their effects.",
      "Offers a comprehensive analysis of the Cold War's lasting impact on presidential power, including nuanced discussion of its impact on foreign policy decision-making and the role of the president in international affairs."
    ],
    [
      "Fails to make any connections between the historical events and the expansion of presidential power.",
      "Makes vague or unsubstantiated connections between the historical events and presidential power.",
      "Identifies some connections, but lacks specific examples or explanations.",
      "Connects the historical events to the expansion of presidential power with some relevant examples.",
      "Clearly and logically connects the historical events to specific expansions of presidential power, providing detailed explanations and examples.",
      "Offers a sophisticated analysis of the connections between the historical events and the evolving nature of presidential power, including nuanced discussion of long-term trends and their implications."
    ]
  ]
}