{
  "criteria": [
    "Formulating Questions about Tensions in Constitutional Democracy",
    "Analyzing Tensions within Constitutional Democracy",
    "Defending Analyses of Tensions",
    "Understanding the Importance of Maintaining Balance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of tensions within constitutional democracy and cannot formulate relevant questions.",
      "The student struggles to identify tensions within constitutional democracy and formulates vague or irrelevant questions.",
      "The student identifies some tensions within constitutional democracy but struggles to formulate clear and focused questions.",
      "The student formulates adequate questions about tensions within constitutional democracy, showing a basic understanding of the concepts.",
      "The student formulates insightful questions about tensions within constitutional democracy, demonstrating a solid understanding of the concepts and their implications.",
      "The student formulates highly insightful and probing questions about tensions within constitutional democracy, demonstrating a sophisticated understanding of the concepts and their complex interrelationships."
    ],
    [
      "The student provides no analysis of tensions within constitutional democracy.",
      "The student's analysis of tensions within constitutional democracy is superficial and lacks supporting evidence.",
      "The student provides a limited analysis of tensions within constitutional democracy with minimal supporting evidence.",
      "The student provides a reasonable analysis of tensions within constitutional democracy with some supporting evidence.",
      "The student provides a thorough analysis of tensions within constitutional democracy, supported by relevant evidence and examples.",
      "The student provides a comprehensive and nuanced analysis of tensions within constitutional democracy, supported by compelling evidence and insightful interpretations."
    ],
    [
      "The student is unable to defend their analysis of tensions within constitutional democracy.",
      "The student struggles to defend their analysis and provides weak or irrelevant arguments.",
      "The student attempts to defend their analysis but provides limited or inconsistent arguments.",
      "The student adequately defends their analysis with reasonable arguments and evidence.",
      "The student effectively defends their analysis with well-reasoned arguments and relevant evidence.",
      "The student convincingly defends their analysis with sophisticated arguments, compelling evidence, and a clear understanding of counterarguments."
    ],
    [
      "The student shows no understanding of the importance of maintaining a balance between key concepts within constitutional democracy.",
      "The student demonstrates a limited understanding of the importance of maintaining a balance between key concepts.",
      "The student identifies some key concepts but struggles to explain the importance of maintaining a balance between them.",
      "The student explains the importance of maintaining a balance between key concepts with reasonable clarity.",
      "The student clearly explains the importance of maintaining a balance between key concepts, providing relevant examples and explanations.",
      "The student demonstrates a deep understanding of the importance of maintaining a balance between key concepts, providing insightful examples and a nuanced perspective."
    ]
  ]
}