{
  "criteria": [
    "Understanding the Causes of the Great Depression",
    "Analysis of the New Deal's Impact on the Role of the Federal Government",
    "Ability to Compare and Contrast Different Explanations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the causes of the Great Depression.",
      "Student identifies one or two causes of the Great Depression with limited accuracy.",
      "Student identifies several causes of the Great Depression, but explanations lack depth and clarity.",
      "Student explains multiple causes of the Great Depression with reasonable accuracy and clarity.",
      "Student provides a thorough explanation of the various causes of the Great Depression, demonstrating a strong understanding of the complexities involved.",
      "Student demonstrates a comprehensive and nuanced understanding of the causes of the Great Depression, including economic, social, and political factors, and provides insightful analysis."
    ],
    [
      "Student shows no understanding of how the New Deal changed the role of the federal government.",
      "Student mentions one or two ways the New Deal affected the government's role with limited accuracy.",
      "Student identifies several changes brought about by the New Deal, but explanations are superficial.",
      "Student explains how the New Deal fundamentally altered the role of the federal government with reasonable clarity and accuracy.",
      "Student provides a detailed analysis of the New Deal's impact, demonstrating a strong understanding of its lasting effects on the federal government's role and responsibilities.",
      "Student demonstrates a comprehensive and nuanced understanding of the New Deal's transformative impact on the federal government, including its long-term implications for American society and governance."
    ],
    [
      "Student does not compare or contrast different explanations for the Great Depression.",
      "Student attempts to compare or contrast explanations, but does so superficially.",
      "Student identifies some similarities or differences between explanations, but the analysis is limited.",
      "Student compares and contrasts multiple explanations for the Great Depression with reasonable accuracy and clarity.",
      "Student provides a thorough comparison and contrast of different explanations, demonstrating a strong understanding of their strengths and weaknesses.",
      "Student demonstrates a sophisticated understanding of the various explanations for the Great Depression, offering insightful analysis and synthesis of different perspectives."
    ]
  ]
}