{
  "criteria": [
    "Identification of Illegitimate Power Forms",
    "Understanding of Supporting Conditions and Interests",
    "Contextual Awareness (African, Asian, and Latin American)"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any forms of illegitimate power used by 20th-century dictators.",
      "The student identifies one form of illegitimate power with limited accuracy or detail.",
      "The student identifies two forms of illegitimate power with some accuracy but lacks depth in explanation.",
      "The student identifies three forms of illegitimate power with reasonable accuracy and provides basic explanations.",
      "The student accurately identifies and explains four forms of illegitimate power used by dictators in Africa, Asia, and Latin America.",
      "The student comprehensively identifies and explains multiple forms of illegitimate power, providing specific examples and demonstrating a nuanced understanding of their application by dictators."
    ],
    [
      "The student fails to identify any conditions or interests that supported dictators.",
      "The student identifies one condition or interest with limited accuracy.",
      "The student identifies two conditions or interests but struggles to explain their supportive role.",
      "The student identifies three conditions or interests and provides a basic explanation of their support for dictators.",
      "The student identifies and explains several conditions and interests, demonstrating a clear understanding of how they enabled dictators to gain and hold power.",
      "The student comprehensively analyzes the complex interplay of conditions and interests that sustained dictators, offering insightful commentary on their relative importance and impact."
    ],
    [
      "The student shows no awareness of the specific contexts within Africa, Asia, or Latin America.",
      "The student demonstrates minimal awareness, with generalizations or inaccuracies regarding the regions.",
      "The student shows some awareness of regional contexts but lacks specific examples or details.",
      "The student demonstrates an understanding of the contexts within each region, giving a couple examples of each region.",
      "The student demonstrates a good understanding of the contexts within Africa, Asia, and Latin America, providing relevant examples and details.",
      "The student demonstrates a comprehensive understanding of the diverse contexts within Africa, Asia, and Latin America, providing nuanced examples and demonstrating a grasp of historical and cultural factors."
    ]
  ]
}