{
  "criteria": [
    "Understanding of the causes and consequences of the Mexican War for Independence on Alta California.",
    "Explanation of the effects on the territorial boundaries of North America.",
    "Analysis of the social, political, cultural, and economic impacts on Alta California."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the causes or consequences of the Mexican War for Independence on Alta California.",
      "Student demonstrates minimal understanding of either the causes or consequences of the war, but not both.",
      "Student demonstrates a basic understanding of either the causes or the consequences of the war on Alta California, but lacks depth.",
      "Student demonstrates a satisfactory understanding of both the causes and consequences of the war, but may have some inaccuracies or omissions.",
      "Student demonstrates a strong understanding of the causes and consequences of the war on Alta California, with few inaccuracies.",
      "Student demonstrates a comprehensive and insightful understanding of the causes and consequences of the war on Alta California, including nuanced perspectives and accurate details."
    ],
    [
      "Student does not address the effects on territorial boundaries.",
      "Student mentions territorial changes but provides no specific details or connections to the war.",
      "Student identifies some territorial changes resulting from the war but lacks specific details or explanation of the significance.",
      "Student explains the major territorial changes resulting from the war, such as the Mexican Cession, but may lack detail.",
      "Student thoroughly explains the territorial changes, including the Mexican Cession and its impact on the map of North America, with specific details.",
      "Student provides a comprehensive and nuanced explanation of the territorial changes, including the long-term geopolitical implications for North America."
    ],
    [
      "Student fails to address the social, political, cultural, or economic impacts.",
      "Student mentions one or two impacts but provides no analysis or explanation.",
      "Student identifies some social, political, cultural, or economic impacts but lacks depth in analysis.",
      "Student provides a satisfactory analysis of the social, political, cultural, and economic impacts on Alta California, covering at least three of these areas.",
      "Student provides a strong analysis of the social, political, cultural, and economic impacts, demonstrating a clear understanding of the complexities.",
      "Student provides a comprehensive and insightful analysis of the social, political, cultural, and economic impacts, demonstrating a nuanced understanding of the interconnectedness of these areas."
    ]
  ]
}