{
  "criteria": [
    "Understanding the Significance of the Magna Carta",
    "Knowledge of the Development and Role of Parliament",
    "Understanding of Habeas Corpus and Independent Judiciary",
    "Connecting Medieval Developments to Modern Democratic Thought"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Magna Carta or its significance.",
      "Shows minimal understanding; struggles to identify its purpose or impact.",
      "Identifies the Magna Carta but provides a superficial explanation of its significance.",
      "Explains the Magna Carta's basic principles and its initial impact on limiting royal power.",
      "Analyzes the Magna Carta's key provisions and its long-term significance for individual rights and the rule of law.",
      "Evaluates the Magna Carta's profound and lasting impact on the development of democratic thought and constitutionalism, connecting it to contemporary legal and political concepts."
    ],
    [
      "Demonstrates no knowledge of the development or role of Parliament.",
      "Shows minimal awareness of Parliament; struggles to define its basic function.",
      "Identifies Parliament as a legislative body but provides a limited explanation of its historical development or powers.",
      "Explains the origins of Parliament and its evolving role in English government during the medieval period.",
      "Analyzes the key stages in Parliament's development, including its struggles for power with the monarchy and its increasing representation of different social groups.",
      "Evaluates Parliament's crucial role in the rise of representative institutions, explaining its structure, powers, and impact on the balance of power in England and beyond."
    ],
    [
      "Demonstrates no understanding of habeas corpus or the concept of an independent judiciary.",
      "Shows minimal awareness of these concepts; struggles to define them or explain their importance.",
      "Provides a basic definition of habeas corpus and\/or an independent judiciary but does not explain their significance in detail.",
      "Explains the purpose of habeas corpus as a protection against unlawful imprisonment and the importance of an independent judiciary for ensuring fair trials.",
      "Analyzes the historical development of habeas corpus and the gradual establishment of an independent judiciary in England, explaining the challenges and obstacles faced.",
      "Evaluates the fundamental importance of habeas corpus and an independent judiciary for protecting individual liberties, upholding the rule of law, and preventing abuses of power, connecting these concepts to modern legal systems and human rights."
    ],
    [
      "Fails to connect medieval English legal practices to modern democratic thought.",
      "Struggles to make connections between medieval developments and modern democratic concepts.",
      "Identifies some links between medieval practices and modern democracy but provides limited explanation.",
      "Explains how developments like the Magna Carta and Parliament laid the groundwork for modern democratic principles such as limited government and representative institutions.",
      "Analyzes the specific ways in which medieval English legal and constitutional practices influenced the development of modern democratic thought and institutions in England and other countries.",
      "Evaluates the complex and enduring legacy of medieval English legal and constitutional practices for the development of modern democracy, considering both their contributions and limitations."
    ]
  ]
}