{
  "criteria": [
    "Understanding of White Southern Social Structure",
    "Analysis of the Influence of the Physical Environment",
    "Identification of Key Characteristics of White Southern Society"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the social hierarchy, roles, and dynamics within white Southern society.",
      "Displays a minimal understanding of the social hierarchy, roles, and dynamics within white Southern society with significant inaccuracies.",
      "Shows a basic understanding of the social structure, mentioning some key elements but lacking depth or detail.",
      "Exhibits a satisfactory understanding of the social hierarchy, discussing key social classes and their roles with reasonable accuracy.",
      "Demonstrates a strong understanding of the complex social structure, including the relationships and tensions between different groups within white Southern society.",
      "Presents a comprehensive and nuanced understanding of the intricate social dynamics of white Southern society, including detailed examples and insightful analysis."
    ],
    [
      "Shows no understanding of how the physical environment impacted events and conditions in the pre-Civil War South.",
      "Displays a minimal understanding of the environment's influence, with significant inaccuracies or irrelevant information.",
      "Shows a basic understanding of the environment's influence, mentioning some key aspects but lacking depth or detail.",
      "Exhibits a satisfactory understanding of the environment's influence, discussing key aspects such as agriculture and geography with reasonable accuracy.",
      "Demonstrates a strong understanding of the complex interplay between the physical environment and Southern society, including specific examples and well-supported arguments.",
      "Presents a comprehensive and nuanced analysis of how the physical environment shaped events and conditions in the pre-Civil War South, including detailed examples and insightful interpretations."
    ],
    [
      "Unable to identify any key characteristics of white Southern society.",
      "Identifies only one or two key characteristics with limited accuracy or detail.",
      "Identifies a few key characteristics but lacks depth or detail in their explanation.",
      "Identifies several key characteristics of white Southern society, providing a general overview of each.",
      "Identifies and explains several key characteristics of white Southern society, demonstrating a strong understanding of their significance.",
      "Provides a comprehensive and insightful analysis of the defining characteristics of white Southern society, including nuanced examples and historical context."
    ]
  ]
}