{
  "criteria": [
    "Understanding the Rise of Industrial Economies",
    "Link to Imperialism and Colonialism",
    "Role of National Security and Strategic Advantage",
    "Moral Issues, Social Darwinism, and Missionary Impulse",
    "Material Issues: Land, Resources, and Technology"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of industrial economies or their development.",
      "Student shows a minimal understanding of industrial economies but struggles to explain their rise.",
      "Student can identify some factors contributing to the rise of industrial economies with limited detail.",
      "Student explains the key factors contributing to the rise of industrial economies, such as technological advancements and resource availability, with reasonable detail.",
      "Student thoroughly explains the factors leading to the rise of industrial economies, providing specific examples and demonstrating a strong understanding of the underlying mechanisms.",
      "Student provides a comprehensive and insightful explanation of the rise of industrial economies, including nuanced factors and demonstrating a mastery of the subject matter."
    ],
    [
      "Student does not connect industrial economies to imperialism and colonialism.",
      "Student vaguely mentions a connection between industrial economies and imperialism\/colonialism but lacks specifics.",
      "Student identifies a basic link between industrial economies and imperialism\/colonialism, such as the need for resources.",
      "Student explains the link between industrial economies and imperialism\/colonialism, providing examples such as resource acquisition and market expansion.",
      "Student analyzes the complex relationship between industrial economies and imperialism\/colonialism, detailing how industrialization drove colonial expansion and vice versa.",
      "Student offers a sophisticated analysis of the intricate and multifaceted relationship between industrial economies, imperialism, and colonialism, including discussions of long-term impacts and alternative perspectives."
    ],
    [
      "Student does not address the role of national security and strategic advantage in the link between industrial economies and imperialism.",
      "Student mentions national security or strategic advantage in passing, without explaining its relevance.",
      "Student identifies national security or strategic advantage as a factor in imperialism but lacks detail.",
      "Student explains how national security and strategic advantage fueled imperialistic policies, citing examples.",
      "Student analyzes the significance of national security and strategic advantage in driving imperialistic competition among industrialized nations.",
      "Student provides a nuanced perspective on the role of national security and strategic advantage, considering both intended and unintended consequences, as well as alternative motivations for imperialism."
    ],
    [
      "Student fails to address moral issues, Social Darwinism, or the missionary impulse related to imperialism.",
      "Student briefly mentions moral issues, Social Darwinism, or the missionary impulse without explaining their significance.",
      "Student identifies one of these factors (moral issues, Social Darwinism, or the missionary impulse) as related to imperialism.",
      "Student describes how moral issues, Social Darwinism, and\/or the missionary impulse were used to justify imperialism.",
      "Student critically analyzes the role of moral issues, Social Darwinism, and the missionary impulse in shaping imperialistic ideologies and actions.",
      "Student demonstrates a deep understanding of the complex interplay between moral justifications, Social Darwinism, the missionary impulse, and the realities of imperialistic exploitation, considering diverse perspectives."
    ],
    [
      "Student does not discuss material issues such as land, resources, and technology in the context of imperialism.",
      "Student vaguely mentions land, resources, or technology without explaining their importance.",
      "Student identifies land, resources, and technology as key material factors in imperialism.",
      "Student explains how the desire for land, resources, and technological advantages drove imperialistic expansion.",
      "Student analyzes the specific ways in which land, resources, and technology were exploited in various imperialistic contexts.",
      "Student offers a comprehensive analysis of the economic and technological underpinnings of imperialism, considering both the benefits for imperial powers and the devastating consequences for colonized regions."
    ]
  ]
}