{
  "criteria": [
    "Understanding of the Historical Context",
    "Analysis of Labor Organizations (AFL, CIO)",
    "Understanding of Advances and Retreats of Organized Labor",
    "Connection to the Postindustrial, Multinational Economy",
    "Focus on United Farm Workers in California"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context surrounding the labor movements.",
      "Shows a limited understanding of the historical context, with significant gaps or inaccuracies.",
      "Displays a basic understanding of the historical context, identifying some key events and figures but lacking depth.",
      "Demonstrates a good understanding of the historical context, explaining key events, figures, and their significance.",
      "Shows a strong understanding of the historical context, providing detailed explanations of the events, figures, and their impact.",
      "Exhibits an exceptional understanding of the historical context, offering nuanced insights and demonstrating a comprehensive grasp of the period."
    ],
    [
      "Unable to identify or describe the American Federation of Labor (AFL) and the Congress of Industrial Organizations (CIO).",
      "Identifies the AFL and CIO but provides minimal information about their creation or purpose.",
      "Describes the creation of the AFL and CIO with limited detail, missing key aspects of their formation and goals.",
      "Analyzes the creation and goals of the AFL and CIO, explaining their initial impact on the labor movement.",
      "Provides a detailed analysis of the AFL and CIO, comparing their strategies and assessing their successes and failures.",
      "Offers a comprehensive analysis of the AFL and CIO, including insightful comparisons of their approaches and a nuanced assessment of their long-term impact."
    ],
    [
      "Demonstrates no understanding of the advances and retreats of organized labor.",
      "Shows a limited understanding of the advances and retreats, with significant gaps or inaccuracies.",
      "Displays a basic understanding of the advances and retreats, identifying some key events but lacking depth.",
      "Demonstrates a good understanding of the advances and retreats, explaining key events and their significance.",
      "Shows a strong understanding of the advances and retreats, providing detailed explanations of the events and their impact.",
      "Exhibits an exceptional understanding of the advances and retreats, offering nuanced insights and demonstrating a comprehensive grasp of the topic."
    ],
    [
      "Fails to connect historical labor movements to current issues in a postindustrial, multinational economy.",
      "Makes a weak connection between historical labor movements and current economic issues, with limited supporting evidence.",
      "Identifies some connections between historical labor movements and current economic issues but lacks depth and analysis.",
      "Explains the connections between historical labor movements and current issues in a postindustrial, multinational economy, citing examples.",
      "Analyzes the complex connections between historical labor movements and current economic issues, providing specific examples and insights.",
      "Offers a comprehensive and insightful analysis of the connections between historical labor movements and the challenges of a postindustrial, multinational economy, demonstrating a deep understanding of the topic."
    ],
    [
      "Does not mention or demonstrate any knowledge of the United Farm Workers (UFW) in California.",
      "Mentions the UFW but provides no details about its significance or activities.",
      "Describes the UFW with limited detail, missing key aspects of its history and impact.",
      "Explains the role and significance of the UFW in California's labor movement, including key figures and events.",
      "Analyzes the impact of the UFW on labor rights and social justice in California and beyond.",
      "Offers a comprehensive and nuanced analysis of the UFW, including its strategies, successes, and lasting legacy in the fight for labor rights."
    ]
  ]
}