{
  "criteria": [
    "Understanding of the decline of Muslim rule in the Iberian Peninsula",
    "Knowledge of the Reconquista",
    "Understanding of the rise of Spanish and Portuguese kingdoms",
    "Ability to connect the decline of Muslim rule to the Reconquista and the rise of Spanish\/Portuguese kingdoms"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the decline of Muslim rule in the Iberian Peninsula.",
      "Demonstrates a very limited understanding of the decline of Muslim rule in the Iberian Peninsula, with significant inaccuracies.",
      "Demonstrates a basic understanding of the decline of Muslim rule in the Iberian Peninsula, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the decline of Muslim rule in the Iberian Peninsula, with some supporting details.",
      "Demonstrates a strong understanding of the decline of Muslim rule in the Iberian Peninsula, providing accurate and relevant details.",
      "Demonstrates a comprehensive and insightful understanding of the decline of Muslim rule in the Iberian Peninsula, providing nuanced explanations and relevant connections."
    ],
    [
      "Demonstrates no knowledge of the Reconquista.",
      "Demonstrates very limited knowledge of the Reconquista, with significant inaccuracies.",
      "Demonstrates a basic understanding of the Reconquista, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the Reconquista, with some supporting details.",
      "Demonstrates a strong understanding of the Reconquista, providing accurate and relevant details.",
      "Demonstrates a comprehensive and insightful understanding of the Reconquista, providing nuanced explanations and relevant connections."
    ],
    [
      "Demonstrates no understanding of the rise of Spanish and Portuguese kingdoms.",
      "Demonstrates a very limited understanding of the rise of Spanish and Portuguese kingdoms, with significant inaccuracies.",
      "Demonstrates a basic understanding of the rise of Spanish and Portuguese kingdoms, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the rise of Spanish and Portuguese kingdoms, with some supporting details.",
      "Demonstrates a strong understanding of the rise of Spanish and Portuguese kingdoms, providing accurate and relevant details.",
      "Demonstrates a comprehensive and insightful understanding of the rise of Spanish and Portuguese kingdoms, providing nuanced explanations and relevant connections."
    ],
    [
      "Unable to connect the decline of Muslim rule to the Reconquista and the rise of Spanish\/Portuguese kingdoms.",
      "Shows a weak connection between the decline of Muslim rule and the Reconquista and the rise of Spanish\/Portuguese kingdoms.",
      "Shows some awareness of the relationship between the decline of Muslim rule, the Reconquista, and the rise of Spanish\/Portuguese kingdoms, but the connection is not clearly articulated.",
      "Adequately connects the decline of Muslim rule, the Reconquista, and the rise of Spanish\/Portuguese kingdoms with some explanation.",
      "Clearly connects the decline of Muslim rule, the Reconquista, and the rise of Spanish\/Portuguese kingdoms with a solid explanation.",
      "Demonstrates a sophisticated understanding of how the decline of Muslim rule led to the Reconquista and the rise of Spanish\/Portuguese kingdoms, providing insightful and well-supported analysis."
    ]
  ]
}