{
  "criteria": [
    "Understanding of Mexican Immigration Significance",
    "Understanding of Relationship to Agricultural Economy",
    "Focus on California"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the significance of Mexican immigration.",
      "Shows a minimal understanding of Mexican immigration, lacking specific details.",
      "Identifies Mexican immigration as important but does not elaborate on specific reasons.",
      "Explains the general significance of Mexican immigration to the US.",
      "Analyzes the significance of Mexican immigration with specific details and examples.",
      "Provides a comprehensive analysis of the multifaceted significance of Mexican immigration, including historical context and contemporary relevance."
    ],
    [
      "Shows no understanding of the relationship between Mexican immigration and the agricultural economy.",
      "Shows a minimal understanding of the relationship between Mexican immigration and the agricultural economy, lacking specific details.",
      "Identifies a connection between Mexican immigration and the agricultural economy, but doesn't elaborate.",
      "Explains the basic relationship between Mexican immigration and the agricultural economy.",
      "Analyzes the relationship between Mexican immigration and the agricultural economy, providing specific examples.",
      "Provides a comprehensive analysis of the complex relationship, including economic impacts, labor dynamics, and policy implications."
    ],
    [
      "Does not address the specific relevance to California's agricultural economy.",
      "Mentions California but does not elaborate on its significance.",
      "Acknowledges California's role but lacks specific examples.",
      "Explains how Mexican immigration relates to California's agricultural economy.",
      "Analyzes the specific impact of Mexican immigration on California's agricultural economy.",
      "Offers a detailed and nuanced analysis of Mexican immigration's role in shaping California's agricultural landscape, considering historical trends and contemporary issues."
    ]
  ]
}