{
  "criteria": [
    "Understanding of Key Events and Policies: Demonstrates comprehension of the significant events and policies that shaped the civil rights movement.",
    "Analysis of Court Cases: Analyzes landmark court cases and their impact on civil rights.",
    "Contextualization and Connections: Places events, policies, and court cases within the broader historical context of the civil rights movement, drawing connections between them."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of key events or policies related to civil rights.",
      "Shows minimal understanding, with significant inaccuracies or omissions.",
      "Identifies a few key events and policies, but lacks depth in explanation.",
      "Explains several key events and policies accurately, showing a basic understanding of their impact.",
      "Analyzes key events and policies effectively, demonstrating a strong understanding of their significance in the civil rights movement.",
      "Provides a comprehensive and insightful analysis of key events and policies, demonstrating a nuanced understanding of their long-term impact and connections."
    ],
    [
      "Unable to identify or discuss any of the specified court cases.",
      "Attempts to identify court cases, but provides inaccurate information or fails to explain their significance.",
      "Identifies court cases (Dred Scott, Plessy, Brown, Regents of UC, Prop 209) but struggles to explain their relevance to civil rights.",
      "Explains the basic outcomes and relevance of the court cases to civil rights with some accuracy.",
      "Analyzes the court cases, explaining their legal and social impact on the evolution of civil rights.",
      "Provides an in-depth analysis of the court cases, including dissenting opinions and long-term consequences, demonstrating a sophisticated understanding of their role in shaping civil rights."
    ],
    [
      "Unable to place events, policies, or court cases in a historical context.",
      "Attempts to provide context, but struggles to make relevant connections.",
      "Provides some historical context, identifying a few connections between events, policies, and court cases.",
      "Connects several events, policies, and court cases within the historical context of the civil rights movement.",
      "Effectively contextualizes events, policies, and court cases, explaining their relationships and broader significance in the civil rights movement.",
      "Demonstrates a sophisticated understanding of the historical context, providing nuanced connections and insights into the complex relationships between events, policies, and court cases in the civil rights movement."
    ]
  ]
}