{
  "criteria": [
    "Understanding of the historical timeline and key events in the development of California's public education system.",
    "Knowledge of the major figures and policies that shaped California's public education system.",
    "Ability to analyze the social, economic, and political factors that influenced the development of California's public education system.",
    "Awareness of the evolution and current state of universities and community colleges within the California public education system."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the timeline or key events.",
      "Shows minimal understanding; struggles to identify significant events.",
      "Identifies a few key events but lacks a clear understanding of the timeline or connections between events.",
      "Demonstrates a general understanding of the timeline and key events, but may have gaps in knowledge or inaccuracies.",
      "Displays a solid understanding of the timeline and key events, with few inaccuracies.",
      "Exhibits a comprehensive understanding of the timeline, key events, and their significance in the development of California's public education system."
    ],
    [
      "Unable to identify any major figures or policies.",
      "Identifies one or two figures or policies, but lacks detail or accuracy.",
      "Identifies some major figures and policies, but struggles to explain their roles or impact.",
      "Demonstrates a reasonable knowledge of major figures and policies, but may miss some important details.",
      "Displays a strong understanding of major figures and policies, explaining their roles and impact effectively.",
      "Exhibits a thorough and nuanced understanding of the major figures and policies, including their long-term consequences."
    ],
    [
      "Unable to identify any relevant social, economic, or political factors.",
      "Identifies one or two factors, but struggles to explain their relevance.",
      "Identifies some relevant factors, but lacks depth in analysis or understanding of the interconnections.",
      "Analyzes the influence of social, economic, and political factors with some accuracy, but may oversimplify or miss key connections.",
      "Provides a well-reasoned analysis of the influence of social, economic, and political factors, demonstrating a clear understanding of the complexities.",
      "Offers a sophisticated and insightful analysis of the interplay of social, economic, and political factors, demonstrating a nuanced understanding of the historical context."
    ],
    [
      "Shows no awareness of the evolution or current state of universities and community colleges.",
      "Demonstrates minimal awareness; struggles to describe basic functions or roles.",
      "Identifies a few aspects of universities and community colleges, but lacks a broader understanding of their evolution.",
      "Demonstrates a general awareness of the evolution and current state, but may have gaps in knowledge or inaccuracies.",
      "Displays a solid understanding of the evolution and current state of universities and community colleges, with few inaccuracies.",
      "Exhibits a comprehensive understanding of the evolution, current state, challenges, and opportunities facing universities and community colleges in California."
    ]
  ]
}