{
  "criteria": [
    "Understanding of the Watergate Scandal's Constitutional Issues",
    "Identification of Key Figures and Events",
    "Analysis of the Constitutional Crisis"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Watergate scandal or its constitutional implications.",
      "Shows a limited awareness of the Watergate scandal but struggles to connect it to constitutional issues.",
      "Identifies the Watergate scandal and some of its constitutional implications but lacks depth in explanation.",
      "Explains the Watergate scandal and connects it to specific constitutional issues, such as abuse of power and obstruction of justice.",
      "Analyzes the Watergate scandal, thoroughly explaining its constitutional implications, including the roles of key figures and branches of government.",
      "Critically evaluates the Watergate scandal, providing a nuanced understanding of its constitutional impact and long-term effects on American democracy."
    ],
    [
      "Unable to identify any key figures or events related to the Watergate scandal.",
      "Identifies one or two key figures or events with significant inaccuracies.",
      "Identifies some key figures and events but misses crucial details or connections.",
      "Accurately identifies most key figures and events, explaining their roles in the scandal.",
      "Provides a comprehensive account of key figures and events, detailing their specific involvement and impact on the constitutional crisis.",
      "Offers a sophisticated analysis of the motivations and consequences of key figures and events, placing them within the broader context of American political history."
    ],
    [
      "Unable to explain how the Watergate scandal led to a constitutional crisis.",
      "Suggests a vague connection between the Watergate scandal and a constitutional crisis without providing specifics.",
      "Identifies some elements of the constitutional crisis but struggles to explain their significance.",
      "Explains how the Watergate scandal challenged the principles of separation of powers, checks and balances, and the rule of law.",
      "Analyzes the constitutional crisis in detail, explaining how the Watergate scandal tested the resilience of American democratic institutions.",
      "Critically evaluates the long-term impact of the Watergate scandal on American constitutional law and political culture, drawing parallels to contemporary issues."
    ]
  ]
}