{
  "criteria": [
    "Understanding the causes of World War I",
    "Analyzing the effects of the Treaty of Versailles",
    "Evaluating the impact of new technologies and warfare tactics"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the causes of World War I.",
      "The student can identify one or two causes of World War I, but the explanation lacks depth.",
      "The student identifies several causes of World War I, but the connections between them are not clear.",
      "The student accurately identifies and explains the major causes of World War I, such as militarism, alliances, imperialism, and nationalism.",
      "The student demonstrates a thorough understanding of the causes of World War I, including the complex interplay of various factors and their long-term consequences.",
      "The student demonstrates a sophisticated understanding of the causes of World War I, offering nuanced insights and drawing connections to contemporary issues."
    ],
    [
      "The student demonstrates no understanding of the Treaty of Versailles or its effects.",
      "The student can identify one or two effects of the Treaty of Versailles, but the explanation lacks depth.",
      "The student identifies several effects of the Treaty of Versailles, but the connections between them are not clear.",
      "The student accurately identifies and explains the major effects of the Treaty of Versailles, such as the redrawing of national boundaries and the establishment of the League of Nations.",
      "The student demonstrates a thorough understanding of the effects of the Treaty of Versailles, including its impact on different countries and regions and its role in shaping the post-war world.",
      "The student demonstrates a sophisticated understanding of the effects of the Treaty of Versailles, offering nuanced insights and drawing connections to contemporary issues."
    ],
    [
      "The student demonstrates no understanding of the new technologies and warfare tactics used during World War I.",
      "The student can identify one or two new technologies or warfare tactics used during World War I, but the explanation lacks depth.",
      "The student identifies several new technologies or warfare tactics used during World War I, but the impact is not well explained.",
      "The student accurately identifies and explains the impact of new technologies and warfare tactics on the course and outcome of World War I.",
      "The student demonstrates a thorough understanding of the impact of new technologies and warfare tactics on the course and outcome of World War I, including their ethical and social implications.",
      "The student demonstrates a sophisticated understanding of the impact of new technologies and warfare tactics on the course and outcome of World War I, offering nuanced insights and drawing connections to contemporary issues."
    ]
  ]
}