{
  "criteria": [
    "Understanding the Political Influence of the Catholic Church",
    "Knowledge of the Intellectual Role of the Catholic Church",
    "Awareness of the Catholic Church's Aesthetic Influence",
    "Understanding of Monastic and Mendicant Orders"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Catholic Church's political influence in Medieval Europe.",
      "Shows a minimal understanding of the Catholic Church's political role, with limited examples.",
      "Identifies the Catholic Church as a political entity but lacks depth in explaining its influence.",
      "Explains the Catholic Church's political influence with some supporting details (e.g., involvement in feudal politics).",
      "Analyzes the significant political roles of the Catholic Church, including papal power, land ownership, and influence on rulers.",
      "Provides a comprehensive analysis of the Catholic Church's pervasive political influence, including its impact on laws, warfare, and governance."
    ],
    [
      "Displays no awareness of the Catholic Church's intellectual contributions.",
      "Mentions the Catholic Church's involvement in education but provides no specific details.",
      "Identifies the Catholic Church's role in preserving texts or founding universities but lacks elaboration.",
      "Explains how the Catholic Church contributed to intellectual life through the preservation of Latin and religious texts, or the founding of universities.",
      "Analyzes the Catholic Church's intellectual contributions, including the preservation of classical knowledge and the development of scholasticism.",
      "Offers an in-depth analysis of the Catholic Church's intellectual impact, including the synthesis of classical philosophy with Christian theology and the concept of 'natural law'."
    ],
    [
      "Shows no understanding of the Catholic Church's role in the arts.",
      "Acknowledges the Catholic Church's patronage of the arts but provides no specific examples.",
      "Identifies religious art or architecture from the period but does not connect it to the Catholic Church's influence.",
      "Explains the Catholic Church's influence on artistic expression, such as the commissioning of religious art and architecture.",
      "Analyzes the Catholic Church's significant impact on the aesthetic landscape of Medieval Europe, including the development of Gothic architecture and religious iconography.",
      "Provides a comprehensive analysis of the Catholic Church's aesthetic influence, including the symbolic meanings embedded in art and architecture and its role in shaping cultural values."
    ],
    [
      "Demonstrates no understanding of monastic and mendicant orders.",
      "Mentions the existence of religious orders but provides no details about their purpose or activities.",
      "Identifies monastic or mendicant orders but lacks an explanation of their significance.",
      "Describes the basic roles of monastic and mendicant orders, such as providing charity or preserving knowledge.",
      "Analyzes the contributions of monastic and mendicant orders to Medieval society, including their roles in education, healthcare, and spiritual guidance.",
      "Offers an in-depth analysis of the impact of monastic and mendicant orders, including their influence on social reform, intellectual life, and the spread of Christianity."
    ]
  ]
}