{
  "criteria": [
    "Understanding of Roman Geography",
    "Analysis of Roman Political Structures",
    "Examination of Roman Economic Structures",
    "Understanding of Roman Social Structures"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Rome's geographical location or its influence.",
      "Shows a limited understanding of Rome's location but does not connect it to its development.",
      "Identifies Rome's location but struggles to explain its impact on political, economic, or social structures.",
      "Explains Rome's geographical advantages (e.g., access to sea, fertile land) and their basic impact on its development.",
      "Analyzes how Rome's geography influenced its trade, expansion, and military strategies.",
      "Critically evaluates the long-term impact of Rome's geographical location on its political, economic, and social development, including comparisons to other civilizations."
    ],
    [
      "Displays no understanding of Roman political structures.",
      "Identifies basic political figures (e.g., emperor) but cannot explain their roles.",
      "Describes the Roman Republic or Empire but struggles to explain the key differences or stages of development.",
      "Explains the basic structure of Roman government, including key roles and institutions.",
      "Analyzes the evolution of Roman political systems, including the shift from Republic to Empire, and the causes and consequences of key political events.",
      "Critically evaluates the strengths and weaknesses of Roman political systems, comparing them to modern political systems and assessing their long-term impact."
    ],
    [
      "Shows no awareness of Roman economic activities.",
      "Mentions trade or agriculture but cannot explain their significance.",
      "Identifies basic economic activities in Rome but does not connect them to social or political structures.",
      "Explains the role of agriculture, trade, and slavery in the Roman economy.",
      "Analyzes how economic factors (e.g., trade routes, agricultural production, taxation) influenced Roman society and political stability.",
      "Critically evaluates the impact of Roman economic policies on different social classes, and assesses the long-term consequences of economic inequality in Rome."
    ],
    [
      "Shows no understanding of Roman social classes or their roles.",
      "Identifies social classes (e.g., patricians, plebeians) but cannot explain their relationships.",
      "Describes the basic hierarchy of Roman society but struggles to explain the tensions and conflicts within it.",
      "Explains the roles and responsibilities of different social classes in Rome, including the impact of slavery.",
      "Analyzes how social structures influenced political power, economic opportunities, and cultural development in Rome.",
      "Critically evaluates the impact of Roman social structures on the lives of different groups, including women, slaves, and conquered peoples, and assesses the long-term consequences of social inequality."
    ]
  ]
}