{
  "criteria": [
    "Understanding of Communist Ideologies: Assesses the student's comprehension of the core principles and historical context of Communism.",
    "Analysis of Methods of Control: Evaluates the student's ability to identify and analyze the methods used by Communist regimes to maintain power.",
    "Knowledge of Overthrow Movements: Assesses the student's knowledge of the movements to overthrow Communist governments in Czechoslovakia, Hungary, and Poland.",
    "Understanding of Individual Roles: Evaluates the student's comprehension of the roles played by individuals such as Alexander Solzhenitsyn, Pope John Paul II, Lech Walesa, and Vaclav Havel."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Communist ideologies or their historical origins.",
      "Shows minimal understanding of Communist ideologies, with significant inaccuracies or gaps in knowledge.",
      "Displays basic understanding of Communist ideologies, but struggles to articulate key concepts or provide historical context.",
      "Demonstrates satisfactory understanding of Communist ideologies, including key concepts and historical origins.",
      "Exhibits strong understanding of Communist ideologies, articulating key concepts and providing relevant historical context with clarity and accuracy.",
      "Demonstrates comprehensive understanding of Communist ideologies, including nuanced concepts, historical origins, and diverse interpretations."
    ],
    [
      "Unable to identify or describe any methods of control used by Communist regimes.",
      "Identifies one or two methods of control, but lacks understanding of their implementation or impact.",
      "Describes several methods of control used by Communist regimes, but struggles to analyze their effectiveness or historical context.",
      "Analyzes various methods of control used by Communist regimes, explaining their implementation and impact on society.",
      "Provides insightful analysis of the methods of control used by Communist regimes, including their effectiveness, consequences, and historical context.",
      "Demonstrates exceptional ability to analyze the complex methods of control employed by Communist regimes, offering nuanced insights and drawing connections to broader historical trends."
    ],
    [
      "Demonstrates no knowledge of the movements to overthrow Communist governments in Czechoslovakia, Hungary, and Poland.",
      "Shows minimal awareness of the overthrow movements, with significant inaccuracies or omissions.",
      "Identifies the overthrow movements in Czechoslovakia, Hungary, and Poland, but struggles to provide details or historical context.",
      "Describes the key events and figures involved in the overthrow movements in Czechoslovakia, Hungary, and Poland.",
      "Analyzes the causes, events, and consequences of the overthrow movements in Czechoslovakia, Hungary, and Poland, demonstrating strong historical knowledge.",
      "Provides comprehensive analysis of the overthrow movements in Czechoslovakia, Hungary, and Poland, including nuanced perspectives and connections to broader historical trends."
    ],
    [
      "Unable to identify or describe the roles of Alexander Solzhenitsyn, Pope John Paul II, Lech Walesa, or Vaclav Havel.",
      "Identifies one or two individuals, but lacks understanding of their roles in the overthrow movements.",
      "Describes the roles of several individuals, but struggles to explain their significance or impact.",
      "Explains the roles of Alexander Solzhenitsyn, Pope John Paul II, Lech Walesa, and Vaclav Havel in the context of the overthrow movements.",
      "Analyzes the contributions of Alexander Solzhenitsyn, Pope John Paul II, Lech Walesa, and Vaclav Havel, explaining their impact and significance.",
      "Provides insightful analysis of the complex roles played by Alexander Solzhenitsyn, Pope John Paul II, Lech Walesa, and Vaclav Havel, offering nuanced perspectives and drawing connections to broader historical trends."
    ]
  ]
}