{
  "criteria": [
    "Understanding of the Geographic Basis and Economic Factors of Spanish Missions",
    "Explanation of the Mission System's Expansion of Spanish and Catholic Influence",
    "Description of the Mapping of Spanish Missions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the geographic basis or economic factors influencing the placement and function of the Spanish missions.",
      "The student shows a minimal understanding of either the geographic basis or the economic factors, but not both, with significant inaccuracies.",
      "The student demonstrates a partial understanding of the geographic basis and economic factors, but with some inaccuracies or omissions.",
      "The student accurately describes the geographic basis and economic factors in the placement and function of the Spanish missions, with minor omissions.",
      "The student comprehensively describes the geographic basis and economic factors in the placement and function of the Spanish missions, providing clear examples and demonstrating a strong understanding.",
      "The student provides an insightful and nuanced analysis of the geographic basis and economic factors, connecting them to broader historical contexts and demonstrating a sophisticated understanding."
    ],
    [
      "The student demonstrates no understanding of how the mission system expanded the influence of Spain and Catholicism.",
      "The student shows a minimal understanding of the mission system's impact on either Spanish or Catholic influence, but not both, with significant inaccuracies.",
      "The student demonstrates a partial understanding of the mission system's expansion of Spanish and Catholic influence, but with some inaccuracies or omissions.",
      "The student accurately explains how the mission system expanded the influence of Spain and Catholicism throughout New Spain and Latin America, with minor omissions.",
      "The student comprehensively explains the mission system's expansion of Spanish and Catholic influence, providing clear examples and demonstrating a strong understanding.",
      "The student provides an insightful and nuanced analysis of the mission system's role in expanding Spanish and Catholic influence, connecting it to broader geopolitical and cultural contexts and demonstrating a sophisticated understanding."
    ],
    [
      "The student provides no description of the mapping of Spanish Missions",
      "The student provides a vague description of the mapping of Spanish Missions with major inaccuracies",
      "The student provides some description of the mapping of Spanish Missions but misses key components and\/or inaccuracies",
      "The student describes the mapping of Spanish Missions",
      "The student describes the mapping of Spanish Missions in detail",
      "The student describes the mapping of Spanish Missions in detail with insightful observations"
    ]
  ]
}