{
  "criteria": [
    "Identification and Description of Religious Revivals and Leaders",
    "Analysis of the Impact of Religious Revivals",
    "Understanding of Religious Liberty Issues"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify or describe any religious revivals or leaders.",
      "The student identifies or describes at least one religious revival or leader but demonstrates significant inaccuracies or omissions.",
      "The student identifies and describes some religious revivals and leaders, but the descriptions lack depth or contain some inaccuracies.",
      "The student accurately identifies and describes multiple religious revivals and leaders, providing basic details about their roles and significance.",
      "The student thoroughly identifies and describes religious revivals and leaders, providing detailed information about their historical context, key figures, and major impacts.",
      "The student expertly identifies and describes religious revivals and leaders, demonstrating a comprehensive understanding of their nuances, complexities, and lasting legacies with insights."
    ],
    [
      "The student fails to analyze the impact of religious revivals.",
      "The student attempts to analyze the impact of religious revivals but demonstrates limited understanding or provides superficial observations.",
      "The student analyzes some of the impacts of religious revivals, but the analysis lacks depth or coherence.",
      "The student provides a satisfactory analysis of the social, political, or moral impacts of religious revivals, with supporting evidence.",
      "The student offers a well-reasoned analysis of the various impacts of religious revivals, including their social, political, and moral effects, with specific examples.",
      "The student presents a compelling and nuanced analysis of the multifaceted impacts of religious revivals, demonstrating insightful connections between historical events and contemporary issues with original thought."
    ],
    [
      "The student demonstrates no understanding of religious liberty issues.",
      "The student shows a minimal understanding of religious liberty issues with significant misconceptions.",
      "The student demonstrates a basic understanding of religious liberty issues but struggles to relate them to the historical context of the revivals.",
      "The student explains religious liberty issues and relates them to the historical context of the revivals, but the explanation lacks depth.",
      "The student provides a clear and comprehensive explanation of religious liberty issues and effectively relates them to the historical context of the revivals.",
      "The student offers a sophisticated and nuanced analysis of religious liberty issues, demonstrating a deep understanding of their historical and contemporary relevance."
    ]
  ]
}