{
  "criteria": [
    "Understanding of Post-WWII Power Shifts",
    "Analysis of the Yalta Pact and its Impact",
    "Understanding of Nuclear Weapons Development",
    "Explanation of Soviet Control over Eastern Europe",
    "Analysis of Economic Recoveries of Germany and Japan"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the economic and military power shifts after World War II.",
      "Shows a minimal understanding of one or two aspects of the post-WWII power shifts.",
      "Identifies some of the key power shifts (economic or military) but lacks depth in explanation.",
      "Describes the economic and military power shifts, including some factors like the Yalta Pact or Soviet control, but lacks comprehensive connections.",
      "Explains the economic and military power shifts caused by the war, including the Yalta Pact, nuclear weapons, Soviet influence, and the recoveries of Germany and Japan, with good supporting details.",
      "Provides a comprehensive analysis of the economic and military power shifts, including the Yalta Pact, nuclear weapons, Soviet control, and the recoveries of Germany and Japan, demonstrating insightful connections and implications."
    ],
    [
      "Does not mention or understand the Yalta Pact.",
      "Mentions the Yalta Pact but demonstrates no understanding of its significance.",
      "Identifies the Yalta Pact as a post-war agreement but struggles to explain its impact.",
      "Describes the Yalta Pact and its basic agreements, mentioning its role in shaping post-war Europe.",
      "Explains the Yalta Pact's agreements and analyzes its impact on the geopolitical landscape after WWII.",
      "Provides an in-depth analysis of the Yalta Pact, its motivations, consequences, and long-term effects on international relations and the division of Europe."
    ],
    [
      "Shows no awareness of the development of nuclear weapons in the context of post-WWII.",
      "Mentions nuclear weapons but does not connect them to the post-war period.",
      "Recognizes that nuclear weapons were developed, but lacks understanding of their impact.",
      "Describes the development of nuclear weapons and their immediate impact on warfare and global politics.",
      "Analyzes the development of nuclear weapons, including their role in the Cold War and the arms race.",
      "Provides a comprehensive analysis of the development of nuclear weapons, including ethical considerations, proliferation concerns, and their lasting impact on international security."
    ],
    [
      "Shows no understanding of Soviet control over Eastern European nations.",
      "Mentions Soviet control but cannot identify any specific nations or details.",
      "Identifies some Eastern European countries under Soviet influence but lacks explanation.",
      "Describes how the Soviet Union gained control over Eastern European nations and the establishment of satellite states.",
      "Explains the political and economic mechanisms of Soviet control over Eastern Europe, including the Warsaw Pact and COMECON.",
      "Provides an in-depth analysis of Soviet control over Eastern Europe, its impact on the affected nations, and the long-term consequences for the region."
    ],
    [
      "Demonstrates no knowledge of the economic recoveries of Germany and Japan after WWII.",
      "Mentions the economic recoveries of Germany and Japan but provides no details.",
      "Recognizes that Germany and Japan recovered economically but lacks understanding of the factors involved.",
      "Describes the basic elements of the economic recoveries of Germany and Japan, such as the Marshall Plan and economic reforms.",
      "Analyzes the key factors contributing to the economic recoveries of Germany and Japan, including government policies, technological advancements, and foreign aid.",
      "Provides a comprehensive analysis of the economic recoveries of Germany and Japan, comparing their approaches, identifying the unique challenges they faced, and assessing their long-term economic and political impact."
    ]
  ]
}