{
  "criteria": [
    "Understanding of the Causes of the Crusades",
    "Knowledge of the Course of the Crusades",
    "Analysis of the Effects on Christian, Muslim, and Jewish Populations",
    "Understanding of Increasing Contact between Europeans and the Eastern Mediterranean"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes of the Crusades.",
      "Identifies one or two basic causes of the Crusades with limited accuracy.",
      "Describes several causes of the Crusades, but lacks depth and detail.",
      "Explains the primary causes of the Crusades, including religious, political, and economic factors.",
      "Analyzes the complex interplay of religious, political, and economic factors that led to the Crusades.",
      "Provides a nuanced and comprehensive analysis of the causes of the Crusades, including long-term and short-term factors, and connects them effectively."
    ],
    [
      "Shows no knowledge of the events or timeline of the Crusades.",
      "Identifies one or two major events of the Crusades with significant inaccuracies.",
      "Describes some key events of the Crusades, but with gaps in understanding and chronology.",
      "Explains the major events and timeline of the Crusades, including key battles and figures.",
      "Analyzes the strategic and tactical aspects of the Crusades, demonstrating a strong understanding of their course.",
      "Offers a detailed and insightful account of the Crusades, including lesser-known events and their significance, with impeccable chronology."
    ],
    [
      "Demonstrates no awareness of the effects of the Crusades on the populations involved.",
      "Identifies one or two effects on one of the populations with limited accuracy.",
      "Describes some of the effects of the Crusades on the Christian, Muslim, and Jewish populations, but lacks depth and balance.",
      "Explains the key effects of the Crusades on the Christian, Muslim, and Jewish populations in Europe.",
      "Analyzes the complex and multifaceted effects of the Crusades on each population, including religious, social, and economic consequences.",
      "Provides a comprehensive and insightful analysis of the long-term effects of the Crusades on Christian, Muslim, and Jewish populations, considering diverse perspectives and historical contexts."
    ],
    [
      "Shows no understanding of the increased contact between Europeans and the Eastern Mediterranean world during the Crusades.",
      "Identifies that there was increased contact, but cannot explain its nature or significance.",
      "Describes some aspects of the increasing contact, but lacks depth and analysis.",
      "Explains how the Crusades led to increased contact between Europeans and the cultures of the Eastern Mediterranean world.",
      "Analyzes the impact of this increased contact on European culture, trade, and knowledge.",
      "Offers a nuanced and comprehensive analysis of the long-term consequences of increased contact, including the transmission of knowledge, goods, and ideas between Europe and the Eastern Mediterranean."
    ]
  ]
}