{
  "criteria": [
    "Understanding of Classical Revival",
    "Explanation of Humanism",
    "Connection Between Revival and Humanism"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the revival of classical learning and arts.",
      "Student shows minimal awareness of classical learning and arts during the Renaissance.",
      "Student identifies classical elements but struggles to connect them to the Renaissance.",
      "Student describes the revival of classical learning and arts and its influence with some inaccuracies.",
      "Student accurately explains the revival of classical learning and arts and its influence on the Renaissance.",
      "Student comprehensively explains the revival of classical learning and arts, providing specific examples and demonstrating a deep understanding of its impact."
    ],
    [
      "Student is unable to define or explain humanism.",
      "Student provides a vague or inaccurate definition of humanism.",
      "Student provides a basic definition of humanism but struggles to connect it to classical learning or religious faith.",
      "Student explains humanism and its relation to either classical learning or religious faith, but not both.",
      "Student explains humanism as a balance between intellect and religious faith, referencing the classical revival.",
      "Student provides a nuanced explanation of humanism, discussing its origins, core tenets, and its role as a balance between intellect and religious faith during the Renaissance, supported by specific examples."
    ],
    [
      "Student fails to connect the revival of classical learning and arts to the rise of humanism.",
      "Student attempts to connect the revival and humanism, but the connection is unclear or inaccurate.",
      "Student identifies a general relationship between the revival and humanism but lacks specific details.",
      "Student explains how the revival fostered an interest in humanism with some supporting details.",
      "Student clearly explains how the revival of classical learning and arts fostered a new interest in humanism, providing relevant examples.",
      "Student provides a thorough and insightful explanation of how the revival of classical learning and arts directly fostered the development and spread of humanism, including specific examples and analysis of the social and cultural context."
    ]
  ]
}