{
  "criteria": [
    "Knowledge of Key Explorers and Expeditions: Demonstrates understanding of the main figures involved in the exploration of the trans-Mississippi West after the Louisiana Purchase, including Lewis and Clark, Zebulon Pike, and John Fremont.",
    "Understanding of the Context and Motivation: Demonstrates an understanding of the historical context surrounding the explorations, including the Louisiana Purchase and the motivations behind westward expansion.",
    "Awareness of the Impact and Consequences: Demonstrates an understanding of the impact and consequences of these explorations on the environment, Native American populations, and future settlement patterns."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding or recognition of any explorers or expeditions.",
      "Identifies one or two explorers or expeditions with significant inaccuracies.",
      "Identifies at least two explorers or expeditions but provides limited or superficial details about their journeys.",
      "Identifies the main explorers and expeditions and accurately describes the basic purpose and routes of their explorations.",
      "Provides a comprehensive description of the main explorers and expeditions, including details about the purpose, routes, and challenges faced.",
      "Offers an insightful and detailed analysis of the explorers and expeditions, demonstrating a deep understanding of their significance and impact on the region."
    ],
    [
      "Shows no awareness of the Louisiana Purchase or the concept of westward expansion.",
      "Mentions the Louisiana Purchase or westward expansion but demonstrates little understanding of their significance.",
      "Describes the Louisiana Purchase and westward expansion in a basic sense but lacks detail or context.",
      "Explains the Louisiana Purchase and westward expansion, including the basic motivations behind them.",
      "Provides a detailed explanation of the Louisiana Purchase and westward expansion, including the political, economic, and social factors that drove them.",
      "Offers a nuanced and insightful analysis of the Louisiana Purchase and westward expansion, demonstrating a deep understanding of the complex factors that shaped these events."
    ],
    [
      "Shows no awareness of the impact or consequences of the explorations.",
      "Mentions the impact or consequences of the explorations but provides limited or inaccurate information.",
      "Identifies some of the impacts and consequences of the explorations but lacks detail or analysis.",
      "Describes the main impacts and consequences of the explorations on the environment, Native American populations, and future settlement patterns.",
      "Provides a detailed explanation of the impacts and consequences of the explorations, including specific examples and evidence.",
      "Offers an insightful and nuanced analysis of the long-term impacts and consequences of the explorations, demonstrating a deep understanding of their complex and lasting effects."
    ]
  ]
}