{
  "criteria": [
    "Identification of Roles and Sacrifices",
    "Understanding of Unique Contributions",
    "Historical Context and Significance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the roles and sacrifices of individual American soldiers or special fighting forces.",
      "The student can identify one or two roles or sacrifices with limited detail or accuracy.",
      "The student identifies several roles or sacrifices of individual soldiers or special fighting forces, but lacks depth in explanation.",
      "The student accurately identifies multiple roles and sacrifices, providing some context and demonstrating a basic understanding.",
      "The student comprehensively identifies and explains the roles and sacrifices of individual American soldiers and special fighting forces, demonstrating a strong understanding.",
      "The student provides a detailed and nuanced analysis of the roles and sacrifices, including their significance and impact, demonstrating mastery."
    ],
    [
      "The student demonstrates no awareness of the unique contributions of special fighting forces.",
      "The student mentions one special fighting force (e.g., Tuskegee Airmen) but cannot explain their unique contribution.",
      "The student identifies a few special fighting forces and attempts to describe their contributions, but understanding is superficial.",
      "The student accurately describes the unique contributions of multiple special fighting forces, providing relevant details.",
      "The student provides a thorough explanation of the unique contributions of several special fighting forces, demonstrating a deep understanding of their impact.",
      "The student offers an insightful analysis of the historical and social context surrounding the unique contributions, demonstrating mastery of the subject matter."
    ],
    [
      "The student fails to provide any historical context or significance of the roles, sacrifices, and contributions.",
      "The student provides minimal historical context with inaccuracies.",
      "The student includes some historical context, but it is limited and lacks depth.",
      "The student provides relevant historical context that enhances the understanding of the roles, sacrifices, and contributions.",
      "The student effectively integrates historical context to demonstrate the significance of the roles, sacrifices, and unique contributions within the broader scope of World War II.",
      "The student demonstrates mastery by providing a comprehensive analysis of the historical context, highlighting the long-term significance and impact of these contributions."
    ]
  ]
}