{
  "criteria": [
    "Understanding of Poverty's Persistence",
    "Analysis of Different Perspectives",
    "Connection to Social Policies",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of why poverty persists in America.",
      "Identifies poverty as an issue, but offers no explanation for its persistence.",
      "Provides a basic explanation of poverty's persistence, but lacks depth and detail.",
      "Explains several factors contributing to the persistence of poverty with some supporting details.",
      "Thoroughly explains multiple factors, using evidence and examples to demonstrate a strong understanding of why poverty persists.",
      "Offers a nuanced and comprehensive analysis of the multiple, interconnected factors that perpetuate poverty, demonstrating exceptional insight."
    ],
    [
      "Shows no awareness of different viewpoints on the causes of poverty.",
      "Acknowledges that different viewpoints exist but does not describe them.",
      "Briefly describes one or two perspectives on the causes of poverty.",
      "Compares and contrasts different perspectives on the causes of poverty with some detail.",
      "Analyzes multiple perspectives on the causes of poverty, explaining the assumptions and values underlying each.",
      "Critically evaluates competing perspectives on the causes of poverty, demonstrating a sophisticated understanding of their implications."
    ],
    [
      "Fails to connect analyses of poverty to welfare reform, health insurance reform, or other social policies.",
      "Mentions welfare reform or health insurance reform, but does not link them to poverty.",
      "Makes a superficial connection between analyses of poverty and one or two social policies.",
      "Explains how different analyses of poverty influence welfare reform or health insurance reform with some supporting details.",
      "Analyzes how different analyses of poverty shape specific aspects of welfare reform, health insurance reform, and other social policies, providing concrete examples.",
      "Demonstrates a deep and critical understanding of how competing analyses of poverty directly influence the design, implementation, and effectiveness of various social policies."
    ],
    [
      "Presents claims without any supporting evidence or examples.",
      "Provides minimal evidence or examples, which are often irrelevant or inaccurate.",
      "Uses some evidence or examples, but they are not always relevant or fully explained.",
      "Supports claims with relevant evidence and examples, demonstrating a basic understanding of the issue.",
      "Uses a variety of relevant and well-explained evidence and examples to support claims, demonstrating a strong understanding of the issue.",
      "Uses a compelling range of evidence and examples, skillfully integrated to support a sophisticated and insightful analysis."
    ]
  ]
}