{
  "criteria": [
    "Understanding of Alexander the Great's Rise",
    "Knowledge of the Spread of Greek Culture Eastward",
    "Knowledge of the Spread of Greek Culture into Egypt",
    "Analysis of the Impact of Alexander's Conquests"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Alexander the Great's rise to power.",
      "Shows a very limited understanding of Alexander the Great's rise to power, with significant inaccuracies.",
      "Displays a basic understanding of Alexander the Great's rise to power but lacks depth and detail.",
      "Exhibits a satisfactory understanding of Alexander the Great's rise to power, including key events and figures.",
      "Demonstrates a strong understanding of Alexander the Great's rise to power, providing clear explanations and relevant details.",
      "Shows a comprehensive and insightful understanding of Alexander the Great's rise to power, including nuanced perspectives and historical context."
    ],
    [
      "Demonstrates no knowledge of the spread of Greek culture eastward.",
      "Shows minimal awareness of the spread of Greek culture eastward, with significant misconceptions.",
      "Displays a limited understanding of how Greek culture spread eastward, lacking specific examples.",
      "Exhibits a satisfactory understanding of the spread of Greek culture eastward, providing some examples.",
      "Demonstrates a strong understanding of the spread of Greek culture eastward, providing detailed examples and explanations.",
      "Shows a comprehensive and insightful understanding of the spread of Greek culture eastward, including analysis of its impact and influence."
    ],
    [
      "Demonstrates no knowledge of the spread of Greek culture into Egypt.",
      "Shows minimal awareness of the spread of Greek culture into Egypt, with significant misconceptions.",
      "Displays a limited understanding of how Greek culture spread into Egypt, lacking specific examples.",
      "Exhibits a satisfactory understanding of the spread of Greek culture into Egypt, providing some examples.",
      "Demonstrates a strong understanding of the spread of Greek culture into Egypt, providing detailed examples and explanations.",
      "Shows a comprehensive and insightful understanding of the spread of Greek culture into Egypt, including analysis of its impact and influence."
    ],
    [
      "Provides no analysis of the impact of Alexander's conquests.",
      "Offers a superficial analysis of the impact of Alexander's conquests with limited supporting evidence.",
      "Presents a basic analysis of the impact of Alexander's conquests, identifying some key consequences.",
      "Analyzes the impact of Alexander's conquests, discussing both positive and negative consequences.",
      "Provides a thorough analysis of the impact of Alexander's conquests, supporting claims with relevant evidence and examples.",
      "Offers a nuanced and insightful analysis of the long-term impact of Alexander's conquests, considering multiple perspectives and complex factors."
    ]
  ]
}