{
  "criteria": [
    "Understanding of the Han Dynasty's political contributions",
    "Accuracy and Clarity of Information",
    "Use of Supporting Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Han Dynasty's political contributions.",
      "Identifies the Han Dynasty but provides inaccurate or irrelevant information about its political contributions.",
      "Lists one or two political contributions of the Han Dynasty with limited detail.",
      "Describes several political contributions of the Han Dynasty, such as the development of the imperial bureaucratic state and expansion of the empire, with some supporting details.",
      "Explains the political contributions of the Han Dynasty in detail, including the imperial bureaucratic state and expansion of the empire, providing relevant supporting evidence.",
      "Analyzes the lasting impact and significance of the Han Dynasty's political contributions on the development of the Chinese imperial state, providing insightful details and historical context."
    ],
    [
      "Presents information that is largely inaccurate or incomprehensible.",
      "Presents information with several inaccuracies and lacks clarity.",
      "Presents mostly accurate information, but clarity is lacking in some areas.",
      "Presents accurate information with reasonable clarity.",
      "Presents accurate information with clear and concise explanations.",
      "Presents accurate information in a clear, concise, and engaging manner, demonstrating a strong command of the subject matter."
    ],
    [
      "Provides no supporting evidence or examples.",
      "Attempts to provide supporting evidence, but it is irrelevant or inaccurate.",
      "Provides limited supporting evidence that is not well-integrated.",
      "Provides some relevant supporting evidence.",
      "Provides relevant and well-integrated supporting evidence to strengthen explanations.",
      "Provides compelling and well-analyzed supporting evidence, demonstrating a deep understanding of the topic."
    ]
  ]
}