{
  "criteria": [
    "Understanding the historical context and significance of the discoveries.",
    "Ability to trace the influence of the discoveries on various aspects of society (geographic, political, economic, religious, and social structures).",
    "Clarity and organization of presentation."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the discoveries or their historical context.",
      "The student shows minimal awareness of the discoveries but struggles to place them in their historical context.",
      "The student identifies the discoveries but provides a limited explanation of their historical significance.",
      "The student accurately describes the discoveries and explains their general historical significance within the context of medieval China.",
      "The student thoroughly explains the discoveries, their historical significance, and their impact on medieval China with specific examples.",
      "The student provides a comprehensive analysis of the discoveries, their historical significance, their broad impact on medieval China, and connects them to other relevant historical events or developments."
    ],
    [
      "The student fails to identify any influence of the discoveries on society.",
      "The student vaguely mentions the influence of the discoveries but lacks specific details.",
      "The student identifies some areas where the discoveries had an influence but provides superficial explanations.",
      "The student explains how the discoveries influenced multiple aspects of society in medieval China, providing some supporting details.",
      "The student clearly traces the influence of the discoveries on multiple aspects of society, providing specific examples and explanations for each.",
      "The student expertly traces the complex and multifaceted influence of the discoveries on the geographic, political, economic, religious, and social structures of medieval China, providing insightful analysis and well-supported arguments."
    ],
    [
      "The presentation is disorganized and unclear, making it difficult to understand the student's ideas.",
      "The presentation lacks a clear structure, and the student's ideas are presented in a confusing manner.",
      "The presentation has some organization, but the ideas are not always clearly expressed.",
      "The presentation is generally well-organized and the student's ideas are communicated clearly.",
      "The presentation is well-organized, with a clear and logical flow of ideas, making it easy to understand the student's analysis.",
      "The presentation is exceptionally well-organized, engaging, and insightful, demonstrating a mastery of the subject matter and excellent communication skills."
    ]
  ]
}