{
  "criteria": [
    "Identification of Symbols and Icons: Demonstrates the ability to identify key U.S. symbols and icons.",
    "Understanding of Traditions: Demonstrates knowledge of U.S. traditions and their importance.",
    "Continuity and Sense of Community: Explains how symbols, icons, and traditions contribute to continuity and a sense of community."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student cannot identify any U.S. symbols or icons.",
      "Student can identify one or two U.S. symbols or icons with significant prompting.",
      "Student can identify a few common U.S. symbols and icons but struggles with lesser-known ones.",
      "Student can identify most U.S. symbols and icons accurately.",
      "Student can identify and explain the significance of most U.S. symbols and icons with minor details missing.",
      "Student can comprehensively identify and explain the historical and cultural significance of a wide range of U.S. symbols and icons."
    ],
    [
      "Student demonstrates no understanding of U.S. traditions.",
      "Student shows limited awareness of a single U.S. tradition.",
      "Student recognizes a few common U.S. traditions but cannot explain their significance.",
      "Student understands several U.S. traditions and can describe their general importance.",
      "Student can explain the historical and cultural context of various U.S. traditions.",
      "Student demonstrates a deep understanding of U.S. traditions, their evolution, and their impact on American society."
    ],
    [
      "Student does not understand how symbols, icons, and traditions contribute to continuity or community.",
      "Student struggles to connect symbols, icons, or traditions to the concept of continuity or community.",
      "Student identifies a superficial connection between symbols, icons, or traditions and community but lacks depth.",
      "Student explains how some symbols, icons, or traditions foster a sense of community.",
      "Student clearly articulates how symbols, icons, and traditions promote continuity and strengthen community bonds.",
      "Student provides a nuanced explanation of how U.S. symbols, icons, and traditions create a shared national identity and sense of belonging, even in diverse communities."
    ]
  ]
}