{
  "criteria": [
    "Understanding of European Geography",
    "Analysis of the Relationship Between Geography and Ways of Life",
    "Knowledge of the Eurasian Landmass"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of European geography or its key features.",
      "Shows a very limited understanding of European geography, with significant inaccuracies.",
      "Identifies some basic geographical features of Europe but struggles to explain their significance.",
      "Demonstrates a satisfactory understanding of European geography, including major landforms, rivers, and climate zones.",
      "Exhibits a strong understanding of European geography and can explain how these features influenced medieval life.",
      "Displays a comprehensive understanding of European geography and can analyze its profound impact on the political, economic, and social development of Medieval Europe, including detailed knowledge of the Eurasian landmass and its interconnections."
    ],
    [
      "Fails to connect geographical features with the ways of life in Medieval Europe.",
      "Makes superficial connections between geography and life, with limited evidence or reasoning.",
      "Identifies some relationships between geography and ways of life but struggles to explain them in detail.",
      "Explains how geographical features influenced aspects of life in Medieval Europe, such as agriculture, trade, or settlement patterns.",
      "Analyzes the complex relationships between geography and various facets of life in Medieval Europe, providing specific examples and clear explanations.",
      "Synthesizes a sophisticated analysis of the intricate relationships between geography and the political, economic, religious, and social structures of Medieval Europe, demonstrating nuanced insights and comprehensive supporting evidence."
    ],
    [
      "Shows no awareness of the Eurasian landmass or its relevance to European history.",
      "Demonstrates a vague awareness of the Eurasian landmass but cannot explain its importance.",
      "Identifies the Eurasian landmass and its connection to Europe but struggles to provide specific examples.",
      "Describes the Eurasian landmass and its influence on Medieval Europe, including trade routes or cultural exchange.",
      "Analyzes the significant role of the Eurasian landmass in shaping the political, economic, and cultural interactions of Medieval Europe.",
      "Critically evaluates the complex interactions between Europe and the wider Eurasian landmass, offering original insights and demonstrating a mastery of the relevant historical and geographical contexts."
    ]
  ]
}