{
  "criteria": [
    "Understanding of the Causes of Roman Expansion",
    "Understanding of the Effects of Roman Expansion",
    "Understanding of the Causes of the Roman Empire's Disintegration",
    "Understanding of the Effects of the Roman Empire's Disintegration"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes behind the Roman Empire's expansion.",
      "Identifies one or two superficial causes of Roman expansion with limited explanation.",
      "Identifies several causes of Roman expansion but lacks depth in explaining their significance or interrelation.",
      "Explains multiple causes of Roman expansion, demonstrating a solid understanding of their individual significance.",
      "Analyzes the key causes of Roman expansion, explaining their significance and how they interrelate to facilitate expansion.",
      "Provides a comprehensive analysis of the complex web of factors driving Roman expansion, including political, economic, and social elements, with nuanced insights."
    ],
    [
      "Demonstrates no understanding of the effects of the Roman Empire's expansion.",
      "Identifies one or two superficial effects of Roman expansion with limited explanation.",
      "Identifies several effects of Roman expansion but lacks depth in explaining their significance.",
      "Explains multiple effects of Roman expansion, demonstrating a solid understanding of their individual significance.",
      "Analyzes the key effects of Roman expansion, explaining their significance and how they impacted Roman society.",
      "Provides a comprehensive analysis of the diverse and far-reaching effects of Roman expansion, including its impact on law, culture, infrastructure, and politics."
    ],
    [
      "Demonstrates no understanding of the causes behind the Roman Empire's disintegration.",
      "Identifies one or two superficial causes of the Roman Empire's disintegration with limited explanation.",
      "Identifies several causes of Roman disintegration but lacks depth in explaining their significance or interrelation.",
      "Explains multiple causes of Roman disintegration, demonstrating a solid understanding of their individual significance.",
      "Analyzes the key causes of Roman disintegration, explaining their significance and how they interrelate to lead to collapse.",
      "Provides a comprehensive analysis of the complex web of factors driving Roman disintegration, including political instability, economic decline, social unrest, and external pressures, with nuanced insights."
    ],
    [
      "Demonstrates no understanding of the effects of the Roman Empire's disintegration.",
      "Identifies one or two superficial effects of Roman Empire's disintegration with limited explanation.",
      "Identifies several effects of Roman disintegration but lacks depth in explaining their significance.",
      "Explains multiple effects of Roman disintegration, demonstrating a solid understanding of their individual significance.",
      "Analyzes the key effects of Roman disintegration, explaining their significance and how they impacted the subsequent historical periods.",
      "Provides a comprehensive analysis of the diverse and far-reaching effects of Roman disintegration, including its impact on the development of new political entities, cultural shifts, and the preservation of Roman legacies."
    ]
  ]
}