{
  "criteria": [
    "Understanding the Origins and Diffusion of the Civil Rights Movement",
    "Knowledge of Resistance to Desegregation",
    "Understanding the Influence on Other Civil Rights Movements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of the origins or diffusion of the Civil Rights Movement.",
      "The student shows minimal understanding of the Civil Rights Movement's origins in Southern churches or its spread.",
      "The student identifies the role of Southern churches in the Civil Rights Movement and mentions its spread but lacks detail.",
      "The student explains the role of churches in the South and North in initiating the Civil Rights Movement and describes its diffusion, including key locations.",
      "The student thoroughly explains the origins and diffusion of the Civil Rights Movement, including the roles of churches in the South and North, and provides specific examples of its spread and influence.",
      "The student offers a comprehensive analysis of the Civil Rights Movement’s origins and diffusion, connecting it to the broader social and political context with nuanced understanding and specific examples."
    ],
    [
      "The student is unable to identify any instances of resistance to racial desegregation.",
      "The student vaguely mentions resistance to desegregation but does not provide specific examples.",
      "The student identifies either Little Rock or Birmingham as sites of resistance but lacks detail.",
      "The student describes the resistance to racial desegregation in both Little Rock and Birmingham, mentioning key events.",
      "The student provides a detailed account of the resistance to racial desegregation in Little Rock and Birmingham, including the motivations and actions of those involved.",
      "The student analyzes the resistance to racial desegregation in Little Rock and Birmingham, explaining the broader implications and impact on the Civil Rights Movement with insightful details."
    ],
    [
      "The student does not recognize any influence of the African American Civil Rights Movement on other groups.",
      "The student vaguely suggests that the African American Civil Rights Movement might have influenced other groups but provides no specifics.",
      "The student identifies one other group (American Indians, Asian Americans, or Hispanic Americans) as being influenced by the African American Civil Rights Movement.",
      "The student identifies multiple groups influenced by the African American Civil Rights Movement and briefly describes the influence.",
      "The student explains how the African American Civil Rights Movement influenced the agendas, strategies, and effectiveness of American Indians, Asian Americans, and Hispanic Americans.",
      "The student provides a comprehensive analysis of how the African American Civil Rights Movement shaped the quests of American Indians, Asian Americans, and Hispanic Americans, providing specific examples and insightful connections."
    ]
  ]
}