{
  "criteria": [
    "Understanding of Pre-Colonial Economies",
    "Knowledge of Pre-Colonial Systems of Government",
    "Understanding of Contemporary Tribal Governance",
    "Analysis of Relationships with Federal and State Governments"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of pre-colonial American Indian economies.",
      "Demonstrates a minimal understanding of pre-colonial American Indian economies; information is vague or inaccurate.",
      "Demonstrates a basic understanding of pre-colonial American Indian economies, but lacks detail.",
      "Demonstrates a satisfactory understanding of pre-colonial American Indian economies, including specific examples of trade, resource management, or specialization.",
      "Demonstrates a strong understanding of pre-colonial American Indian economies, providing detailed examples and explaining regional variations.",
      "Demonstrates a comprehensive understanding of pre-colonial American Indian economies, analyzing the sophistication and sustainability of these systems."
    ],
    [
      "Demonstrates no knowledge of pre-colonial American Indian systems of government.",
      "Demonstrates minimal knowledge of pre-colonial American Indian systems of government; information is vague or inaccurate.",
      "Demonstrates a basic understanding of pre-colonial American Indian governance structures, but lacks depth.",
      "Demonstrates a satisfactory understanding of pre-colonial American Indian systems of government, including forms of leadership, decision-making processes, and social organization.",
      "Demonstrates a strong understanding of pre-colonial American Indian systems of government, providing specific examples and explaining the principles behind them.",
      "Demonstrates a comprehensive understanding of pre-colonial American Indian systems of government, analyzing their effectiveness and adaptability in different contexts."
    ],
    [
      "Demonstrates no understanding of contemporary American Indian tribal governance.",
      "Demonstrates a minimal understanding of contemporary American Indian tribal governance; information is vague or inaccurate.",
      "Demonstrates a basic understanding of modern tribal governance, but lacks specific details about constitutions or relationships with other governments.",
      "Demonstrates a satisfactory understanding of contemporary tribal governance, including tribal constitutions and their role in self-governance.",
      "Demonstrates a strong understanding of contemporary tribal governance, explaining the complexities of tribal sovereignty and jurisdiction.",
      "Demonstrates a comprehensive understanding of contemporary tribal governance, analyzing the challenges and opportunities facing tribal governments in the 21st century."
    ],
    [
      "Demonstrates no understanding of the relationship between American Indian nations and federal\/state governments.",
      "Demonstrates a minimal understanding of the relationship between American Indian nations and federal\/state governments; information is vague or inaccurate.",
      "Demonstrates a basic understanding of the interactions between tribal governments and the United States or state governments, but lacks depth.",
      "Demonstrates a satisfactory understanding of the relationship between American Indian nations and federal\/state governments, including treaty rights, legal jurisdiction, and intergovernmental agreements.",
      "Demonstrates a strong understanding of the relationship between American Indian nations and federal\/state governments, explaining the historical and legal context of these interactions.",
      "Demonstrates a comprehensive understanding of the relationship between American Indian nations and federal\/state governments, analyzing the impact of federal policies on tribal sovereignty and self-determination."
    ]
  ]
}