{
  "criteria": [
    "Identification of Key Principles",
    "Analysis of Concepts Codified in State Constitutions",
    "Understanding of the Contextual Relevance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any principles or concepts from the state constitutions of 1777-1781.",
      "The student identifies only one principle or concept, but the explanation is vague or inaccurate.",
      "The student identifies two principles or concepts, but the explanation lacks depth or connection to the historical context.",
      "The student identifies three principles or concepts with some accuracy and provides a basic explanation of their relevance.",
      "The student identifies at least four principles or concepts accurately and explains their relevance to the development of American political institutions and ideas.",
      "The student comprehensively identifies and accurately explains multiple key principles and concepts from state constitutions of 1777-1781, demonstrating a deep understanding of their impact on American political development."
    ],
    [
      "The student provides no analysis of the concepts codified in state constitutions.",
      "The student attempts to analyze one concept, but the analysis is superficial and lacks supporting evidence.",
      "The student analyzes two concepts with limited depth, failing to connect them to broader historical trends.",
      "The student analyzes three concepts with reasonable depth, providing some context regarding their influence.",
      "The student offers a well-supported analysis of at least four concepts, clearly articulating their historical significance.",
      "The student provides a sophisticated, insightful analysis of the concepts codified in state constitutions, effectively connecting them to the evolution of American political thought and institutions."
    ],
    [
      "The student shows no understanding of the historical context surrounding the creation of state constitutions.",
      "The student demonstrates a minimal understanding of the historical context, with significant inaccuracies or omissions.",
      "The student demonstrates a limited understanding of the historical context, providing only a superficial overview.",
      "The student demonstrates a satisfactory understanding of the historical context, connecting it to the development of state constitutions.",
      "The student effectively integrates the historical context into their analysis, explaining how it influenced the principles and concepts in the constitutions.",
      "The student deeply integrates the historical context into their analysis, providing nuanced insights into how it shaped the development of American political institutions and ideas."
    ]
  ]
}