{
  "criteria": [
    "Understanding of Causes and Context: Demonstrates comprehension of the political, social, and economic factors leading to each revolution.",
    "Comparison of Revolutionary Ideals: Compares and contrasts the core ideals and goals of each revolution, such as self-government and individual liberty.",
    "Analysis of Enduring Effects: Evaluates the long-term effects of the revolutions on political expectations for self-government and individual liberty worldwide."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Lacks understanding of the causes and context of the revolutions.",
      "Demonstrates a limited understanding of the causes and context of at least one revolution.",
      "Identifies basic causes and context for two of the revolutions, but with some inaccuracies or omissions.",
      "Explains the main causes and context for all three revolutions, showing a general understanding of the key factors.",
      "Analyzes the complex causes and context of all three revolutions, demonstrating a strong understanding of the interconnected political, social, and economic factors.",
      "Provides a nuanced and insightful analysis of the causes and context, drawing connections between the revolutions and demonstrating a comprehensive understanding of their historical origins."
    ],
    [
      "Unable to identify or compare the revolutionary ideals.",
      "Identifies at least one ideal for one revolution, but struggles to compare across revolutions.",
      "States basic ideals for two of the revolutions and attempts a superficial comparison.",
      "Compares and contrasts the main ideals of all three revolutions, explaining similarities and differences in their goals.",
      "Analyzes the nuances in the revolutionary ideals, demonstrating a strong understanding of how concepts like self-government and individual liberty were interpreted differently in each context.",
      "Offers a sophisticated analysis of the revolutionary ideals, exploring the philosophical underpinnings and demonstrating a comprehensive understanding of their impact on political thought."
    ],
    [
      "Unable to identify any enduring effects of the revolutions.",
      "Identifies at least one enduring effect for one revolution.",
      "Lists some enduring effects for two of the revolutions but lacks analysis of their global impact.",
      "Explains the main enduring effects of all three revolutions, connecting them to the development of self-government and individual liberty in different parts of the world.",
      "Analyzes the complex and multifaceted enduring effects, demonstrating a strong understanding of how the revolutions shaped political expectations and influenced subsequent movements for self-determination.",
      "Provides a comprehensive and insightful analysis of the long-term effects, drawing connections between the revolutions and contemporary political developments and offering a nuanced perspective on their legacy."
    ]
  ]
}