{
  "criteria": [
    "Understanding of Economic Divergence: Assesses the student's comprehension of how economic systems and activities differed in the South compared to other regions.",
    "Analysis of Social Structures: Examines the student's ability to analyze the social hierarchy and class distinctions in the South, including the roles of different groups (planters, enslaved people, poor whites).",
    "Examination of Political Developments: Assesses the student's knowledge of political events and issues in the South, such as states' rights, nullification, and the growing sectionalism.",
    "Understanding of Challenges: Evaluates the student's comprehension of the challenges faced by people in the South, including economic hardships, social inequalities, and political tensions."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the economic differences in the South during this period.",
      "Shows minimal understanding of economic divergence, with significant inaccuracies.",
      "Identifies basic economic differences but lacks depth in explanation or provides limited examples.",
      "Explains some economic differences, such as reliance on agriculture, but may not fully articulate the reasons or broader implications.",
      "Clearly explains the key economic differences in the South, providing relevant examples and discussing the implications of these differences.",
      "Provides a comprehensive explanation of the economic divergence in the South, including detailed examples, analysis of causes and effects, and comparison with other regions."
    ],
    [
      "Demonstrates no understanding of the social structures in the South.",
      "Shows minimal understanding of social structures, with significant inaccuracies.",
      "Identifies basic social groups but lacks depth in explaining their roles or relationships.",
      "Describes some social groups and their roles, but may not fully analyze the complexities of the social hierarchy.",
      "Clearly explains the social hierarchy in the South, including the roles and relationships of different social groups.",
      "Provides a comprehensive analysis of the social structures in the South, including detailed descriptions of social groups, power dynamics, and the impact of these structures on individuals and society."
    ],
    [
      "Demonstrates no understanding of the political developments in the South.",
      "Shows minimal understanding of political developments, with significant inaccuracies.",
      "Identifies basic political issues but lacks depth in explaining their causes or implications.",
      "Describes some political issues, such as states' rights, but may not fully analyze the growing sectionalism.",
      "Clearly explains the key political developments in the South, including their causes and consequences.",
      "Provides a comprehensive analysis of the political developments in the South, including detailed explanations of key issues, the role of political leaders, and the impact of these developments on the nation."
    ],
    [
      "Demonstrates no understanding of the challenges faced by people in the South.",
      "Shows minimal understanding of challenges, with significant inaccuracies.",
      "Identifies basic challenges but lacks depth in explaining their impact.",
      "Describes some challenges faced by people in the South, but may not fully analyze their significance.",
      "Clearly explains the key challenges faced by people in the South, including their economic, social, and political dimensions.",
      "Provides a comprehensive analysis of the challenges faced by people in the South, including detailed explanations of their causes, consequences, and the experiences of different groups."
    ]
  ]
}