{
  "criteria": [
    "Understanding Causes and Motivations for US Entry",
    "Analyzing Strategic and Military Aspects of the War",
    "Understanding the War's Impact on the Homefront"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the events and factors leading to US involvement in World War II.",
      "Demonstrates a limited understanding of the key events that led to US involvement in WWII, with some inaccuracies.",
      "Identifies some of the major events and factors that led to US involvement in WWII, but lacks depth and misses some crucial elements.",
      "Explains the major events and factors that led to US involvement in World War II, including Pearl Harbor, economic interests, and the threat of fascism.",
      "Analyzes the complex causes and motivations for US entry into WWII, including political, economic, and social factors, showing a nuanced understanding.",
      "Critically evaluates the multifaceted causes of US entry into WWII, comparing and contrasting different interpretations and assessing the long-term implications."
    ],
    [
      "Shows no understanding of the military strategies and key battles involving the US during WWII.",
      "Demonstrates limited knowledge of one or two major battles or strategies, with significant gaps in understanding.",
      "Identifies several major battles and strategies involving the US, but lacks detailed explanations or analysis.",
      "Describes key military strategies, major battles (e.g., D-Day, Battle of Midway), and their significance in the context of the war.",
      "Analyzes the effectiveness of different US military strategies and tactics, assessing their impact on the overall course of the war.",
      "Evaluates the strategic and military decisions made by US leaders during WWII, considering their ethical implications and long-term consequences."
    ],
    [
      "Shows no awareness of how WWII affected American society and the economy.",
      "Demonstrates a superficial understanding of the war's effects, with little or no specific examples.",
      "Identifies some ways in which WWII impacted the American homefront, such as rationing or women in the workforce, but lacks depth.",
      "Explains the significant social and economic changes that occurred on the American homefront during WWII, including industrial mobilization, rationing, and the changing role of women and minorities.",
      "Analyzes the social and economic transformations on the homefront, examining both the positive and negative effects of the war, and its influence on civil rights movements.",
      "Critically evaluates the lasting impact of WWII on American society, culture, and identity, including its effects on race relations, gender roles, and political ideologies."
    ]
  ]
}