{
  "criteria": [
    "Understanding of Constitutional Issues and Impact of Events on the U.S. Home Front",
    "Analysis of the Internment of Japanese Americans",
    "Understanding of Restrictions on German and Italian Resident Aliens",
    "Knowledge of the Administration's Response to Hitler's Atrocities Against Jews and Other Groups",
    "Understanding of the Roles of Women in Military Production",
    "Awareness of the Roles and Growing Political Demands of African Americans"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the constitutional issues or the impact of events on the U.S. home front during World War II.",
      "Shows a limited understanding of one or two constitutional issues or impacts on the home front.",
      "Identifies some constitutional issues and impacts on the home front but lacks depth and detail.",
      "Explains several constitutional issues and impacts on the home front with reasonable detail and accuracy.",
      "Thoroughly explains multiple constitutional issues and impacts on the home front with strong supporting details and accuracy.",
      "Provides a comprehensive and insightful analysis of the constitutional issues and impacts on the home front, demonstrating a nuanced understanding and incorporating relevant historical context."
    ],
    [
      "Demonstrates no understanding of the internment of Japanese Americans.",
      "Shows a limited awareness of the internment but lacks any analysis of its causes or consequences.",
      "Identifies the internment of Japanese Americans but provides a superficial explanation.",
      "Explains the internment of Japanese Americans, including some causes and consequences, and mentions Fred Korematsu v. United States.",
      "Analyzes the internment of Japanese Americans in detail, including its constitutional implications and the significance of Fred Korematsu v. United States.",
      "Offers a sophisticated and nuanced analysis of the internment, connecting it to broader themes of civil liberties, wartime hysteria, and racial prejudice, and thoroughly examines the legal and social ramifications of Fred Korematsu v. United States."
    ],
    [
      "Demonstrates no understanding of the restrictions placed on German and Italian resident aliens.",
      "Shows a limited awareness of the restrictions but lacks specifics.",
      "Identifies that restrictions were placed on German and Italian resident aliens but offers limited details.",
      "Explains the types of restrictions placed on German and Italian resident aliens during World War II.",
      "Analyzes the reasons for and impact of the restrictions on German and Italian resident aliens, providing specific examples.",
      "Provides a comprehensive analysis of the motivations behind and consequences of the restrictions, comparing and contrasting the experiences of German and Italian resident aliens and connecting it to broader themes of immigration and national security."
    ],
    [
      "Demonstrates no knowledge of the administration's response to Hitler's atrocities.",
      "Shows a limited awareness of Hitler's atrocities but no understanding of the U.S. response.",
      "Identifies that the U.S. government responded to Hitler's atrocities but lacks specifics.",
      "Describes the U.S. administration's response to Hitler's atrocities, including specific actions or policies.",
      "Analyzes the effectiveness and limitations of the U.S. administration's response, considering different perspectives and motivations.",
      "Offers a sophisticated and critical analysis of the U.S. response, evaluating its moral and strategic implications and connecting it to broader themes of humanitarianism and international relations."
    ],
    [
      "Demonstrates no understanding of the roles of women in military production.",
      "Shows a limited awareness of women's involvement in military production.",
      "Identifies that women played a role in military production but lacks specifics.",
      "Explains the significant roles women played in military production during World War II.",
      "Analyzes the impact of women's roles in military production on both the war effort and women's social and economic status.",
      "Provides a comprehensive analysis of the transformative impact of women's roles, connecting it to long-term changes in gender roles and the labor force and providing specific examples and statistical data."
    ],
    [
      "Demonstrates no awareness of the roles or growing political demands of African Americans.",
      "Shows a limited awareness of African Americans' involvement during World War II.",
      "Identifies that African Americans played a role and had growing political demands but lacks specifics.",
      "Explains the roles African Americans played during World War II and their growing political demands.",
      "Analyzes the challenges faced by African Americans during the war and the significance of their growing political demands in the context of the Civil Rights Movement.",
      "Offers a sophisticated analysis of the complex relationship between World War II, African American activism, and the burgeoning Civil Rights Movement, connecting it to broader themes of racial equality and social justice."
    ]
  ]
}