{
  "criteria": [
    "Understanding Stalin's Rise to Power",
    "Connection between Economic and Political Policies",
    "Understanding of Suppression and Human Rights Violations",
    "Analysis of the Terror Famine in Ukraine"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Stalin's rise to power or the historical context.",
      "Shows a limited understanding of Stalin's rise to power with significant inaccuracies.",
      "Identifies Stalin as a leader but struggles to explain the process of his ascent to power.",
      "Explains Stalin's rise to power with some accuracy, mentioning key factors but lacking depth.",
      "Accurately explains Stalin's rise to power, including political maneuvering and elimination of rivals.",
      "Provides a comprehensive and nuanced explanation of Stalin's rise to power, including long-term and short-term causes, key individuals, and political strategies."
    ],
    [
      "Shows no awareness of any connection between economic and political policies under Stalin.",
      "Suggests a vague connection between economic and political policies, but details are missing or inaccurate.",
      "Identifies one or two economic policies (e.g., collectivization) and one or two political policies but doesn't clearly link them.",
      "Explains how collectivization and the Five-Year Plans were connected to Stalin's political control but misses key details.",
      "Clearly explains the connection between economic policies (collectivization, Five-Year Plans) and Stalin's political policies, including increased state control.",
      "Demonstrates a sophisticated understanding of the interconnectedness of Stalin's economic and political policies, analyzing how they reinforced each other to consolidate his power."
    ],
    [
      "Demonstrates no understanding of human rights violations or the absence of a free press under Stalin.",
      "Shows a minimal awareness of suppression and human rights violations.",
      "Mentions the lack of a free press and some human rights violations (e.g., purges) but provides no details.",
      "Describes the absence of a free press and some human rights violations, providing basic details (e.g., the Great Purge).",
      "Explains how the absence of a free press and systematic human rights violations (e.g., purges, forced labor) were used to maintain Stalin's power.",
      "Analyzes the systematic nature of human rights violations under Stalin, including the role of propaganda, censorship, and state-sponsored terror in maintaining control. Includes a thorough explanation of the Terror Famine in Ukraine."
    ],
    [
      "Displays no knowledge of the Terror Famine in Ukraine.",
      "Mentions the Terror Famine but demonstrates little understanding of its causes or consequences.",
      "Identifies the Terror Famine as a tragic event in Ukraine but struggles to explain its connection to Stalin's policies.",
      "Explains the Terror Famine as a result of collectivization policies, but lacks a deeper understanding of the political motivations.",
      "Analyzes the Terror Famine as a deliberate act of political repression by Stalin's regime, linking it to the suppression of Ukrainian nationalism.",
      "Provides a comprehensive analysis of the Terror Famine, including its causes, consequences, and the debate over its intentionality as a form of genocide. Connects the event to broader patterns of human rights violations under Stalin."
    ]
  ]
}