{
  "criteria": [
    "Understanding the historical context of Islam's origins, including pre-Islamic Arabia and the socio-political conditions that influenced Muhammad.",
    "Knowledge of the key events in the life of Muhammad, from his birth and early life in Mecca to his migration to Medina (Hijra) and his eventual return to Mecca.",
    "Comprehension of the core teachings of Muhammad and the central tenets of Islam, including the concept of Tawhid (Oneness of God), the role of prophets, and the importance of the Quran.",
    "Understanding of the relationship between Islam, Judaism, and Christianity, including shared prophets, religious concepts, and historical interactions."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context of Islam's origins.",
      "Shows a very limited understanding of the historical context, with significant inaccuracies or omissions.",
      "Displays a basic understanding of the historical context but lacks depth and detail.",
      "Exhibits a satisfactory understanding of the historical context, identifying key factors and influences.",
      "Demonstrates a strong understanding of the historical context, explaining complex interactions and influences.",
      "Shows a comprehensive and nuanced understanding of the historical context, including lesser-known factors and scholarly debates."
    ],
    [
      "Demonstrates no knowledge of the key events in the life of Muhammad.",
      "Shows a very limited knowledge of Muhammad's life, with significant inaccuracies or omissions.",
      "Displays a basic knowledge of Muhammad's life but lacks chronological accuracy and detail.",
      "Exhibits a satisfactory knowledge of Muhammad's life, identifying major events and their significance.",
      "Demonstrates a strong knowledge of Muhammad's life, explaining the context and consequences of key events.",
      "Shows a comprehensive and nuanced understanding of Muhammad's life, including scholarly debates and differing interpretations of events."
    ],
    [
      "Demonstrates no comprehension of the core teachings of Muhammad or the central tenets of Islam.",
      "Shows a very limited comprehension of Islamic teachings, with significant inaccuracies or misunderstandings.",
      "Displays a basic comprehension of Islamic teachings but lacks depth and accuracy.",
      "Exhibits a satisfactory comprehension of Islamic teachings, identifying key concepts and principles.",
      "Demonstrates a strong comprehension of Islamic teachings, explaining complex theological concepts and their implications.",
      "Shows a comprehensive and nuanced understanding of Islamic teachings, including scholarly debates and differing interpretations of religious texts."
    ],
    [
      "Demonstrates no understanding of the relationship between Islam, Judaism, and Christianity.",
      "Shows a very limited understanding of the relationship, with significant inaccuracies or omissions.",
      "Displays a basic understanding of the relationship but lacks depth and nuance.",
      "Exhibits a satisfactory understanding of the relationship, identifying shared figures and concepts.",
      "Demonstrates a strong understanding of the relationship, explaining complex theological and historical connections.",
      "Shows a comprehensive and nuanced understanding of the relationship, including scholarly debates and differing perspectives on interfaith dialogue."
    ]
  ]
}