{
  "criteria": [
    "Understanding of Key Features",
    "Historical and Cultural Context",
    "Examples and Analysis"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Egyptian art and architecture.",
      "Identifies only one or two features of Egyptian art and architecture, lacking detail or accuracy.",
      "Identifies several features of Egyptian art and architecture but provides superficial explanations.",
      "Describes key features of Egyptian art (e.g., hieroglyphics, sculpture) and architecture (e.g., pyramids, temples) with reasonable accuracy.",
      "Explains the key features of Egyptian art and architecture, providing specific examples and demonstrating good understanding.",
      "Provides a comprehensive and insightful explanation of the key features of Egyptian art and architecture, including symbolism, materials, and construction techniques."
    ],
    [
      "Shows no awareness of the historical or cultural context of Egyptian art and architecture.",
      "Makes vague or inaccurate references to the historical or cultural context.",
      "Briefly mentions the historical or cultural context of Egyptian art and architecture but lacks depth.",
      "Connects Egyptian art and architecture to its historical and cultural context, explaining the purpose and significance of various features.",
      "Explains how the historical and cultural context influenced Egyptian art and architecture, providing relevant examples and details.",
      "Analyzes the complex relationship between Egyptian art, architecture, and its historical and cultural context, demonstrating a nuanced understanding of the civilization's values and beliefs."
    ],
    [
      "Does not provide any examples of Egyptian art or architecture.",
      "Provides one or two examples without analysis or explanation.",
      "Provides a few examples of Egyptian art and architecture with limited analysis.",
      "Offers several relevant examples of Egyptian art and architecture and provides basic analysis of their features and significance.",
      "Presents a range of compelling examples of Egyptian art and architecture, analyzing their key features and historical significance in detail.",
      "Presents a diverse range of examples, providing insightful and original analysis of their artistic, architectural, and historical importance. Demonstrates independent thought and critical evaluation."
    ]
  ]
}