{
  "criteria": [
    "Understanding of Truman's Labor Policy",
    "Analysis of Congressional Reaction",
    "Contextualization within Post-WWII America"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Truman's labor policy.",
      "Shows a limited or inaccurate understanding of Truman's labor policy.",
      "Displays a basic understanding of Truman's labor policy, but lacks depth.",
      "Exhibits a satisfactory understanding of Truman's labor policy, including its main components.",
      "Demonstrates a strong understanding of Truman's labor policy, including specific details and nuances.",
      "Shows a comprehensive and insightful understanding of Truman's labor policy, including its historical context and significance."
    ],
    [
      "Provides no information or demonstrates no understanding of the congressional reaction to Truman's labor policy.",
      "Offers a vague or inaccurate description of the congressional reaction.",
      "Identifies some elements of the congressional reaction, but lacks analysis.",
      "Describes the main aspects of the congressional reaction to Truman's labor policy.",
      "Analyzes the congressional reaction, including the motivations and divisions among members of Congress.",
      "Provides a sophisticated analysis of the congressional reaction, including its long-term consequences and impact on labor relations."
    ],
    [
      "Fails to connect Truman's labor policy and congressional reaction to the broader context of post-World War II America.",
      "Makes a weak or superficial connection to the post-WWII context.",
      "Identifies some relevant aspects of the post-WWII context, but does not fully integrate them into the analysis.",
      "Relates Truman's labor policy and congressional reaction to key developments and trends in post-WWII America.",
      "Explains how Truman's labor policy and congressional reaction reflected and shaped the economic boom and social transformation of post-WWII America.",
      "Offers a nuanced and insightful interpretation of the relationship between Truman's labor policy, congressional reaction, and the broader context of post-WWII America."
    ]
  ]
}