{
  "criteria": [
    "Understanding of the Rise of Totalitarian Regimes",
    "Analysis of Aggression and Expansion",
    "Understanding of Human Costs",
    "Comparison of Common and Dissimilar Traits"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the factors contributing to the rise of totalitarian regimes in Germany, Italy, and the Soviet Union.",
      "Shows a limited understanding of one or two factors contributing to the rise of totalitarian regimes.",
      "Identifies some factors contributing to the rise of totalitarian regimes but lacks depth in explanation.",
      "Explains several factors contributing to the rise of totalitarian regimes with reasonable depth and accuracy.",
      "Analyzes the key factors contributing to the rise of totalitarian regimes in detail, demonstrating strong understanding.",
      "Provides a comprehensive and nuanced analysis of the various factors that led to the rise of totalitarian regimes, demonstrating exceptional insight."
    ],
    [
      "Shows no understanding of the aggressive actions and expansionist policies of totalitarian regimes.",
      "Identifies one or two aggressive actions or expansionist policies with limited detail.",
      "Describes some aggressive actions and expansionist policies but lacks a broader understanding of their significance.",
      "Explains several aggressive actions and expansionist policies and their impact on international relations.",
      "Analyzes the patterns and consequences of aggression and expansion by totalitarian regimes with detailed examples.",
      "Offers a sophisticated analysis of the motivations behind and the long-term consequences of the aggression and expansionist policies of totalitarian regimes."
    ],
    [
      "Demonstrates no awareness of the human costs associated with totalitarian regimes.",
      "Acknowledges that there were human costs but provides no specific details.",
      "Identifies some of the human costs (e.g., loss of life, persecution) but lacks depth in explanation.",
      "Describes several human costs, including examples of persecution, repression, and loss of freedom.",
      "Analyzes the various forms of human suffering caused by totalitarian regimes, including specific examples and statistics.",
      "Provides a comprehensive and empathetic analysis of the wide-ranging human costs of totalitarianism, demonstrating a deep understanding of its impact on individuals and societies."
    ],
    [
      "Unable to identify any common or dissimilar traits between Fascist and Communist regimes.",
      "Identifies one or two common or dissimilar traits superficially.",
      "Lists several common or dissimilar traits but does not explain their significance.",
      "Explains several common and dissimilar traits with some historical context and supporting details.",
      "Analyzes the common and dissimilar traits of Fascist and Communist regimes, providing detailed explanations and historical examples.",
      "Offers a nuanced and insightful comparison of the common and dissimilar traits, demonstrating a sophisticated understanding of the ideologies and practices of Fascist and Communist regimes."
    ]
  ]
}