{
  "criteria": [
    "Understanding of Causes and Effects of the Reformation",
    "Knowledge of Key Figures and Events",
    "Analysis of the Reformation's Impact"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the causes or effects of the Reformation.",
      "Student shows minimal understanding of the causes or effects of the Reformation, with significant inaccuracies.",
      "Student identifies some causes and effects of the Reformation but lacks depth and detail.",
      "Student accurately describes several causes and effects of the Reformation, demonstrating a basic understanding.",
      "Student provides a comprehensive explanation of the major causes and effects of the Reformation, showing clear understanding.",
      "Student demonstrates an in-depth understanding of the complex causes and far-reaching effects of the Reformation, including nuanced interpretations."
    ],
    [
      "Student is unable to identify any key figures or events of the Reformation.",
      "Student identifies one or two key figures or events with limited accuracy.",
      "Student identifies several key figures and events but struggles with providing context or significance.",
      "Student accurately names and describes the roles of key figures and outlines major events of the Reformation.",
      "Student demonstrates a strong understanding of key figures and events, explaining their importance in shaping the Reformation.",
      "Student exhibits extensive knowledge of key figures and events, connecting them to broader historical trends and offering insightful analysis."
    ],
    [
      "Student demonstrates no ability to analyze the impact of the Reformation on society, politics, or religion.",
      "Student attempts to describe the Reformation's impact but offers superficial observations.",
      "Student identifies some impacts of the Reformation but lacks a clear connection to historical context.",
      "Student explains several ways the Reformation impacted society, politics, and religion, with supporting details.",
      "Student analyzes the significant impacts of the Reformation, providing insightful connections to subsequent historical developments.",
      "Student offers a sophisticated analysis of the long-term and multifaceted impacts of the Reformation, demonstrating critical thinking and historical perspective."
    ]
  ]
}