{
  "criteria": [
    "Understanding the Role of Pioneer Women",
    "Knowledge of Key Figures",
    "Understanding the New Status of Western Women",
    "Addressing Slave Women Gaining Freedom"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the roles of pioneer women in the West.",
      "Shows a minimal understanding, with significant inaccuracies or omissions.",
      "Identifies a few roles of pioneer women but lacks depth or supporting details.",
      "Describes several roles of pioneer women with some supporting details and examples.",
      "Clearly describes the roles of pioneer women, providing relevant details and specific examples.",
      "Provides a comprehensive and nuanced understanding of the diverse roles of pioneer women, including their challenges and contributions, with insightful examples."
    ],
    [
      "Unable to name or describe any relevant key figures (e.g., Laura Ingalls Wilder, Annie Bidwell).",
      "Mentions one key figure but provides no relevant information about their role or significance.",
      "Identifies one or two key figures and offers a limited description of their role.",
      "Describes the roles of one or two key figures with some accuracy and relevant details.",
      "Discusses the roles and significance of multiple key figures, providing accurate and relevant details.",
      "Offers a comprehensive analysis of the roles and impact of several key figures, demonstrating a deep understanding of their contributions and challenges."
    ],
    [
      "Demonstrates no understanding of how the status of women changed in the West.",
      "Shows a minimal understanding, with significant inaccuracies or omissions.",
      "Identifies one aspect of the changing status of women but lacks depth or supporting details.",
      "Describes a few aspects of the changing status of women in the West with some supporting details.",
      "Clearly describes the new status of women in the West, providing relevant details and specific examples (e.g., Wyoming suffrage).",
      "Provides a comprehensive and nuanced understanding of the evolving status of women in the West, including the factors that contributed to these changes and their broader implications."
    ],
    [
      "Fails to address or mention the experience of slave women gaining freedom in the West.",
      "Briefly mentions slave women but demonstrates a lack of understanding of their experiences.",
      "Offers a limited description of slave women's experiences gaining freedom, lacking detail or context.",
      "Describes some aspects of the experiences of slave women gaining freedom in the West with some supporting details.",
      "Clearly articulates the experiences of slave women gaining freedom in the West, providing relevant details and historical context.",
      "Provides a comprehensive and nuanced analysis of the experiences of slave women gaining freedom in the West, including the challenges they faced and the significance of their emancipation."
    ]
  ]
}