{
  "criteria": [
    "Understanding of Independence Struggles",
    "Identification and Explanation of Key Leaders",
    "Analysis of Ideology and Religion",
    "Contextualization within Global Change"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of independence struggles in colonized regions.",
      "Demonstrates a minimal understanding of independence struggles, with significant inaccuracies or omissions.",
      "Demonstrates a basic understanding of independence struggles, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of independence struggles, including key events and figures, but may have minor inaccuracies.",
      "Demonstrates a strong understanding of independence struggles, including key events, figures, and underlying causes, with few inaccuracies.",
      "Demonstrates a comprehensive and nuanced understanding of independence struggles, including key events, figures, underlying causes, and long-term effects, with no inaccuracies."
    ],
    [
      "Fails to identify any key leaders of independence movements or provides incorrect information.",
      "Identifies one or two key leaders but provides little to no explanation of their roles.",
      "Identifies key leaders such as Sun Yat-sen, but explanation of roles is superficial.",
      "Identifies key leaders and provides a general explanation of their roles in the independence struggles.",
      "Identifies key leaders and provides a detailed explanation of their roles and contributions to the independence struggles.",
      "Identifies key leaders, provides a nuanced explanation of their roles, and analyzes their impact on the independence struggles and subsequent history."
    ],
    [
      "Fails to mention the role of ideology or religion in independence struggles.",
      "Mentions ideology or religion but does not explain its role in independence struggles.",
      "Provides a superficial explanation of the role of ideology or religion.",
      "Explains how ideology or religion influenced independence struggles.",
      "Analyzes the complex ways in which ideology and religion shaped the goals, strategies, and outcomes of independence struggles.",
      "Provides a comprehensive and insightful analysis of the interplay between ideology, religion, and independence struggles, including examples of conflicting ideologies or religious beliefs."
    ],
    [
      "Demonstrates no awareness of the broader context of global change during the era of New Imperialism.",
      "Demonstrates a minimal awareness of the broader context of global change.",
      "Acknowledges the context of New Imperialism but does not connect it to the independence struggles.",
      "Connects independence struggles to the context of New Imperialism, but lacks detail.",
      "Explains how the dynamics of New Imperialism influenced independence struggles.",
      "Analyzes the complex relationships between New Imperialism, global power dynamics, and the rise of independence movements, demonstrating a sophisticated understanding of historical context."
    ]
  ]
}