{
  "criteria": [
    "Understanding of Immigration and Migration Patterns",
    "Explanation of the Growth of Towns and Cities",
    "Use of Evidence and Historical Context"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of American immigration, internal migration, or settlement patterns in California since the 1850s.",
      "Demonstrates a minimal understanding of American immigration, internal migration, or settlement patterns in California since the 1850s. Provides fragmented or inaccurate information.",
      "Demonstrates a basic understanding of American immigration, internal migration, and settlement patterns in California since the 1850s. Identifies one or two relevant factors but lacks depth.",
      "Demonstrates a satisfactory understanding of American immigration, internal migration, and settlement patterns in California since the 1850s. Explains several factors contributing to these patterns with some supporting details.",
      "Demonstrates a strong understanding of American immigration, internal migration, and settlement patterns in California since the 1850s. Provides a clear explanation of multiple factors and their impact on California's development.",
      "Demonstrates a comprehensive and insightful understanding of American immigration, internal migration, and settlement patterns in California since the 1850s. Offers a nuanced analysis of the various factors and their complex interrelationships, including the growth of towns and cities."
    ],
    [
      "Shows no awareness of the growth of towns and cities in California related to immigration and migration.",
      "Mentions the growth of towns and cities but does not connect it to immigration or migration.",
      "Identifies Los Angeles as a growing city but provides no explanation for its growth.",
      "Explains the growth of towns and cities, including Los Angeles, with a general connection to immigration and migration.",
      "Provides a detailed explanation of the growth of towns and cities, including Los Angeles, directly linking it to specific immigration and migration patterns and providing supporting examples.",
      "Offers a sophisticated analysis of the interconnectedness between American immigration, internal migration, settlement, and the growth of towns and cities (e.g., Los Angeles), including historical context and potential consequences."
    ],
    [
      "Provides no evidence or historical context to support claims.",
      "Offers minimal evidence, which may be irrelevant or inaccurate.",
      "Provides some evidence, but it is limited and may lack proper context.",
      "Supports explanations with relevant evidence and provides some historical context.",
      "Uses a variety of evidence effectively and provides clear historical context to support explanations.",
      "Demonstrates mastery in the use of evidence and historical context, weaving them together seamlessly to create a compelling and well-supported analysis."
    ]
  ]
}