{
  "criteria": [
    "Understanding of Protestants' new practices of church self-government",
    "Explanation of the influence of those practices on the development of democratic practices",
    "Explanation of the influence of those practices on the ideas of federalism"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no understanding of Protestants' new practices of church self-government.",
      "The student demonstrates a minimal understanding of Protestants' new practices of church self-government, with significant gaps in knowledge.",
      "The student demonstrates a basic understanding of Protestants' new practices of church self-government but struggles to provide specific examples.",
      "The student demonstrates a satisfactory understanding of Protestants' new practices of church self-government, providing some examples.",
      "The student demonstrates a strong understanding of Protestants' new practices of church self-government, providing clear and relevant examples.",
      "The student demonstrates a comprehensive understanding of Protestants' new practices of church self-government, providing insightful examples and analysis."
    ],
    [
      "The student does not attempt to explain the influence of Protestants' practices on democratic practices.",
      "The student attempts to explain the influence but provides vague or inaccurate information.",
      "The student identifies a connection between Protestants' practices and democratic practices but struggles to explain the relationship.",
      "The student explains the influence of Protestants' practices on democratic practices with some clarity and supporting details.",
      "The student clearly explains the influence of Protestants' practices on democratic practices, providing relevant historical context.",
      "The student expertly explains the influence of Protestants' practices on democratic practices, providing nuanced analysis and insightful connections to broader historical trends."
    ],
    [
      "The student does not attempt to explain the influence of Protestants' practices on ideas of federalism.",
      "The student attempts to explain the influence but provides vague or inaccurate information.",
      "The student identifies a connection between Protestants' practices and ideas of federalism but struggles to explain the relationship.",
      "The student explains the influence of Protestants' practices on ideas of federalism with some clarity and supporting details.",
      "The student clearly explains the influence of Protestants' practices on ideas of federalism, providing relevant historical context.",
      "The student expertly explains the influence of Protestants' practices on ideas of federalism, providing nuanced analysis and insightful connections to broader historical trends."
    ]
  ]
}