{
  "criteria": [
    "Understanding Japan's Geographic Proximity",
    "Intellectual and Linguistic Influence",
    "Religious and Philosophical Influence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Japan's geographic location in relation to China and Korea.",
      "Identifies Japan, China, and Korea on a map but does not explain the significance of their proximity.",
      "Describes Japan's location relative to China and Korea but provides limited explanation of its importance.",
      "Explains how Japan's proximity to China and Korea facilitated cultural exchange and influence.",
      "Analyzes the specific geographic factors that made Japan susceptible to influence from the mainland while maintaining its distinct identity.",
      "Provides a nuanced analysis of the geographic dynamics, including maritime routes and natural barriers, and their impact on the flow of ideas and culture between Japan, China, and Korea."
    ],
    [
      "Shows no recognition of Chinese or Korean influence on Japanese intellectual or linguistic development.",
      "Mentions that Chinese and Korean languages and ideas impacted Japan but provides no specific examples.",
      "Identifies some elements of Chinese or Korean origin in Japanese language or thought (e.g., kanji, Confucianism) but does not explain their significance.",
      "Explains how specific intellectual and linguistic elements from China and Korea were adopted and adapted in Japan.",
      "Analyzes the transformation of Chinese and Korean intellectual and linguistic elements as they were integrated into Japanese society and culture.",
      "Evaluates the lasting impact of Chinese and Korean languages and ideas on the development of Japanese identity, thought, and expression, including examples of syncretism and innovation."
    ],
    [
      "Demonstrates no knowledge of Chinese or Korean religious or philosophical impact on Japan.",
      "Names Buddhism or Confucianism as having originated in China or Korea but does not connect them to Japan.",
      "States that religious and philosophical ideas from China and Korea influenced Japan but lacks specific examples.",
      "Describes the introduction and adaptation of Buddhism, Confucianism, or other religious\/philosophical systems in Japan.",
      "Compares and contrasts the original forms of these religious\/philosophical systems with their manifestation in Japan, explaining the reasons for the changes.",
      "Assesses the long-term effects of religious and philosophical imports on Japanese culture, politics, and social structure, including the development of unique Japanese schools of thought and religious practices."
    ]
  ]
}