{
  "criteria": [
    "Understanding of Major Foreign Policy Events",
    "Analysis of Motivations Behind Foreign Policy",
    "Evaluation of the Impact of U.S. Foreign Policy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of any major U.S. foreign policy events since WWII.",
      "Student can identify one major U.S. foreign policy event since WWII but lacks detail or context.",
      "Student identifies 2-3 major U.S. foreign policy events since WWII but with limited understanding of their significance.",
      "Student identifies several major U.S. foreign policy events since WWII and demonstrates a basic understanding of their causes and consequences.",
      "Student thoroughly explains several major U.S. foreign policy events since WWII, including their causes, consequences, and global impact.",
      "Student provides a comprehensive analysis of numerous major U.S. foreign policy events since WWII, demonstrating a nuanced understanding of their historical context, long-term effects, and connections to current events."
    ],
    [
      "Student offers no analysis of the motivations behind U.S. foreign policy decisions.",
      "Student provides a superficial or inaccurate explanation of the motivations behind U.S. foreign policy.",
      "Student identifies one or two possible motivations behind U.S. foreign policy decisions but lacks supporting evidence.",
      "Student explains several motivations behind U.S. foreign policy decisions, referencing relevant historical context.",
      "Student analyzes the complex and often competing motivations behind U.S. foreign policy decisions, providing specific examples and supporting evidence.",
      "Student offers a sophisticated and insightful analysis of the multifaceted motivations behind U.S. foreign policy decisions, considering economic, political, social, and ideological factors."
    ],
    [
      "Student does not attempt to evaluate the impact of U.S. foreign policy.",
      "Student offers a general or unsubstantiated opinion on the impact of U.S. foreign policy.",
      "Student identifies one or two potential impacts of U.S. foreign policy but lacks supporting evidence.",
      "Student describes several impacts of U.S. foreign policy, providing some supporting evidence.",
      "Student evaluates the positive and negative impacts of U.S. foreign policy on different regions, countries, and groups of people, providing specific examples.",
      "Student offers a nuanced and well-supported evaluation of the multifaceted impacts of U.S. foreign policy, considering both intended and unintended consequences, and acknowledging different perspectives."
    ]
  ]
}