{
  "criteria": [
    "Understanding of Key Events: Demonstrates comprehension of significant events and turning points in the post-World War II world.",
    "Analysis of Political and Economic Developments: Analyzes the major political and economic shifts that shaped the post-war era.",
    "Understanding of Ideological Conflicts: Explains the major ideological conflicts (e.g., Cold War) and their global impact.",
    "Connections to Contemporary Issues: Connects historical developments to contemporary global issues and challenges."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of key events or turning points in the post-World War II world.",
      "Identifies a few key events but demonstrates limited understanding of their significance.",
      "Recognizes some key events and demonstrates a basic understanding of their context.",
      "Demonstrates a clear understanding of several key events and their immediate impact.",
      "Analyzes key events in detail, explaining their causes, consequences, and connections to broader historical trends.",
      "Synthesizes information from multiple sources to provide a comprehensive and nuanced understanding of key events and their long-term global impact."
    ],
    [
      "Shows no awareness of political or economic developments in the post-World War II world.",
      "Identifies a few political or economic changes but lacks understanding of their causes or effects.",
      "Describes some political and economic developments with limited analysis of their significance.",
      "Explains several political and economic shifts and their impact on specific regions or countries.",
      "Analyzes the complex interplay between political and economic factors in shaping the post-war world order.",
      "Evaluates the long-term consequences of political and economic developments, considering multiple perspectives and alternative interpretations."
    ],
    [
      "Demonstrates no understanding of ideological conflicts in the post-World War II era.",
      "Identifies the Cold War but struggles to explain its causes or consequences.",
      "Describes the basic principles of the Cold War and other ideological conflicts.",
      "Explains the key differences between major ideologies and their impact on global politics.",
      "Analyzes the complex dynamics of ideological conflicts, considering their impact on different regions and populations.",
      "Evaluates the long-term legacies of ideological conflicts, considering their continued relevance in the 21st century."
    ],
    [
      "Unable to make any connections between post-World War II history and contemporary issues.",
      "Makes superficial connections between past events and present-day challenges.",
      "Identifies some relevant connections between historical developments and current global issues.",
      "Explains how historical events have shaped contemporary global challenges.",
      "Analyzes the complex relationships between historical trends and present-day issues, considering multiple perspectives.",
      "Synthesizes historical knowledge with contemporary analysis to propose informed solutions to current global challenges."
    ]
  ]
}