{
  "criteria": [
    "Understanding of the Great Depression's Effects",
    "Understanding of the Dust Bowl's Effects",
    "Understanding of World War II's Effects",
    "Ability to Connect Events and Analyze Their Interrelatedness"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Great Depression's impact on California.",
      "Shows minimal understanding; struggles to identify any effects of the Great Depression on California.",
      "Identifies a few effects of the Great Depression but lacks detail and explanation.",
      "Describes several effects of the Great Depression on California with some supporting details.",
      "Explains the significant effects of the Great Depression on California's economy, society, and\/or politics with clear examples.",
      "Provides a comprehensive analysis of the far-reaching effects of the Great Depression on California, including nuanced details and insightful connections."
    ],
    [
      "Demonstrates no understanding of the Dust Bowl's impact on California.",
      "Shows minimal understanding; struggles to identify any effects of the Dust Bowl on California.",
      "Identifies a few effects of the Dust Bowl but lacks detail and explanation.",
      "Describes several effects of the Dust Bowl on California with some supporting details.",
      "Explains the significant effects of the Dust Bowl on California's population, agriculture, and society with clear examples.",
      "Provides a comprehensive analysis of the Dust Bowl's impact on California, including migration patterns, economic changes, and social consequences, with insightful connections."
    ],
    [
      "Demonstrates no understanding of World War II's impact on California.",
      "Shows minimal understanding; struggles to identify any effects of World War II on California.",
      "Identifies a few effects of World War II but lacks detail and explanation.",
      "Describes several effects of World War II on California with some supporting details.",
      "Explains the significant effects of World War II on California's economy, industry, and society with clear examples.",
      "Provides a comprehensive analysis of World War II's transformative effects on California, including its role in the war effort, economic boom, demographic shifts, and long-term consequences, with insightful connections."
    ],
    [
      "Fails to connect the Great Depression, Dust Bowl, and World War II or analyze their relationships to California.",
      "Attempts to connect the events but demonstrates a limited understanding of their interrelationships and impact on California.",
      "Identifies some connections between the events but provides a superficial analysis of their impact on California.",
      "Analyzes the connections between the Great Depression, Dust Bowl, and World War II and their combined effects on California.",
      "Demonstrates a strong understanding of how the Great Depression, Dust Bowl, and World War II were interconnected and shaped California's development.",
      "Provides a nuanced and insightful analysis of the complex interrelationships between the Great Depression, Dust Bowl, and World War II, and their lasting impact on California's economy, society, and culture."
    ]
  ]
}