{
  "criteria": [
    "Understanding of Leaders' Perspectives",
    "Knowledge of Key Events and Complex Consequences"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the views or lives of any Civil War leaders or soldiers.",
      "Shows minimal understanding of one leader's or soldier's view from either side of the war.",
      "Identifies the views of at least two leaders or soldiers from one side of the war but lacks depth or accuracy.",
      "Describes the views of at least three leaders or soldiers from both sides of the war with reasonable accuracy.",
      "Analyzes the views and lives of multiple leaders and soldiers from both sides, including black soldiers, demonstrating a nuanced understanding of their motivations and experiences.",
      "Critically evaluates and synthesizes the perspectives of various leaders and soldiers from all sides of the war, offering insightful commentary and connecting their views to broader historical context, including race and the experiences of black soldiers."
    ],
    [
      "Demonstrates no knowledge of key events or consequences related to the leaders and soldiers.",
      "Shows a superficial understanding of one key event or consequence associated with a leader or soldier.",
      "Identifies multiple events and consequences, but lacks a clear connection to the lives and views of leaders and soldiers studied.",
      "Explains the relationship between key events, consequences, and the views and lives of specific leaders and soldiers on both sides.",
      "Analyzes the complex interplay between the actions, motivations, and experiences of leaders and soldiers and the broader consequences of the Civil War.",
      "Evaluates the long-term impact of the leaders' and soldiers' actions and views, connecting these to enduring social, political, and racial issues in American society, displaying significant historical insight."
    ]
  ]
}