{
  "criteria": [
    "Understanding of Immigration and Migration Patterns",
    "Identification of Countries of Origin and Their Locations",
    "Analysis of Conflicts and Accords Among Diverse Groups",
    "Discussion of the Diverse Composition of Immigrant Groups"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of immigration and migration to California between 1850 and 1900.",
      "Demonstrates a minimal understanding of immigration and migration to California, with significant inaccuracies or omissions.",
      "Demonstrates a basic understanding of immigration and migration to California, but lacks detail and clarity.",
      "Demonstrates a satisfactory understanding of immigration and migration to California, including the time period and main groups involved.",
      "Demonstrates a strong understanding of immigration and migration to California, including the push\/pull factors, and main groups involved.",
      "Demonstrates a comprehensive and nuanced understanding of immigration and migration to California, including the push\/pull factors, and main groups involved."
    ],
    [
      "Unable to identify any countries of origin for immigrants and migrants to California during this period.",
      "Identifies one or two countries of origin with inaccuracies regarding their relative locations.",
      "Identifies several countries of origin but struggles to accurately describe their relative locations.",
      "Identifies several key countries of origin and generally describes their relative locations with reasonable accuracy.",
      "Accurately identifies multiple countries of origin and precisely describes their relative locations, demonstrating geographic knowledge.",
      "Accurately identifies and discusses multiple countries of origin and their relative locations, as well as the geographic challenges faced by newcomers."
    ],
    [
      "Shows no awareness of conflicts or accords among diverse groups in California during this period.",
      "Mentions conflicts or accords superficially without providing specific examples or context.",
      "Identifies some conflicts or accords but struggles to explain their causes or consequences.",
      "Describes specific conflicts and accords, such as the Chinese Exclusion Act, and explains their immediate effects.",
      "Analyzes the causes and consequences of conflicts and accords, demonstrating an understanding of the complex relationships between diverse groups.",
      "Provides a sophisticated analysis of the historical context surrounding conflicts and accords, and discusses the long-term impacts on California society."
    ],
    [
      "Does not identify the diversity of immigrant groups in California between 1850 and 1900.",
      "Lists one or two immigrant groups, but does not elaborate on their unique characteristics or experiences.",
      "Identifies several immigrant groups but lacks detail regarding their cultural, economic, or social backgrounds.",
      "Describes the diverse composition of immigrant groups, including Chinese, Irish, German, and Mexican immigrants, with some supporting details.",
      "Explains the diverse composition of immigrant groups and analyzes how their backgrounds shaped their experiences in California.",
      "Explains the diverse composition of immigrant groups with detailed examples and considers how factors such as class, gender, and religion affected their adaptation to California society."
    ]
  ]
}