{
  "criteria": [
    "Understanding the Establishment and Purpose of the United Nations",
    "Knowledge of the Warsaw Pact, SEATO, NATO, and the Organization of American States",
    "Analysis of the Functions of International Organizations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the UN's establishment or purpose.",
      "Shows minimal understanding of either the UN's establishment or its purpose.",
      "Displays basic understanding of the UN's establishment and its general purpose, but lacks detail.",
      "Explains the establishment of the UN and its main purposes with some supporting details.",
      "Clearly explains the establishment, purposes, and key functions of the United Nations with supporting details.",
      "Provides a comprehensive explanation of the UN's historical context, establishment, purposes, functions, and its impact on international relations."
    ],
    [
      "Unable to identify any of the mentioned organizations.",
      "Identifies at least one organization but cannot explain its purpose or function.",
      "Identifies multiple organizations, but shows limited understanding of their purposes or functions.",
      "Describes the purpose and function of at least two organizations with some accuracy.",
      "Accurately describes the purposes and functions of the Warsaw Pact, SEATO, NATO, and the Organization of American States.",
      "Provides detailed analysis of the purposes, functions, and historical context of the Warsaw Pact, SEATO, NATO, and the Organization of American States, including their impact and relevance in the post-World War II world."
    ],
    [
      "Shows no ability to analyze the functions of international organizations.",
      "Attempts to describe the functions of one or more organizations, but lacks clarity or accuracy.",
      "Provides a superficial description of the functions of international organizations without critical analysis.",
      "Analyzes the functions of the international organizations, including discussion of their strengths and weaknesses.",
      "Provides insightful analysis of the functions, roles, and impacts of the international organizations.",
      "Offers a nuanced and comprehensive analysis of the functions of these organizations, demonstrating a deep understanding of their complexities, challenges, and lasting impacts on global politics."
    ]
  ]
}