{
  "criteria": [
    "Understanding of Popular Sovereignty and Consent of the Governed",
    "Knowledge of Individual Liberty and Rights",
    "Ability to Analyze the Constitution as the Foundation of the American Republic"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of popular sovereignty or the idea that government derives its power from the people.",
      "Shows limited understanding of popular sovereignty, struggling to explain how government power originates from the people.",
      "Displays basic understanding of popular sovereignty, but struggles to connect it to specific examples in the Constitution.",
      "Demonstrates a clear understanding of popular sovereignty and can explain how the government derives its power from the consent of the governed.",
      "Demonstrates a strong understanding of popular sovereignty, providing examples from the Constitution and historical events.",
      "Exhibits a comprehensive understanding of popular sovereignty, analyzing its implications for American democracy and comparing it to other forms of government."
    ],
    [
      "Shows no awareness of individual liberty or the rights protected by the Constitution.",
      "Demonstrates limited knowledge of individual liberties, unable to name specific rights guaranteed by the Constitution.",
      "Identifies some individual liberties, but struggles to explain their significance or how they are protected.",
      "Demonstrates a clear understanding of individual liberty and can identify key rights protected by the Constitution, such as freedom of speech and religion.",
      "Explains the importance of individual liberties in a constitutional democracy, providing examples of how these rights have been challenged and defended throughout American history.",
      "Analyzes the relationship between individual liberty and the common good, discussing the ongoing debates and challenges related to balancing these values in American society."
    ],
    [
      "Unable to identify the Constitution as the foundation of the American republic.",
      "Shows a limited awareness of the Constitution's role in establishing the American republic.",
      "Recognizes the Constitution as important, but struggles to explain its significance in shaping the American political system.",
      "Explains how the Constitution establishes the framework for the American republic, including the separation of powers and checks and balances.",
      "Analyzes the Constitution's enduring significance as the foundation of the American republic, discussing its adaptability and its impact on subsequent legal and political developments.",
      "Evaluates the successes and failures of the Constitution in achieving its goals, considering alternative perspectives and suggesting potential reforms for the 21st century."
    ]
  ]
}