{
  "criteria": [
    "Understanding of the Maurya Empire's Growth",
    "Knowledge of Asoka's Political Achievements",
    "Knowledge of Asoka's Moral Achievements and Impact",
    "Historical Context and Significance"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Maurya Empire's growth or its key figures.",
      "Shows minimal understanding of the Maurya Empire's growth, with significant gaps in knowledge.",
      "Identifies the Maurya Empire and some aspects of its growth, but lacks detail and accuracy.",
      "Describes the main stages of the Maurya Empire's growth with reasonable accuracy.",
      "Explains the key factors contributing to the Maurya Empire's growth with supporting details.",
      "Provides a comprehensive analysis of the Maurya Empire's growth, including its geographical and political context."
    ],
    [
      "Shows no awareness of Asoka's political achievements or his role as emperor.",
      "Mentions Asoka but is unable to describe any of his political achievements.",
      "Identifies one or two of Asoka's political achievements with limited explanation.",
      "Describes several of Asoka's key political achievements, such as his administrative reforms or policies.",
      "Explains the impact and significance of Asoka's political achievements on the Maurya Empire.",
      "Analyzes Asoka's political achievements, evaluating their long-term consequences and historical importance."
    ],
    [
      "Displays no understanding of Asoka's moral achievements or their importance.",
      "Briefly mentions Asoka's moral stance but offers no specific examples.",
      "Identifies one or two of Asoka's moral achievements, such as his conversion to Buddhism.",
      "Describes several of Asoka's moral achievements, including his edicts and promotion of dharma.",
      "Explains the influence of Asoka's moral achievements on the social and ethical values of the Maurya Empire.",
      "Evaluates the lasting impact of Asoka's moral achievements, considering their relevance to contemporary ethical discussions."
    ],
    [
      "Fails to place the Maurya Empire and Asoka within a broader historical context.",
      "Shows a limited understanding of the time period and geographical location of the Maurya Empire.",
      "Identifies the general time period and location of the Maurya Empire.",
      "Relates the Maurya Empire to other contemporary civilizations or empires.",
      "Explains the Maurya Empire's significance in shaping the history of India and South Asia.",
      "Analyzes the Maurya Empire's legacy, assessing its impact on subsequent empires and cultural developments."
    ]
  ]
}