{
  "criteria": [
    "Understanding of Interactions: Demonstrates comprehension of the dynamics between American Indians and settlers.",
    "Accuracy and Specificity: Provides accurate and specific historical details related to interactions.",
    "Contextualization: Places interactions within broader historical, social, and political contexts."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the interactions between American Indians and new settlers.",
      "Demonstrates a minimal understanding of the interactions, with significant inaccuracies or omissions.",
      "Identifies basic interactions but lacks depth in explaining cooperation or conflict.",
      "Describes some instances of cooperation and conflict but may oversimplify the causes or effects.",
      "Explains various forms of cooperation and conflict with supporting details and examples.",
      "Provides a comprehensive analysis of cooperation and conflict, including complex causes, effects, and diverse perspectives."
    ],
    [
      "Provides inaccurate historical details.",
      "Includes some accurate details but with significant inaccuracies or generalities.",
      "Presents mostly accurate information but lacks specific details or examples.",
      "Supports explanations with accurate and relatively specific historical details.",
      "Demonstrates a strong grasp of accurate and specific historical details, enhancing the explanation.",
      "Exhibits expert knowledge of historical details, using them effectively to support nuanced and insightful explanations."
    ],
    [
      "Fails to place interactions within any relevant historical context.",
      "Shows minimal attempt to contextualize interactions.",
      "Provides some context but fails to connect it directly to the interactions described.",
      "Links interactions to relevant historical, social, or political contexts.",
      "Explains how broader contexts influenced the interactions between American Indians and settlers.",
      "Analyzes the complex interplay between historical contexts and interactions, demonstrating a sophisticated understanding of causality."
    ]
  ]
}