{
  "criteria": [
    "Understanding of Athenian Society",
    "Understanding of Spartan Society",
    "Comparison and Contrast of Athens and Sparta",
    "Roles in the Persian and Peloponnesian Wars"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Athenian society, its values, or its political structures.",
      "Shows a minimal understanding of Athenian society, with significant inaccuracies.",
      "Displays a basic understanding of Athenian society, identifying some key aspects but lacking depth.",
      "Presents a clear understanding of Athenian society, including its values, democracy, and cultural achievements.",
      "Demonstrates a comprehensive understanding of Athenian society, including nuances and complexities.",
      "Offers a sophisticated and insightful analysis of Athenian society, comparing it to modern societies."
    ],
    [
      "Demonstrates no understanding of Spartan society, its values, or its political structures.",
      "Shows a minimal understanding of Spartan society, with significant inaccuracies.",
      "Displays a basic understanding of Spartan society, identifying some key aspects but lacking depth.",
      "Presents a clear understanding of Spartan society, including its militaristic culture, social structure, and governance.",
      "Demonstrates a comprehensive understanding of Spartan society, including nuances and complexities.",
      "Offers a sophisticated and insightful analysis of Spartan society, comparing it to other militaristic societies throughout history."
    ],
    [
      "Fails to compare or contrast Athens and Sparta.",
      "Attempts to compare and contrast, but with significant inaccuracies and a lack of clarity.",
      "Provides a limited comparison and contrast, identifying a few key differences and similarities.",
      "Clearly compares and contrasts Athens and Sparta, highlighting major differences and similarities in their societies, values, and political systems.",
      "Demonstrates a detailed comparison and contrast of Athens and Sparta, exploring the underlying reasons for their differences and similarities.",
      "Offers a nuanced and insightful comparison and contrast of Athens and Sparta, analyzing their impact on the course of Greek history."
    ],
    [
      "Demonstrates no understanding of Athens' and Sparta's roles in the Persian and Peloponnesian Wars.",
      "Shows a minimal understanding of Athens' and Sparta's roles in the wars, with significant inaccuracies.",
      "Displays a basic understanding of Athens' and Sparta's roles in the wars, identifying some key events but lacking depth.",
      "Presents a clear understanding of Athens' and Sparta's roles in the Persian and Peloponnesian Wars, explaining their motivations and contributions.",
      "Demonstrates a comprehensive understanding of Athens' and Sparta's roles in the wars, including the impact of the wars on their societies.",
      "Offers a sophisticated and insightful analysis of Athens' and Sparta's roles in the wars, evaluating their strategies and the long-term consequences of the conflicts."
    ]
  ]
}