{
  "criteria": [
    "Understanding of Andrew Jackson's Election and Jacksonian Democracy",
    "Knowledge of Jackson's Actions as President",
    "Analysis of the Importance and Impact of Jackson's Presidency"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of Andrew Jackson's election or the concept of Jacksonian democracy.",
      "Student demonstrates a minimal understanding of Andrew Jackson's election or Jacksonian democracy with significant gaps in knowledge.",
      "Student demonstrates a partial understanding of Andrew Jackson's election and Jacksonian democracy, but struggles to explain key aspects.",
      "Student demonstrates a satisfactory understanding of Andrew Jackson's election and Jacksonian democracy, explaining most aspects accurately.",
      "Student demonstrates a strong understanding of Andrew Jackson's election and Jacksonian democracy, explaining them clearly and accurately with supporting details.",
      "Student demonstrates a comprehensive and nuanced understanding of Andrew Jackson's election and Jacksonian democracy, providing insightful analysis and connections to broader historical themes."
    ],
    [
      "Student demonstrates no knowledge of Jackson's actions as president.",
      "Student demonstrates minimal knowledge of Jackson's actions as president, mentioning only one action inaccurately.",
      "Student identifies a few of Jackson's actions as president but struggles to explain their significance or provides inaccurate details.",
      "Student accurately identifies and explains several of Jackson's key actions as president, including the spoils system, veto of the National Bank, Indian removal policy, or opposition to the Supreme Court.",
      "Student thoroughly explains Jackson's key actions as president, analyzing their impact and providing relevant historical context.",
      "Student provides a sophisticated analysis of Jackson's actions as president, evaluating their long-term consequences and connecting them to enduring debates about presidential power and social justice."
    ],
    [
      "Student offers no analysis of the importance or impact of Jackson's presidency.",
      "Student provides a superficial analysis of Jackson's presidency, lacking depth and historical context.",
      "Student attempts to analyze the importance or impact of Jackson's presidency, but demonstrates limited understanding or relies on generalizations.",
      "Student provides a reasonable analysis of the importance and impact of Jackson's presidency, discussing both positive and negative aspects.",
      "Student offers a well-supported and insightful analysis of the importance and impact of Jackson's presidency, considering multiple perspectives and historical sources.",
      "Student presents a compelling and original analysis of the importance and impact of Jackson's presidency, demonstrating a deep understanding of its complexities and lasting legacy."
    ]
  ]
}