{
  "criteria": [
    "Understanding of Geographic Influence on City-State Development",
    "Knowledge of Trade and Commerce Patterns",
    "Connection between Geography and Trade"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how geography influenced the development of Greek city-states.",
      "Shows a limited understanding of the connection between geography and the development of city-states, with significant inaccuracies.",
      "Identifies basic geographic features of the Aegean region but struggles to explain their influence on city-state development.",
      "Explains some ways in which geography influenced the development of city-states, but lacks depth and detail.",
      "Clearly explains how geographic factors such as mountains, seas, and islands influenced the development and characteristics of Greek city-states.",
      "Provides a comprehensive and insightful analysis of how geography shaped the development of Greek city-states, including specific examples and nuanced explanations."
    ],
    [
      "Shows no understanding of trade and commerce patterns in the Aegean and Mediterranean regions.",
      "Demonstrates a limited understanding of trade and commerce, with significant inaccuracies regarding the regions involved.",
      "Identifies basic trade routes and commodities but struggles to connect them to specific city-states or regions.",
      "Explains some patterns of trade and commerce among Greek city-states and within the wider Mediterranean region, but lacks detail.",
      "Clearly explains trade and commerce patterns, including major trade routes, commodities, and the roles of key city-states in the Aegean and Mediterranean regions.",
      "Provides a comprehensive and insightful analysis of trade and commerce patterns, including the economic and cultural impacts of trade on Greek city-states and the wider Mediterranean region."
    ],
    [
      "Fails to make any connection between geography and trade.",
      "Attempts to connect geography and trade, but with significant inaccuracies and a lack of clear understanding.",
      "Identifies a basic relationship between geography and trade but struggles to explain the specific ways in which they influenced each other.",
      "Explains some ways in which geography influenced trade patterns or vice versa, but lacks depth and detail.",
      "Clearly explains how geographic factors influenced trade routes, commodities, and the economic relationships among Greek city-states and the wider Mediterranean region.",
      "Provides a comprehensive and insightful analysis of the interconnectedness of geography and trade, including a nuanced understanding of the ways in which they shaped the development of Greek civilization."
    ]
  ]
}