{
  "criteria": [
    "Understanding of Arguments for War: Assessing the student's comprehension of the various arguments presented by leaders from all sides of World War I.",
    "Analysis of Political and Economic Rivalries: Evaluating the student's ability to analyze the role of political and economic rivalries in causing World War I.",
    "Understanding of Ethnic and Ideological Conflicts: Assessing the student's comprehension of the role of ethnic and ideological conflicts in causing World War I.",
    "Understanding of Domestic Discontent and Disorder: Assessing the student's understanding of how domestic issues contributed to the war.",
    "Role of Propaganda and Nationalism: Evaluating the student's analysis of the use of propaganda and the rise of nationalism in mobilizing civilian populations for 'total war'."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the arguments for war presented by leaders during World War I.",
      "Shows a limited understanding of the arguments for war, with significant gaps in comprehension.",
      "Identifies some arguments for war but lacks depth in explaining the motivations and perspectives of leaders.",
      "Explains the main arguments for war from multiple perspectives but may miss nuances or complexities.",
      "Analyzes the arguments for war, providing a comprehensive understanding of the leaders' motivations and perspectives.",
      "Critically evaluates the arguments for war, demonstrating a sophisticated understanding of the historical context and implications."
    ],
    [
      "Shows no understanding of the role of political and economic rivalries in the outbreak of World War I.",
      "Demonstrates a limited awareness of political and economic rivalries but fails to connect them to the causes of the war.",
      "Identifies some political and economic rivalries but struggles to explain their significance.",
      "Explains how political and economic rivalries contributed to the tensions leading up to World War I.",
      "Analyzes the complex interplay of political and economic rivalries in causing World War I, providing specific examples.",
      "Critically evaluates the impact of political and economic rivalries, demonstrating a nuanced understanding of their contribution to the war."
    ],
    [
      "Shows no understanding of the role of ethnic and ideological conflicts in the outbreak of World War I.",
      "Demonstrates a limited awareness of ethnic and ideological conflicts but fails to connect them to the causes of the war.",
      "Identifies some ethnic and ideological conflicts but struggles to explain their significance.",
      "Explains how ethnic and ideological conflicts contributed to the tensions leading up to World War I.",
      "Analyzes the complex interplay of ethnic and ideological conflicts in causing World War I, providing specific examples.",
      "Critically evaluates the impact of ethnic and ideological conflicts, demonstrating a nuanced understanding of their contribution to the war."
    ],
    [
      "Shows no understanding of the role of domestic discontent and disorder in the outbreak of World War I.",
      "Demonstrates a limited awareness of domestic discontent and disorder but fails to connect them to the causes of the war.",
      "Identifies some instances of domestic discontent and disorder but struggles to explain their significance.",
      "Explains how domestic discontent and disorder contributed to the tensions leading up to World War I.",
      "Analyzes the complex interplay of domestic discontent and disorder in causing World War I, providing specific examples.",
      "Critically evaluates the impact of domestic discontent and disorder, demonstrating a nuanced understanding of their contribution to the war."
    ],
    [
      "Shows no understanding of the role of propaganda and nationalism in mobilizing civilian populations for war.",
      "Demonstrates a limited awareness of propaganda and nationalism but fails to connect them to the concept of 'total war'.",
      "Identifies some uses of propaganda and examples of nationalism but struggles to explain their impact.",
      "Explains how propaganda and nationalism were used to mobilize civilian populations for 'total war'.",
      "Analyzes the effectiveness of propaganda and the impact of nationalism on civilian populations during World War I, providing specific examples.",
      "Critically evaluates the use of propaganda and the rise of nationalism, demonstrating a nuanced understanding of their role in shaping public opinion and mobilizing support for the war."
    ]
  ]
}