{
  "criteria": [
    "Understanding of Imperialism from Colonizers' Perspective",
    "Understanding of Imperialism from Colonized Perspective",
    "Analysis of Immediate and Long-Term Responses"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of imperialism from the colonizers' perspective.",
      "Shows a very limited understanding of imperialism from the colonizers' perspective; major misconceptions are evident.",
      "Displays a basic understanding of imperialism from the colonizers' perspective, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of imperialism from the colonizers' perspective, including some motivations and justifications.",
      "Exhibits a strong understanding of imperialism from the colonizers' perspective, explaining motivations, justifications, and impact with specific examples.",
      "Shows a comprehensive understanding of imperialism from the colonizers' perspective, analyzing complex motivations, justifications, and long-term consequences with insightful examples."
    ],
    [
      "Demonstrates no understanding of imperialism from the colonized perspective.",
      "Shows a very limited understanding of imperialism from the colonized perspective; major misconceptions are evident.",
      "Displays a basic understanding of imperialism from the colonized perspective, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of imperialism from the colonized perspective, including some immediate and long-term responses.",
      "Exhibits a strong understanding of imperialism from the colonized perspective, explaining varied immediate and long-term responses with specific examples.",
      "Shows a comprehensive understanding of imperialism from the colonized perspective, analyzing the varied responses, resistance movements, and long-term consequences with insightful examples."
    ],
    [
      "Fails to identify any immediate or long-term responses by people under colonial rule.",
      "Identifies responses without any explanation.",
      "Identifies a few immediate or long-term responses, but descriptions are vague and lack specific details.",
      "Describes immediate and long-term responses, with some specific examples but lacks in-depth analysis.",
      "Analyzes immediate and long-term responses, providing detailed examples and explaining their significance.",
      "Offers a comprehensive analysis of immediate and long-term responses, including varied resistance movements, their effectiveness, and lasting impacts with nuanced insight."
    ]
  ]
}