{
  "criteria": [
    "Understanding of Buddhism's Origins and Core Beliefs",
    "Knowledge of the Han Dynasty's Political and Social Context",
    "Explanation of the Routes and Methods of Diffusion",
    "Analysis of the Factors Facilitating or Impeding Diffusion"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of Buddhism's origins or core beliefs.",
      "Displays a very limited understanding of Buddhism's origins and core beliefs with significant inaccuracies.",
      "Shows a basic understanding of Buddhism's origins and core beliefs but with some misunderstandings or gaps in knowledge.",
      "Demonstrates a satisfactory understanding of Buddhism's origins and core beliefs, accurately describing key concepts.",
      "Exhibits a strong understanding of Buddhism's origins and core beliefs, providing clear and accurate explanations.",
      "Displays a comprehensive and nuanced understanding of Buddhism's origins and core beliefs, including complex concepts and interpretations."
    ],
    [
      "Shows no understanding of the Han Dynasty's political and social context.",
      "Displays a very limited understanding of the Han Dynasty's political and social context with significant inaccuracies.",
      "Shows a basic understanding of the Han Dynasty's political and social context but with some misunderstandings or gaps in knowledge.",
      "Demonstrates a satisfactory understanding of the Han Dynasty's political and social context, accurately describing key aspects.",
      "Exhibits a strong understanding of the Han Dynasty's political and social context, providing clear and accurate explanations.",
      "Displays a comprehensive and nuanced understanding of the Han Dynasty's political and social context, including complex social and political factors."
    ],
    [
      "Provides no explanation of the routes and methods by which Buddhism spread northward to China.",
      "Offers a very limited explanation of the routes and methods of diffusion with significant inaccuracies.",
      "Shows a basic understanding of the routes and methods of diffusion but with some misunderstandings or gaps in knowledge.",
      "Demonstrates a satisfactory understanding of the routes and methods of diffusion, accurately describing key routes and methods.",
      "Exhibits a strong understanding of the routes and methods of diffusion, providing clear and accurate explanations.",
      "Displays a comprehensive and nuanced understanding of the routes and methods of diffusion, including specific examples and challenges."
    ],
    [
      "Shows no analysis of the factors that facilitated or impeded the diffusion of Buddhism.",
      "Offers a very limited analysis of the factors with significant inaccuracies.",
      "Shows a basic analysis of the factors but with some misunderstandings or gaps in knowledge.",
      "Demonstrates a satisfactory analysis of the factors, accurately describing key elements.",
      "Exhibits a strong analysis of the factors, providing clear and accurate explanations.",
      "Displays a comprehensive and nuanced analysis of the factors, including complex interactions and long-term effects."
    ]
  ]
}