{
  "criteria": [
    "Understanding of Historical Context",
    "Analysis of Roosevelt's Foreign Policy",
    "Explanation of the Four Freedoms Speech",
    "Use of Evidence and Sources"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context surrounding Roosevelt's foreign policy and the Four Freedoms speech.",
      "Demonstrates a minimal understanding of the historical context with significant inaccuracies or omissions.",
      "Demonstrates a basic understanding of the historical context but misses some important details or connections.",
      "Demonstrates a satisfactory understanding of the historical context, including the major events and ideas influencing Roosevelt's policies.",
      "Demonstrates a strong understanding of the historical context, providing relevant details and insightful connections.",
      "Demonstrates a comprehensive and nuanced understanding of the historical context, including sophisticated insights into the factors shaping Roosevelt's foreign policy."
    ],
    [
      "Provides no analysis of Roosevelt's foreign policy during World War II.",
      "Provides a superficial or inaccurate analysis of Roosevelt's foreign policy with little supporting evidence.",
      "Provides a basic analysis of Roosevelt's foreign policy, identifying some key aspects but lacking depth or complexity.",
      "Provides a clear and well-supported analysis of Roosevelt's foreign policy, explaining the main goals and strategies.",
      "Provides a thorough and insightful analysis of Roosevelt's foreign policy, examining its motivations, consequences, and complexities.",
      "Provides an exceptional and nuanced analysis of Roosevelt's foreign policy, demonstrating a deep understanding of its historical significance and long-term impact."
    ],
    [
      "Shows no understanding of the Four Freedoms speech or its significance.",
      "Demonstrates a minimal understanding of the Four Freedoms speech with significant inaccuracies or omissions.",
      "Demonstrates a basic understanding of the Four Freedoms speech but struggles to explain its meaning or relevance.",
      "Clearly explains the main ideas of the Four Freedoms speech and connects them to Roosevelt's foreign policy goals.",
      "Provides a detailed and insightful explanation of the Four Freedoms speech, exploring its historical context, rhetorical strategies, and impact.",
      "Offers a sophisticated and nuanced interpretation of the Four Freedoms speech, analyzing its enduring legacy and contemporary relevance."
    ],
    [
      "Provides no evidence or sources to support claims.",
      "Provides minimal evidence or sources, which are often irrelevant or inaccurate.",
      "Provides some evidence or sources but does not always use them effectively to support claims.",
      "Uses relevant evidence and sources to support claims, demonstrating a basic understanding of source evaluation.",
      "Uses a variety of credible evidence and sources to effectively support claims, demonstrating strong source evaluation skills.",
      "Uses a diverse range of authoritative evidence and sources to construct a compelling and well-supported argument, demonstrating sophisticated source evaluation and synthesis skills."
    ]
  ]
}