{
  "criteria": [
    "Understanding the relationship between industrialization, migration, and immigration.",
    "Describing the changing landscape, including the growth and divisions of cities.",
    "Use of supporting evidence and historical context."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the relationship between industrialization, rural-to-urban migration, and immigration.",
      "Student demonstrates a minimal understanding of one or two elements (industrialization, migration, or immigration) but does not connect them.",
      "Student identifies industrialization, migration, and immigration but struggles to explain their interconnectedness.",
      "Student explains the basic relationships between industrialization, migration, and immigration with some inaccuracies or omissions.",
      "Student accurately explains the complex relationships between industrialization, rural-to-urban migration, and immigration from Southern and Eastern Europe.",
      "Student provides a nuanced and insightful analysis of the relationships between industrialization, migration, and immigration, including supporting evidence and relevant historical context."
    ],
    [
      "Student provides no description of the changing landscape or growth\/divisions of cities.",
      "Student mentions either the growth of cities OR divisions within cities but lacks detail.",
      "Student describes the growth of cities AND divisions but demonstrates limited understanding of the reasons behind these changes.",
      "Student describes the growth of cities linked by industry and trade AND the development of cities divided by race, ethnicity, and class, with some general explanations.",
      "Student provides a clear and detailed description of the growth of cities linked by industry and trade AND the development of cities divided by race, ethnicity, and class, explaining the key factors involved.",
      "Student offers a comprehensive and insightful description of the changing urban landscape, including detailed explanations of the factors driving urban growth and the complex interplay of race, ethnicity, and class divisions, with specific historical examples."
    ],
    [
      "Demonstration lacks any supporting evidence or historical context.",
      "Demonstration includes minimal, vaguely relevant information.",
      "Demonstration includes some relevant information but lacks proper citation or connection to the main points.",
      "Demonstration provides relevant information and context but may not be fully developed or consistently applied.",
      "Demonstration provides well-integrated supporting evidence and historical context that enhances the analysis.",
      "Demonstration skillfully incorporates a range of evidence and historical context to provide a compelling and insightful analysis."
    ]
  ]
}