{
  "criteria": [
    "Understanding of the Ninth Amendment: Recognition of unenumerated rights retained by the people.",
    "Understanding of the Tenth Amendment: Comprehension of reserved powers for the states and the people.",
    "Analysis of the extent of federal government's power: Ability to discuss and interpret the limitations on federal power imposed by the Ninth and Tenth Amendments.",
    "Application of Amendments to contemporary issues: Ability to connect the principles of the Ninth and Tenth Amendments to current events and legal debates."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Ninth Amendment or its implications.",
      "Shows minimal understanding of the Ninth Amendment, with significant misconceptions.",
      "Displays basic understanding of the Ninth Amendment, but struggles to articulate its meaning clearly.",
      "Exhibits satisfactory understanding of the Ninth Amendment and can explain its general purpose.",
      "Demonstrates strong understanding of the Ninth Amendment, providing clear explanations and examples.",
      "Shows comprehensive understanding of the Ninth Amendment, including its historical context and contemporary relevance."
    ],
    [
      "Demonstrates no understanding of the Tenth Amendment or its implications.",
      "Shows minimal understanding of the Tenth Amendment, with significant misconceptions.",
      "Displays basic understanding of the Tenth Amendment, but struggles to articulate its meaning clearly.",
      "Exhibits satisfactory understanding of the Tenth Amendment and can explain its general purpose.",
      "Demonstrates strong understanding of the Tenth Amendment, providing clear explanations and examples.",
      "Shows comprehensive understanding of the Tenth Amendment, including its historical context and contemporary relevance."
    ],
    [
      "Unable to analyze or discuss the limitations on federal power.",
      "Offers a superficial analysis of federal power limitations, lacking depth and accuracy.",
      "Provides a basic analysis of federal power limitations but struggles with complex interpretations.",
      "Presents a satisfactory analysis of federal power limitations with reasonable interpretations.",
      "Demonstrates a strong analytical ability regarding federal power limitations, offering insightful interpretations.",
      "Exhibits exceptional analytical skills, providing nuanced and comprehensive interpretations of federal power limitations."
    ],
    [
      "Unable to connect the principles of the Ninth and Tenth Amendments to contemporary issues.",
      "Attempts to connect the Amendments to current issues but lacks clarity and relevance.",
      "Makes limited connections between the Amendments and contemporary issues, with some inaccuracies.",
      "Applies the principles of the Ninth and Tenth Amendments to current events with reasonable accuracy.",
      "Demonstrates a strong ability to apply the Amendments to contemporary issues, providing relevant examples.",
      "Exhibits exceptional ability to apply the Amendments to contemporary issues, offering insightful and well-supported arguments."
    ]
  ]
}