{
  "criteria": [
    "Identification of Popular Culture Forms",
    "Understanding of Origins",
    "Understanding of Geographic Diffusion",
    "Connection to Post-WWII America"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any forms of popular culture.",
      "The student identifies one form of popular culture but lacks detail.",
      "The student identifies two forms of popular culture with limited detail.",
      "The student identifies at least three forms of popular culture with some detail.",
      "The student clearly identifies multiple forms of popular culture with good detail and examples.",
      "The student comprehensively identifies and describes various forms of popular culture, providing rich examples and context."
    ],
    [
      "The student demonstrates no understanding of the origins of any popular culture form.",
      "The student attempts to explain the origin of one popular culture form but is largely inaccurate.",
      "The student vaguely explains the origins of one or two popular culture forms.",
      "The student explains the origins of several popular culture forms with reasonable accuracy.",
      "The student clearly explains the origins of multiple popular culture forms, demonstrating good understanding.",
      "The student thoroughly explains the origins of various popular culture forms, demonstrating deep understanding and insightful connections."
    ],
    [
      "The student does not discuss the geographic diffusion of any popular culture form.",
      "The student makes a vague or inaccurate statement about the geographic diffusion of one popular culture form.",
      "The student describes the geographic diffusion of one or two forms of popular culture with limited accuracy.",
      "The student describes the geographic diffusion of multiple forms of popular culture with reasonable accuracy.",
      "The student clearly explains the geographic diffusion of several popular culture forms, demonstrating a good understanding of the process.",
      "The student comprehensively explains the geographic diffusion of various popular culture forms, demonstrating a deep understanding of the factors and influences involved."
    ],
    [
      "The student fails to connect popular culture forms to the post-WWII era.",
      "The student makes a weak or inaccurate connection between a popular culture form and post-WWII America.",
      "The student mentions the post-WWII era in relation to popular culture but lacks specific details.",
      "The student makes a reasonable connection between multiple popular culture forms and the social or economic context of post-WWII America.",
      "The student clearly articulates the relationship between popular culture and the social and economic transformations of post-WWII America, providing supporting details.",
      "The student provides a nuanced and insightful analysis of how popular culture reflected and shaped the economic boom and social transformations of post-WWII America."
    ]
  ]
}