{
  "criteria": [
    "Geographic Structures: Understanding and comparing the influence of geography on the development of Meso-American and Andean civilizations.",
    "Political Structures: Analyzing and contrasting the political systems and forms of governance in Meso-American and Andean societies.",
    "Economic Structures: Evaluating and comparing the economic systems, trade networks, and resource management strategies of Meso-American and Andean civilizations.",
    "Religious Structures: Examining and contrasting the religious beliefs, practices, and their influence on Meso-American and Andean societies.",
    "Social Structures: Comparing and contrasting the social hierarchies, roles, and organization of Meso-American and Andean civilizations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No understanding of the geographic features and their impact is demonstrated.",
      "Demonstrates minimal understanding of the geographic features with little to no comparison.",
      "Identifies some geographic features of both regions but struggles to explain their influence or provide a comparison.",
      "Adequately describes the geographic features and their influence on each civilization and offers a basic comparison.",
      "Clearly explains the geographic features and their significant influence on the development of both civilizations, providing a detailed comparison.",
      "Demonstrates a comprehensive understanding of the nuanced relationship between geography and civilization development in both regions, offering insightful comparisons and contrasts."
    ],
    [
      "No understanding of the political structures is demonstrated.",
      "Demonstrates a minimal understanding of the political structures with no comparison.",
      "Identifies some political structures but struggles to explain their function or provide a comparison.",
      "Adequately describes the political structures of each civilization and offers a basic comparison.",
      "Clearly explains the political structures and their impact on both civilizations, providing a detailed comparison.",
      "Demonstrates a comprehensive understanding of the complexities of the political systems in both regions, offering insightful comparisons and contrasts."
    ],
    [
      "No understanding of the economic structures is demonstrated.",
      "Demonstrates a minimal understanding of the economic structures with no comparison.",
      "Identifies some economic aspects but struggles to explain their function or provide a comparison.",
      "Adequately describes the economic systems of each civilization and offers a basic comparison.",
      "Clearly explains the economic systems and their impact on both civilizations, providing a detailed comparison.",
      "Demonstrates a comprehensive understanding of the intricacies of the economic systems in both regions, offering insightful comparisons and contrasts, including long-term impacts."
    ],
    [
      "No understanding of the religious structures is demonstrated.",
      "Demonstrates a minimal understanding of the religious beliefs with no comparison.",
      "Identifies some religious elements but struggles to explain their function or provide a comparison.",
      "Adequately describes the religious aspects of each civilization and offers a basic comparison.",
      "Clearly explains the religious beliefs and their influence on both civilizations, providing a detailed comparison.",
      "Demonstrates a comprehensive understanding of the profound impact of religion on societal structures in both regions, offering insightful comparisons and contrasts."
    ],
    [
      "No understanding of the social structures is demonstrated.",
      "Demonstrates a minimal understanding of the social structures with no comparison.",
      "Identifies some social elements but struggles to explain their function or provide a comparison.",
      "Adequately describes the social structures of each civilization and offers a basic comparison.",
      "Clearly explains the social structures and their impact on both civilizations, providing a detailed comparison.",
      "Demonstrates a comprehensive understanding of the complexities of social organization and its effects on daily life in both regions, offering insightful comparisons and contrasts."
    ]
  ]
}