{
  "criteria": [
    "Understanding of Theodore Roosevelt's Big Stick Diplomacy",
    "Understanding of William Taft's Dollar Diplomacy",
    "Understanding of Woodrow Wilson's Moral Diplomacy",
    "Use of relevant speeches to support explanations"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of Theodore Roosevelt's Big Stick Diplomacy.",
      "Student demonstrates a minimal understanding of Theodore Roosevelt's Big Stick Diplomacy, with significant gaps in knowledge.",
      "Student demonstrates a basic understanding of Theodore Roosevelt's Big Stick Diplomacy, but struggles to explain its key components.",
      "Student demonstrates a satisfactory understanding of Theodore Roosevelt's Big Stick Diplomacy, explaining its main ideas with some clarity.",
      "Student demonstrates a strong understanding of Theodore Roosevelt's Big Stick Diplomacy, providing a clear and detailed explanation.",
      "Student demonstrates a comprehensive understanding of Theodore Roosevelt's Big Stick Diplomacy, providing insightful analysis and relevant examples."
    ],
    [
      "Student demonstrates no understanding of William Taft's Dollar Diplomacy.",
      "Student demonstrates a minimal understanding of William Taft's Dollar Diplomacy, with significant gaps in knowledge.",
      "Student demonstrates a basic understanding of William Taft's Dollar Diplomacy, but struggles to explain its key components.",
      "Student demonstrates a satisfactory understanding of William Taft's Dollar Diplomacy, explaining its main ideas with some clarity.",
      "Student demonstrates a strong understanding of William Taft's Dollar Diplomacy, providing a clear and detailed explanation.",
      "Student demonstrates a comprehensive understanding of William Taft's Dollar Diplomacy, providing insightful analysis and relevant examples."
    ],
    [
      "Student demonstrates no understanding of Woodrow Wilson's Moral Diplomacy.",
      "Student demonstrates a minimal understanding of Woodrow Wilson's Moral Diplomacy, with significant gaps in knowledge.",
      "Student demonstrates a basic understanding of Woodrow Wilson's Moral Diplomacy, but struggles to explain its key components.",
      "Student demonstrates a satisfactory understanding of Woodrow Wilson's Moral Diplomacy, explaining its main ideas with some clarity.",
      "Student demonstrates a strong understanding of Woodrow Wilson's Moral Diplomacy, providing a clear and detailed explanation.",
      "Student demonstrates a comprehensive understanding of Woodrow Wilson's Moral Diplomacy, providing insightful analysis and relevant examples."
    ],
    [
      "Student does not reference any relevant speeches.",
      "Student makes a minimal attempt to reference relevant speeches, but the connections are unclear or inaccurate.",
      "Student references relevant speeches, but struggles to connect them to the explanation of the diplomatic policies.",
      "Student appropriately uses relevant speeches to support the explanation of the diplomatic policies, but the analysis is limited.",
      "Student effectively uses relevant speeches to support the explanation of the diplomatic policies, providing clear and insightful analysis.",
      "Student skillfully integrates relevant speeches to provide a comprehensive and nuanced understanding of the diplomatic policies, demonstrating a deep understanding of the historical context."
    ]
  ]
}