{
  "criteria": [
    "Understanding the establishment and purpose of the United Nations (UN) and the International Declaration of Human Rights.",
    "Knowledge of the International Monetary Fund (IMF) and World Bank: their creation and roles.",
    "Understanding the General Agreement on Tariffs and Trade (GATT) and its importance.",
    "Analysis of the impact of these organizations on shaping modern Europe and maintaining peace and international order."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the UN's establishment or purpose, nor of the International Declaration of Human Rights.",
      "Student shows minimal understanding, with significant inaccuracies regarding the UN's formation or its core objectives and the Declaration of Human Rights.",
      "Student identifies the UN and the Declaration but struggles to accurately describe their establishment, purpose, or significance.",
      "Student adequately describes the establishment and main purposes of the UN and the Declaration, but lacks depth in explaining their historical context or long-term impact.",
      "Student clearly explains the establishment, purpose, and significance of the UN and the International Declaration of Human Rights, demonstrating a good understanding of their role in shaping international order.",
      "Student provides a comprehensive and insightful analysis of the UN's establishment, its evolving purposes, and the profound impact of the International Declaration of Human Rights on global governance and human rights standards."
    ],
    [
      "Student is unaware of the IMF and World Bank.",
      "Student vaguely recognizes the IMF and World Bank but cannot describe their origins or functions.",
      "Student identifies the IMF and World Bank and offers a limited description of their roles, but with some inaccuracies or omissions.",
      "Student accurately describes the establishment and primary functions of the IMF and World Bank, but does not delve into their complexities or criticisms.",
      "Student demonstrates a strong understanding of the IMF and World Bank, including their establishment, functions, and their impact on global economies and development.",
      "Student critically analyzes the IMF and World Bank, discussing their historical context, their intended roles, and their actual impact, including debates about their effectiveness and criticisms regarding their policies."
    ],
    [
      "Student demonstrates no understanding of GATT.",
      "Student has very limited awareness of GATT, showing confusion about its nature or purpose.",
      "Student identifies GATT but struggles to explain its purpose or significance.",
      "Student explains the basic function of GATT in promoting trade, but lacks detail about its mechanisms or evolution.",
      "Student clearly describes GATT's role in reducing trade barriers and promoting international trade, and its eventual transformation into the World Trade Organization (WTO).",
      "Student provides a comprehensive analysis of GATT, its historical context, its impact on global trade, and its evolution into the WTO, including a discussion of the debates and controversies surrounding trade liberalization."
    ],
    [
      "Student makes no attempt to connect the organizations to modern Europe, peace or international order.",
      "Student makes vague or unsubstantiated statements about the organizations' impact.",
      "Student identifies some connections between the organizations and modern Europe, peace, or international order, but lacks depth or supporting evidence.",
      "Student adequately explains how these organizations have contributed to shaping modern Europe and maintaining peace and international order, but does not explore complexities or alternative perspectives.",
      "Student offers a well-supported analysis of the organizations' influence on modern Europe, their role in maintaining peace, and their contribution to international order, citing specific examples.",
      "Student provides a nuanced and critical analysis of the organizations' complex and sometimes contradictory impact on shaping modern Europe, promoting peace, and fostering international order, considering multiple perspectives and potential drawbacks."
    ]
  ]
}