{
  "criteria": [
    "Understanding of Religious Pluralism",
    "Historical Context and Immigration",
    "Analysis and Critical Thinking",
    "Use of Evidence and Examples"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of religious pluralism in the U.S. and California.",
      "Shows a limited understanding of religious pluralism, with significant gaps.",
      "Displays a basic understanding of religious pluralism but struggles to connect it to immigration in the 20th century.",
      "Exhibits a satisfactory understanding of religious pluralism resulting from immigration, with minor inaccuracies.",
      "Demonstrates a strong understanding of religious pluralism and its connection to immigration, providing accurate details.",
      "Shows a comprehensive understanding of religious pluralism, its causes, and its effects, including nuanced details and insightful analysis."
    ],
    [
      "Fails to mention or understand the role of immigration in shaping religious diversity.",
      "Briefly mentions immigration but does not explain its impact on religious pluralism.",
      "Identifies immigration as a factor but lacks specific examples or details.",
      "Provides a general overview of how immigration contributed to religious pluralism in the U.S. and California.",
      "Explains the impact of immigration with specific examples of immigrant groups and their religious traditions.",
      "Offers a detailed analysis of how specific immigration waves influenced religious pluralism, including social and cultural impacts."
    ],
    [
      "Presents information without any analysis or critical thought.",
      "Offers limited analysis, mainly restating information.",
      "Attempts to analyze the information but lacks depth or critical insight.",
      "Analyzes the information effectively, drawing reasonable conclusions about the impact of immigration on religious pluralism.",
      "Demonstrates strong analytical skills, exploring various factors contributing to religious pluralism and their interconnections.",
      "Exhibits exceptional critical thinking, offering original insights and a nuanced understanding of the complexities of religious pluralism and immigration."
    ],
    [
      "Provides no evidence or examples to support claims.",
      "Uses vague or irrelevant examples.",
      "Offers some examples, but they are not well-explained or connected to the topic.",
      "Supports claims with relevant examples and evidence.",
      "Provides detailed and well-explained examples that strongly support claims.",
      "Uses a wide range of compelling evidence and examples to create a persuasive and insightful argument."
    ]
  ]
}