{
  "criteria": [
    "Understanding of Fair Play and Good Sportsmanship",
    "Respect for the Rights and Opinions of Others",
    "Respect for Rules and the 'Golden Rule'"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of fair play or good sportsmanship. Does not recognize the importance of these concepts.",
      "Demonstrates a limited understanding of fair play and good sportsmanship. Struggles to apply these concepts in real-world scenarios.",
      "Understands the basic principles of fair play and good sportsmanship. Can identify examples of these concepts but may struggle with nuanced situations.",
      "Demonstrates a solid understanding of fair play and good sportsmanship. Can consistently apply these concepts in most situations.",
      "Exhibits a strong understanding of fair play and good sportsmanship. Actively promotes these concepts and consistently applies them, even in challenging situations.",
      "Demonstrates an exceptional understanding of fair play and good sportsmanship. Serves as a role model for others, consistently demonstrating and promoting these principles with maturity and insight."
    ],
    [
      "Shows no respect for the rights and opinions of others. Dismisses or disregards differing viewpoints.",
      "Demonstrates limited respect for the rights and opinions of others. Struggles to listen to or acknowledge differing viewpoints.",
      "Acknowledges the rights and opinions of others but may struggle to understand or appreciate differing viewpoints.",
      "Demonstrates respect for the rights and opinions of others. Listens attentively and considers differing viewpoints.",
      "Actively respects the rights and opinions of others. Engages in respectful dialogue and seeks to understand differing viewpoints.",
      "Exhibits exceptional respect for the rights and opinions of others. Champions inclusivity and promotes respectful dialogue, creating a welcoming environment for diverse viewpoints."
    ],
    [
      "Shows no respect for rules or the 'Golden Rule'. Consistently disregards or violates established guidelines.",
      "Demonstrates limited respect for rules or the 'Golden Rule'. May struggle to follow established guidelines or understand the importance of reciprocity.",
      "Understands the basic principles of rules and the 'Golden Rule'. Can follow established guidelines but may struggle with nuanced situations or understanding the rationale behind them.",
      "Demonstrates respect for rules and the 'Golden Rule'. Consistently follows established guidelines and treats others as they would like to be treated.",
      "Actively respects and upholds rules and the 'Golden Rule'. Advocates for fair and ethical behavior and promotes understanding of the importance of these principles.",
      "Exhibits exceptional respect for rules and the 'Golden Rule'. Serves as a role model for ethical behavior and champions the principles of fairness, reciprocity, and integrity."
    ]
  ]
}