{
  "criteria": [
    "Understanding of the Declaration of Independence's Philosophy",
    "Analysis of Significant Events in the Founding of the Nation",
    "Evaluation of Attempts to Realize the Declaration's Philosophy"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the philosophical principles outlined in the Declaration of Independence.",
      "Shows a limited understanding of one or two philosophical principles from the Declaration of Independence.",
      "Identifies several philosophical principles but struggles to explain their significance or interrelation.",
      "Explains the key philosophical principles of the Declaration of Independence, such as natural rights, consent of the governed, and the right to revolution, with some clarity.",
      "Clearly explains the philosophical principles of the Declaration of Independence and analyzes their significance in the context of the American Revolution.",
      "Demonstrates a deep and nuanced understanding of the philosophical principles of the Declaration of Independence, analyzing their historical context, significance, and enduring influence on American political thought."
    ],
    [
      "Unable to identify any significant events related to the founding of the nation.",
      "Identifies one or two events with little explanation of their significance.",
      "Lists several events but provides limited analysis of their impact on the nation's founding.",
      "Describes several key events, such as the Continental Congress, the drafting of the Constitution, and the establishment of a national government, explaining their basic significance.",
      "Analyzes the causes and consequences of major events in the founding of the nation, demonstrating an understanding of their interrelation.",
      "Provides a comprehensive and insightful analysis of the significant events in the founding of the nation, evaluating their long-term impact and historical significance with supporting evidence."
    ],
    [
      "Shows no awareness of attempts to implement the ideals of the Declaration of Independence.",
      "Identifies one or two attempts with minimal understanding.",
      "Describes several attempts but struggles to evaluate their success or limitations.",
      "Explains how the Constitution and the Bill of Rights represent attempts to realize the philosophy of the Declaration of Independence.",
      "Evaluates the extent to which the founding generation succeeded in realizing the ideals of the Declaration, identifying both successes and shortcomings.",
      "Offers a nuanced and well-supported argument about the successes and failures of the founding generation in realizing the philosophy of the Declaration of Independence, considering diverse perspectives and historical context."
    ]
  ]
}