{
  "criteria": [
    "Understanding of Broken Treaties and Massacres",
    "Knowledge of Factors Leading to Indian Defeat",
    "Understanding of Indian Resistance to Encroachments and Assimilation",
    "Clarity and Accuracy of Information"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the impact of broken treaties and massacres on American Indian populations.",
      "Shows a minimal awareness of broken treaties and massacres, but lacks specific details or understanding of their consequences.",
      "Identifies broken treaties and massacres as negative events, but provides limited explanation of their role in the defeat of American Indians.",
      "Explains how broken treaties and massacres contributed to the challenges faced by American Indians, providing some supporting details.",
      "Analyzes the significant impact of specific broken treaties and massacres on American Indian communities, providing clear examples and explanations.",
      "Critically evaluates the long-term consequences of broken treaties and massacres on American Indian sovereignty, culture, and land ownership, demonstrating a comprehensive understanding."
    ],
    [
      "Shows no understanding of the factors that contributed to the defeat of American Indians.",
      "Identifies one or two factors vaguely, without providing context or explanation.",
      "Lists several factors that led to the Indians' defeat, but does not explain their significance or interrelation.",
      "Explains multiple factors, such as resistance, encroachment, and assimilation, and how they contributed to the Indians' defeat.",
      "Analyzes the complex interplay of factors, including military, political, economic, and social elements, that led to the Indians' defeat.",
      "Synthesizes a comprehensive explanation of the factors, demonstrating nuanced understanding of their relative importance and long-term effects."
    ],
    [
      "Demonstrates no awareness of Indian resistance to encroachment and assimilation.",
      "Mentions Indian resistance in passing, without providing details or examples.",
      "Identifies that Indian nations resisted encroachments and assimilation, but lacks specific examples.",
      "Describes the resistance of Indian nations to encroachments and assimilation, providing examples such as the Trail of Tears.",
      "Explains various forms of resistance, including armed conflict, political negotiation, and cultural preservation, with detailed examples.",
      "Evaluates the effectiveness and limitations of different forms of Indian resistance, demonstrating an understanding of the complex historical context."
    ],
    [
      "Presents information that is unclear, inaccurate, or irrelevant to the topic.",
      "Presents information that is partially accurate but lacks clarity and detail.",
      "Presents mostly accurate information with some clarity, but may contain minor errors or omissions.",
      "Presents clear and accurate information related to the topic, with supporting details.",
      "Presents well-organized, accurate, and detailed information that enhances understanding of the topic.",
      "Presents exceptionally clear, accurate, and insightful information that demonstrates a comprehensive understanding of the topic."
    ]
  ]
}