{
  "criteria": [
    "Identification of Key Figures and Events",
    "Analysis of the Constitution's Significance",
    "Understanding of Foundational Principles"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any key figures or events related to the development of the U.S. Constitution.",
      "Student identifies one key figure or event with significant inaccuracies.",
      "Student identifies one or two key figures and events but lacks detail or contains minor inaccuracies.",
      "Student identifies key figures and events such as James Madison, the Constitutional Convention, and the Federalist Papers, with reasonable accuracy but lacks depth.",
      "Student accurately identifies and describes several key figures and events and explains their roles in the Constitution's development.",
      "Student comprehensively identifies key figures and events, providing detailed and insightful explanations of their impact on the creation of the U.S. Constitution."
    ],
    [
      "Student does not attempt to analyze the significance of the Constitution.",
      "Student attempts to address the Constitution's significance but demonstrates a misunderstanding.",
      "Student offers a superficial explanation of the Constitution's significance with limited understanding.",
      "Student explains the Constitution's significance as the foundation of the American republic, touching on principles like separation of powers and checks and balances.",
      "Student analyzes the Constitution's significance, discussing its key principles and their impact on American governance and society.",
      "Student provides a sophisticated analysis of the Constitution's lasting significance, including its impact on American identity, governance, and its role in shaping modern democracy."
    ],
    [
      "Student demonstrates no understanding of the foundational principles of the Constitution.",
      "Student shows minimal awareness of the Constitution's principles but cannot articulate them clearly.",
      "Student identifies some of the Constitution's principles, such as democracy and representation, but struggles to explain their meaning.",
      "Student accurately identifies and explains foundational principles like federalism, individual rights, and the rule of law.",
      "Student demonstrates a strong understanding of the Constitution's foundational principles, explaining how they are embodied in its structure and function.",
      "Student provides an in-depth and nuanced understanding of the Constitution's foundational principles, relating them to contemporary issues and debates."
    ]
  ]
}