{
  "criteria": [
    "Understanding the Origins and Development of Slavery",
    "Analyzing the Effects of Slavery on Black Americans",
    "Analyzing the Effects of Slavery on the South's Development",
    "Identifying Strategies to Overturn or Preserve Slavery"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the origins and development of slavery in the American South.",
      "Shows a limited understanding of the origins or development of slavery, but not both.",
      "Displays a basic understanding of the origins and development of slavery, but lacks depth and detail.",
      "Demonstrates a solid understanding of the origins and development of slavery, including key factors and events.",
      "Exhibits a comprehensive understanding of the origins and development of slavery, including nuanced details and complexities.",
      "Shows an exceptional understanding of the origins and development of slavery, including its global context and long-term consequences."
    ],
    [
      "Demonstrates no understanding of the effects of slavery on Black Americans.",
      "Shows a limited awareness of one or two effects of slavery on Black Americans.",
      "Displays a basic understanding of several effects of slavery on Black Americans, but lacks specific examples.",
      "Demonstrates a solid understanding of the social, political, and economic effects of slavery on Black Americans, providing relevant examples.",
      "Exhibits a comprehensive analysis of the multifaceted effects of slavery on Black Americans, including cultural and psychological impacts.",
      "Shows an exceptional and insightful analysis of the long-lasting and intergenerational effects of slavery on Black Americans, connecting it to contemporary issues."
    ],
    [
      "Demonstrates no understanding of the effects of slavery on the South's political, social, religious, economic, and cultural development.",
      "Shows a limited awareness of one or two effects of slavery on the South's development.",
      "Displays a basic understanding of several effects of slavery on the South's development, but lacks specific examples.",
      "Demonstrates a solid understanding of how slavery shaped the South's political, social, religious, economic, and cultural landscape, providing relevant examples.",
      "Exhibits a comprehensive analysis of the interconnected effects of slavery on the South's development, including its impact on social structures and regional identity.",
      "Shows an exceptional and nuanced analysis of the ways in which slavery shaped the South's development, comparing it to other regions and considering alternative trajectories."
    ],
    [
      "Demonstrates no understanding of the strategies used to overturn or preserve slavery.",
      "Shows a limited awareness of one or two strategies used by either abolitionists or pro-slavery advocates.",
      "Displays a basic understanding of several strategies used to overturn or preserve slavery, but lacks specific details.",
      "Demonstrates a solid understanding of the key strategies used by both abolitionists and pro-slavery advocates, providing examples like Nat Turner and Denmark Vesey.",
      "Exhibits a comprehensive analysis of the diverse strategies employed to overturn or preserve slavery, including their motivations and effectiveness.",
      "Shows an exceptional and insightful understanding of the complex strategies used to overturn or preserve slavery, including their political, social, and economic contexts."
    ]
  ]
}