{
  "criteria": [
    "Understanding the Growth of Radio and Movies",
    "Analyzing the Effects of Radio and Movies",
    "Role in Worldwide Diffusion of Popular Culture"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the growth of radio and movies in the 1920s.",
      "Shows minimal understanding of the growth of radio and movies, with significant inaccuracies.",
      "Identifies some aspects of the growth of radio and movies but lacks depth and detail.",
      "Explains the basic growth of radio and movies in the 1920s with some supporting details.",
      "Clearly explains the growth of radio and movies, providing relevant details and examples.",
      "Provides a comprehensive explanation of the growth of radio and movies, including specific details and insightful observations."
    ],
    [
      "Demonstrates no understanding of the effects of radio and movies in the 1920s.",
      "Shows minimal understanding of the effects of radio and movies, with significant inaccuracies.",
      "Identifies some effects of radio and movies but lacks depth and detail.",
      "Explains the basic effects of radio and movies in the 1920s with some supporting details.",
      "Clearly explains the effects of radio and movies, providing relevant details and examples.",
      "Provides a comprehensive explanation of the effects of radio and movies, including specific details and insightful observations."
    ],
    [
      "Demonstrates no understanding of the role of radio and movies in the worldwide diffusion of popular culture.",
      "Shows minimal understanding of the role of radio and movies in the diffusion of popular culture, with significant inaccuracies.",
      "Identifies some aspects of the role of radio and movies in the diffusion of popular culture but lacks depth and detail.",
      "Explains the basic role of radio and movies in the diffusion of popular culture with some supporting details.",
      "Clearly explains the role of radio and movies in the diffusion of popular culture, providing relevant details and examples.",
      "Provides a comprehensive explanation of the role of radio and movies in the diffusion of popular culture, including specific details and insightful observations."
    ]
  ]
}