{
  "criteria": [
    "Understanding the role of government in providing for national defense.",
    "Understanding the role of government in addressing environmental concerns.",
    "Understanding the role of government in defining and enforcing property rights.",
    "Understanding the role of government in attempting to make markets more competitive.",
    "Understanding the role of government in protecting consumers' rights."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the government's role in national defense.",
      "Student demonstrates a minimal understanding of the government's role in national defense.",
      "Student demonstrates a basic understanding of the government's role in national defense, but lacks specific examples.",
      "Student demonstrates a satisfactory understanding of the government's role in national defense, providing general examples.",
      "Student demonstrates a strong understanding of the government's role in national defense, providing specific and relevant examples.",
      "Student demonstrates a comprehensive understanding of the government's role in national defense, providing insightful examples and analysis of its impact."
    ],
    [
      "Student demonstrates no understanding of the government's role in addressing environmental concerns.",
      "Student demonstrates a minimal understanding of the government's role in addressing environmental concerns.",
      "Student demonstrates a basic understanding of the government's role in addressing environmental concerns, but lacks specific examples.",
      "Student demonstrates a satisfactory understanding of the government's role in addressing environmental concerns, providing general examples.",
      "Student demonstrates a strong understanding of the government's role in addressing environmental concerns, providing specific and relevant examples.",
      "Student demonstrates a comprehensive understanding of the government's role in addressing environmental concerns, providing insightful examples and analysis of its impact."
    ],
    [
      "Student demonstrates no understanding of the government's role in defining and enforcing property rights.",
      "Student demonstrates a minimal understanding of the government's role in defining and enforcing property rights.",
      "Student demonstrates a basic understanding of the government's role in defining and enforcing property rights, but lacks specific examples.",
      "Student demonstrates a satisfactory understanding of the government's role in defining and enforcing property rights, providing general examples.",
      "Student demonstrates a strong understanding of the government's role in defining and enforcing property rights, providing specific and relevant examples.",
      "Student demonstrates a comprehensive understanding of the government's role in defining and enforcing property rights, providing insightful examples and analysis of its impact."
    ],
    [
      "Student demonstrates no understanding of the government's role in promoting competitive markets.",
      "Student demonstrates a minimal understanding of the government's role in promoting competitive markets.",
      "Student demonstrates a basic understanding of the government's role in promoting competitive markets, but lacks specific examples.",
      "Student demonstrates a satisfactory understanding of the government's role in promoting competitive markets, providing general examples.",
      "Student demonstrates a strong understanding of the government's role in promoting competitive markets, providing specific and relevant examples.",
      "Student demonstrates a comprehensive understanding of the government's role in promoting competitive markets, providing insightful examples and analysis of its impact."
    ],
    [
      "Student demonstrates no understanding of the government's role in protecting consumers' rights.",
      "Student demonstrates a minimal understanding of the government's role in protecting consumers' rights.",
      "Student demonstrates a basic understanding of the government's role in protecting consumers' rights, but lacks specific examples.",
      "Student demonstrates a satisfactory understanding of the government's role in protecting consumers' rights, providing general examples.",
      "Student demonstrates a strong understanding of the government's role in protecting consumers' rights, providing specific and relevant examples.",
      "Student demonstrates a comprehensive understanding of the government's role in protecting consumers' rights, providing insightful examples and analysis of its impact."
    ]
  ]
}