{
  "criteria": [
    "Identification of Key Leaders",
    "Description of Actions and Strategies",
    "Understanding of Diverse Approaches"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any leaders of the abolition movement.",
      "Student identifies one leader of the abolition movement but provides no description of their actions.",
      "Student identifies at least two leaders and provides a minimal description of their actions and roles in the movement.",
      "Student identifies at least three leaders and describes their actions with some detail, showing a basic understanding of their contributions.",
      "Student identifies several key leaders and accurately describes their specific actions, roles, and contributions to the abolition movement, demonstrating a solid understanding.",
      "Student comprehensively identifies numerous key leaders, providing detailed and insightful descriptions of their actions, roles, strategies, and profound impact on the abolition movement, demonstrating mastery."
    ],
    [
      "Student does not describe any actions or strategies used by leaders of the abolition movement.",
      "Student vaguely mentions actions or strategies, but details are lacking.",
      "Student describes actions or strategies of abolitionist leaders, but the descriptions are superficial and lack depth.",
      "Student adequately describes the actions and strategies employed by various leaders, demonstrating a general understanding of their methods.",
      "Student thoroughly describes the actions and strategies, providing specific examples and explaining the effectiveness and challenges of their approaches.",
      "Student provides an exceptional analysis of the actions and strategies, including nuanced explanations of their impacts, adaptations, and long-term consequences within the broader context of the abolition movement."
    ],
    [
      "Student shows no awareness of the variety of approaches within the abolition movement.",
      "Student acknowledges only one approach to abolition.",
      "Student mentions different approaches but does not demonstrate a clear understanding of their differences.",
      "Student describes different approaches to abolition (e.g., political, direct action, writing) and identifies leaders associated with each.",
      "Student analyzes the diverse approaches to abolition, comparing and contrasting their effectiveness, ethical considerations, and impacts on different segments of society.",
      "Student offers a sophisticated evaluation of the strategic choices within the abolition movement, explaining how various approaches intersected, complemented, or conflicted with one another, ultimately shaping the course of history."
    ]
  ]
}