{
  "criteria": [
    "Understanding of Industrialization's Impact on Living Conditions",
    "Understanding of Industrialization's Impact on Working Conditions",
    "Knowledge of Upton Sinclair's \"The Jungle\" and its Portrayal of Working Conditions and Food Safety"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the effects of industrialization on living conditions.",
      "Shows minimal understanding of the effects of industrialization on living conditions.",
      "Identifies a few effects of industrialization on living conditions, but lacks depth.",
      "Describes several effects of industrialization on living conditions with some detail.",
      "Explains the effects of industrialization on living conditions with clear examples and supporting details.",
      "Provides a comprehensive analysis of the effects of industrialization on living conditions, demonstrating insightful understanding and nuanced perspectives."
    ],
    [
      "Demonstrates no understanding of the effects of industrialization on working conditions.",
      "Shows minimal understanding of the effects of industrialization on working conditions.",
      "Identifies a few effects of industrialization on working conditions, but lacks depth.",
      "Describes several effects of industrialization on working conditions with some detail.",
      "Explains the effects of industrialization on working conditions with clear examples and supporting details.",
      "Provides a comprehensive analysis of the effects of industrialization on working conditions, demonstrating insightful understanding and nuanced perspectives."
    ],
    [
      "Shows no familiarity with Upton Sinclair's \"The Jungle\".",
      "Mentions Upton Sinclair's \"The Jungle\" but demonstrates little understanding of its content.",
      "Identifies \"The Jungle\" as related to working conditions or food safety, but lacks specifics.",
      "Describes the working conditions OR food safety issues portrayed in \"The Jungle\" with some accuracy.",
      "Explains the portrayal of BOTH working conditions AND food safety issues in \"The Jungle\" with relevant details.",
      "Analyzes the impact of Upton Sinclair's \"The Jungle\" on public awareness and reform efforts related to working conditions and food safety, demonstrating a thorough understanding of the novel's significance."
    ]
  ]
}