{
  "criteria": [
    "Understanding of Artistic Traditions: Demonstrates knowledge of the artistic expressions unique to Meso-American and Andean civilizations.",
    "Knowledge of Oral Traditions: Demonstrates comprehension of the significance and content of oral traditions in these civilizations.",
    "Identification and Analysis of Architectural Styles: Recognizes and analyzes key architectural features and their cultural significance.",
    "Comparative Analysis: Effectively compares and contrasts the artistic, oral, and architectural traditions across the three civilizations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of artistic traditions in Meso-American and Andean civilizations.",
      "Demonstrates a minimal understanding of artistic traditions, with significant inaccuracies or omissions.",
      "Identifies some artistic traditions but lacks depth and detail in explanations. May confuse or conflate different civilizations.",
      "Describes several artistic traditions from at least two civilizations, providing basic context and explanation.",
      "Explains multiple artistic traditions with considerable detail, providing insights into their cultural significance within each civilization. Demonstrates good comparative analysis.",
      "Provides a comprehensive and nuanced analysis of artistic traditions, demonstrating a sophisticated understanding of their cultural, religious, and social contexts. Offers insightful comparisons and contrasts."
    ],
    [
      "Shows no understanding of oral traditions in Meso-American and Andean civilizations.",
      "Demonstrates a minimal understanding of oral traditions, with significant inaccuracies or omissions.",
      "Identifies some oral traditions but lacks depth and detail in explanations. May confuse or conflate different civilizations.",
      "Describes several oral traditions from at least two civilizations, providing basic context and explanation.",
      "Explains multiple oral traditions with considerable detail, providing insights into their cultural significance within each civilization. Demonstrates good comparative analysis.",
      "Provides a comprehensive and nuanced analysis of oral traditions, demonstrating a sophisticated understanding of their role in preserving history, culture, and beliefs. Offers insightful comparisons and contrasts."
    ],
    [
      "Shows no understanding of architectural styles in Meso-American and Andean civilizations.",
      "Demonstrates a minimal understanding of architectural styles, with significant inaccuracies or omissions.",
      "Identifies some architectural features but lacks depth and detail in explanations. May confuse or conflate different civilizations.",
      "Describes several architectural styles from at least two civilizations, providing basic context and explanation.",
      "Explains multiple architectural styles with considerable detail, providing insights into their cultural significance within each civilization. Demonstrates good comparative analysis.",
      "Provides a comprehensive and nuanced analysis of architectural styles, demonstrating a sophisticated understanding of their engineering, aesthetic, and symbolic aspects. Offers insightful comparisons and contrasts."
    ],
    [
      "Does not attempt to compare or contrast traditions across civilizations.",
      "Offers superficial or inaccurate comparisons and contrasts.",
      "Presents some comparisons and contrasts but lacks depth and specific examples.",
      "Compares and contrasts several aspects of the traditions, identifying both similarities and differences.",
      "Provides detailed and insightful comparisons and contrasts, highlighting key distinctions and commonalities with supporting evidence.",
      "Demonstrates a sophisticated understanding of the nuances in artistic, oral, and architectural traditions, offering compelling and well-supported comparative analysis."
    ]
  ]
}