{
  "criteria": [
    "Understanding of the Causes of the Great Depression",
    "Knowledge of Actions Taken by the Federal Reserve and Congress",
    "Understanding of Presidential Actions (Hoover & Roosevelt)",
    "Analysis of the New Deal's Impact on the Federal Government's Role"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes of the Great Depression.",
      "Identifies one or two causes of the Great Depression with limited accuracy.",
      "Identifies several causes of the Great Depression but lacks depth in explanation.",
      "Explains multiple causes of the Great Depression with some accuracy and detail.",
      "Thoroughly explains the primary causes of the Great Depression, demonstrating a strong understanding of their interconnectedness.",
      "Provides a comprehensive and nuanced explanation of the causes of the Great Depression, including underlying factors and historical context."
    ],
    [
      "Shows no awareness of actions taken by the Federal Reserve or Congress during the Great Depression.",
      "Mentions the Federal Reserve or Congress but provides no specific actions they took.",
      "Identifies one or two actions taken by either the Federal Reserve or Congress with limited detail.",
      "Describes several actions taken by the Federal Reserve and Congress to combat the economic crisis.",
      "Explains the actions of both the Federal Reserve and Congress in detail, including their intended effects and limitations.",
      "Critically analyzes the effectiveness of the actions taken by the Federal Reserve and Congress, considering alternative perspectives and long-term consequences."
    ],
    [
      "Demonstrates no knowledge of the actions taken by Presidents Hoover and Roosevelt during the Great Depression.",
      "Mentions Hoover or Roosevelt but provides no specific actions they took.",
      "Identifies one or two actions taken by either Hoover or Roosevelt with limited detail.",
      "Describes several actions taken by both Hoover and Roosevelt to combat the economic crisis.",
      "Explains the actions of both Hoover and Roosevelt in detail, including the context in which they were taken and their immediate impact.",
      "Compares and contrasts the approaches of Hoover and Roosevelt, evaluating their effectiveness and considering the political and social factors that influenced their decisions."
    ],
    [
      "Shows no understanding of how the New Deal changed the role of the federal government.",
      "States that the New Deal changed the federal government's role but provides no specific examples.",
      "Identifies one or two ways in which the New Deal changed the federal government's role.",
      "Explains several ways in which the New Deal fundamentally changed the role of the federal government.",
      "Analyzes the significant changes brought about by the New Deal, demonstrating a clear understanding of the expanded role of the federal government in the economy and society.",
      "Evaluates the long-term consequences of the New Deal on the size, scope, and power of the federal government, considering both positive and negative impacts."
    ]
  ]
}