{
  "criteria": [
    "Understanding of Causes and Motivations: Assesses the student's comprehension of the various factors that led to the American Revolution, including political, economic, and social motivations of colonists and the British.",
    "Knowledge of Key Events and Figures: Evaluates the student's familiarity with significant events, battles, and individuals involved in the American Revolution.",
    "Analysis of Consequences and Impacts: Assesses the student's ability to analyze the short-term and long-term effects of the American Revolution on American society, politics, and the world.",
    "Understanding of Ideals and Principles: Evaluates the student's comprehension of the core ideals and principles that shaped the American Revolution, such as liberty, equality, and self-government."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the causes or motivations behind the American Revolution.",
      "Shows minimal awareness of one or two causes, but lacks depth and accuracy.",
      "Identifies several causes and motivations, but explanation lacks detail and may contain inaccuracies.",
      "Explains most of the major causes and motivations with reasonable accuracy and some detail.",
      "Provides a thorough explanation of the key causes and motivations, demonstrating a solid understanding of their complexities.",
      "Offers a comprehensive and insightful analysis of the causes and motivations, including nuanced perspectives and connections between different factors."
    ],
    [
      "Unable to identify any key events or figures from the American Revolution.",
      "Identifies one or two events or figures, but lacks context or significance.",
      "Names several events and figures, but explanation is superficial and may contain errors.",
      "Accurately describes most of the major events and figures and their roles in the Revolution.",
      "Demonstrates a strong knowledge of key events and figures, providing detailed and accurate descriptions.",
      "Exhibits an in-depth understanding of the events and figures, including lesser-known details and their broader historical significance."
    ],
    [
      "Shows no awareness of the consequences or impacts of the American Revolution.",
      "Offers a vague or inaccurate statement about one or two consequences.",
      "Identifies several consequences, but lacks analysis or depth.",
      "Explains most of the major consequences and impacts with reasonable accuracy.",
      "Provides a thorough analysis of the consequences and impacts, demonstrating a strong understanding of their significance.",
      "Offers a comprehensive and insightful analysis of the consequences, including their long-term implications and connections to contemporary issues."
    ],
    [
      "Demonstrates no understanding of the ideals or principles underlying the American Revolution.",
      "Identifies one or two ideals, but lacks context or explanation.",
      "Names several ideals and principles, but explanation is superficial and may contain inaccuracies.",
      "Accurately describes most of the major ideals and principles and their relevance to the Revolution.",
      "Demonstrates a strong understanding of the ideals and principles, providing detailed and accurate explanations.",
      "Exhibits an in-depth understanding of the ideals and principles, including their philosophical roots and lasting impact on American society."
    ]
  ]
}