{
  "criteria": [
    "Identification and Location of Major River Systems",
    "Description of Physical Settings and Support for Settlement"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student cannot identify or locate any of the major river systems of Mesopotamia, Egypt, and Kush.",
      "Student can identify at least one major river system but struggles to accurately locate it on a map or describe its geographical context.",
      "Student can identify and roughly locate two major river systems but shows limited understanding of their geographical significance.",
      "Student can accurately identify and locate the major river systems of Mesopotamia (Tigris and Euphrates) or Egypt (Nile) and Kush (Nile), and begins to describe their geographical context.",
      "Student can accurately identify, locate, and describe the major river systems of Mesopotamia, Egypt, and Kush, explaining their geographical context with some detail.",
      "Student demonstrates a comprehensive understanding of the major river systems of Mesopotamia, Egypt, and Kush, accurately locating them, describing their geographical context, and explaining their significance to the development of early civilizations with insightful detail."
    ],
    [
      "Student cannot describe any physical settings or explain how they supported permanent settlement in Mesopotamia, Egypt, or Kush.",
      "Student attempts to describe physical settings but struggles to connect them to the support of permanent settlement.",
      "Student describes basic physical settings in at least one civilization but provides a limited explanation of their role in supporting settlement.",
      "Student describes the physical settings of Mesopotamia, Egypt, or Kush, and explains how they supported permanent settlement, including factors like water availability and fertile land.",
      "Student describes the physical settings of Mesopotamia, Egypt, and Kush, explaining how they supported permanent settlement by detailing the interaction between geographical features and early civilizations.",
      "Student provides an in-depth analysis of the physical settings of Mesopotamia, Egypt, and Kush, explaining how they supported permanent settlement and early civilizations, and makes connections between the environment and the development of societal structures and agriculture."
    ]
  ]
}