{
  "criteria": [
    "Identification of Sources and Beliefs: Demonstrates the ability to identify the primary sources of Jewish ethical teachings and central beliefs (Hebrew Bible, Commentaries) and accurately describe these beliefs.",
    "Understanding of Ethical Concepts: Shows comprehension of the ethical concepts of righteousness and justice within Judaism and their practical application.",
    "Reflection in Western Civilization: Demonstrates an understanding of how Hebrew traditions and ideas are reflected in the moral and ethical traditions of Western civilization."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Does not identify or inaccurately identifies the sources of Jewish ethical teachings and central beliefs.",
      "Identifies at least one source, but descriptions of beliefs are missing or largely inaccurate.",
      "Identifies the Hebrew Bible and\/or Commentaries as sources and provides limited descriptions of Jewish beliefs.",
      "Identifies both the Hebrew Bible and Commentaries and provides basic descriptions of key Jewish beliefs (belief in God, observance of law).",
      "Accurately identifies both sources and provides detailed descriptions of key Jewish beliefs, including righteousness, justice, and the importance of study.",
      "Provides a comprehensive identification of sources, detailed descriptions of beliefs, and insightful connections between these beliefs and their origins."
    ],
    [
      "Demonstrates no understanding of the ethical concepts of righteousness and justice.",
      "Demonstrates minimal understanding; concepts are vaguely or inaccurately defined.",
      "Provides a superficial definition of righteousness and\/or justice within Judaism.",
      "Describes righteousness and justice and gives a simple example of their application in Jewish tradition.",
      "Explains the concepts of righteousness and justice with clear examples from Jewish law or teachings.",
      "Offers a nuanced explanation of righteousness and justice, including historical context and diverse interpretations within Judaism."
    ],
    [
      "Fails to connect Hebrew traditions to Western civilization's moral or ethical traditions.",
      "Makes a vague or unsubstantiated claim about the influence of Hebrew traditions.",
      "Identifies a general connection between Hebrew traditions and Western values but lacks specific examples.",
      "Provides a specific example of how Hebrew traditions influenced Western ethics or morals.",
      "Offers several well-supported examples of Hebrew traditions influencing Western civilization, demonstrating a clear understanding of the relationship.",
      "Analyzes the complex relationship between Hebrew traditions and Western civilization, discussing both direct influences and adaptations over time."
    ]
  ]
}