{
  "criteria": [
    "Understanding of the concept of political borders and territorial sovereignty",
    "Ability to analyze the changing role of international political borders.",
    "Ability to explain the impact of a global economy on political borders and territorial sovereignty."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of political borders or territorial sovereignty.",
      "Student demonstrates a very limited understanding of political borders or territorial sovereignty.",
      "Student demonstrates a basic understanding of political borders and territorial sovereignty but struggles to explain their role in a global economy.",
      "Student demonstrates a satisfactory understanding of political borders and territorial sovereignty and can explain their role in a global economy with some limitations.",
      "Student demonstrates a strong understanding of political borders and territorial sovereignty and can explain their evolving role in a global economy with clear examples.",
      "Student demonstrates a comprehensive understanding of political borders and territorial sovereignty, their historical context, and their complex and changing role in a global economy with insightful examples and analysis."
    ],
    [
      "Student cannot analyze the changing role of international political borders.",
      "Student attempts to analyze the changing role of international political borders but the analysis is superficial and inaccurate.",
      "Student provides a limited analysis of the changing role of international political borders, with some inaccuracies.",
      "Student analyzes the changing role of international political borders with reasonable accuracy and provides some supporting details.",
      "Student provides a thorough and accurate analysis of the changing role of international political borders, supported by relevant evidence.",
      "Student provides a sophisticated and insightful analysis of the changing role of international political borders, demonstrating a nuanced understanding of the complexities involved."
    ],
    [
      "Student cannot explain how a global economy impacts political borders and territorial sovereignty.",
      "Student attempts to explain the impact of a global economy but demonstrates significant misunderstandings.",
      "Student provides a basic explanation of the impact of a global economy but struggles to provide supporting details or examples.",
      "Student explains how a global economy impacts political borders and territorial sovereignty with reasonable clarity and provides some supporting details.",
      "Student clearly explains how a global economy impacts political borders and territorial sovereignty, using relevant examples and demonstrating a solid understanding of the interconnectedness.",
      "Student provides a detailed and insightful explanation of how a global economy impacts political borders and territorial sovereignty, demonstrating a nuanced understanding of cause-and-effect relationships and potential future implications."
    ]
  ]
}