{
  "criteria": [
    "Understanding of the historical context of the free press in the United States and its evolution.",
    "Ability to identify and explain the core functions of a free press in a democratic society.",
    "Comprehension of the responsibilities that accompany the freedoms granted to the press, including ethical considerations.",
    "Ability to analyze contemporary examples of the free press in action and assess their impact on public discourse and civic engagement."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context or evolution of the free press.",
      "Shows a limited or inaccurate understanding of the historical context and evolution of the free press.",
      "Displays a basic understanding of the historical context but struggles with explaining its evolution.",
      "Demonstrates a satisfactory understanding of the historical context and can describe the evolution of the free press with some gaps.",
      "Exhibits a strong understanding of the historical context and clearly explains the evolution of the free press with relevant examples.",
      "Demonstrates a comprehensive and nuanced understanding of the historical context, providing insightful analysis of the free press's evolution and its impact on American society."
    ],
    [
      "Cannot identify or explain any of the core functions of a free press.",
      "Identifies one or two core functions with minimal explanation.",
      "Identifies several core functions but provides superficial explanations.",
      "Explains most of the core functions of a free press, demonstrating a general understanding.",
      "Clearly explains all the core functions of a free press, demonstrating a strong understanding of their importance.",
      "Articulates the core functions of a free press with exceptional clarity, providing insightful examples of their application and significance in maintaining a healthy democracy."
    ],
    [
      "Shows no awareness of the responsibilities or ethical considerations of a free press.",
      "Demonstrates a limited awareness of the responsibilities or ethical considerations.",
      "Acknowledges the existence of responsibilities but struggles to articulate them or connect them to ethical considerations.",
      "Explains some of the key responsibilities and ethical considerations of a free press with reasonable accuracy.",
      "Clearly articulates the responsibilities of the free press and explains the ethical considerations involved in responsible journalism.",
      "Demonstrates a sophisticated understanding of the complex ethical dilemmas faced by the free press, offering nuanced perspectives on how to balance freedom with responsibility."
    ],
    [
      "Unable to analyze or provide relevant examples of the free press in action.",
      "Provides simplistic or irrelevant examples with no analysis.",
      "Presents contemporary examples but struggles to analyze their impact on public discourse.",
      "Analyzes contemporary examples with some understanding of their impact on public discourse and civic engagement.",
      "Provides well-chosen examples and insightful analysis of their impact on public discourse and civic engagement.",
      "Critically analyzes contemporary examples with exceptional insight, offering nuanced perspectives on the role of the free press in shaping public opinion and fostering informed civic engagement."
    ]
  ]
}