{
  "criteria": [
    "Accuracy and Completeness of Historical Information: Assessing the student's grasp of key events, dates, and figures related to the westward expansion of the United States, including California, Texas, and Oregon.",
    "Understanding of Causes and Significance: Evaluating the student's ability to explain the underlying causes and the broader significance of events like the Texas War for Independence and the Mexican-American War.",
    "Connection to Overarching Standard: Assessing the student's ability to connect specific events and details to the broader themes of colonization, immigration, settlement patterns, and the role of economic incentives, physical\/political geography, and transportation systems."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding or provides inaccurate information about the historical context of westward expansion.",
      "Shows minimal understanding with significant inaccuracies or omissions in describing key events and figures.",
      "Presents a basic understanding but lacks depth, with some inaccuracies or omissions in key details.",
      "Accurately describes the main events and figures with a reasonable level of detail, showing a solid understanding of the historical context.",
      "Demonstrates a comprehensive understanding, providing accurate and detailed information with few omissions.",
      "Exhibits mastery of the historical context, providing nuanced, accurate, and comprehensive details, demonstrating an in-depth understanding."
    ],
    [
      "Unable to identify or explain the causes or significance of the Texas War for Independence and the Mexican-American War.",
      "Attempts to explain causes and significance but demonstrates significant misunderstandings or oversimplifications.",
      "Identifies some causes and aspects of significance but lacks depth in explanation or omits crucial factors.",
      "Clearly explains the primary causes and significance, providing a solid understanding of their impact.",
      "Explores the causes and significance in detail, offering insights into the complexities and long-term effects.",
      "Provides a sophisticated analysis of the causes and significance, exploring nuanced perspectives and demonstrating exceptional insight."
    ],
    [
      "Fails to connect the specific events to the broader themes of the overarching standard.",
      "Attempts to connect events to broader themes but demonstrates a weak understanding of the relationships.",
      "Makes some connections between events and themes, but the connections are superficial or lack clear explanation.",
      "Effectively connects specific events to the broader themes, demonstrating an understanding of their interrelation.",
      "Explores the connections in depth, demonstrating a nuanced understanding of how specific events fit into the larger historical narrative.",
      "Synthesizes events and themes to create a comprehensive and insightful narrative, demonstrating mastery of the overarching standard."
    ]
  ]
}