{
  "criteria": [
    "Understanding of U.S. Boundary Changes and Relationships",
    "Influence on Westward Expansion and the Mexican-American War",
    "Historical Accuracy and Use of Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of U.S. boundary changes or relationships with neighbors and Europe.",
      "Demonstrates a minimal understanding of U.S. boundary changes or relationships with neighbors and Europe.",
      "Identifies some U.S. boundary changes and relationships with neighbors and Europe but lacks detail.",
      "Describes U.S. boundary changes and relationships with neighbors (Mexico and Canada) and Europe with some accuracy.",
      "Explains U.S. boundary changes and relationships with neighbors and Europe, including the Monroe Doctrine, with good accuracy and detail.",
      "Analyzes U.S. boundary changes and relationships with neighbors and Europe, including the Monroe Doctrine, demonstrating a comprehensive understanding of the topic."
    ],
    [
      "Shows no understanding of how relationships influenced westward expansion and the Mexican-American War.",
      "Shows a minimal understanding of how relationships influenced westward expansion and the Mexican-American War.",
      "Identifies some connections between relationships and westward expansion\/Mexican-American War, but lacks explanation.",
      "Describes how U.S. relationships influenced westward expansion and the Mexican-American War with some accuracy.",
      "Explains how U.S. relationships, including the Monroe Doctrine, influenced westward expansion and the Mexican-American War with good accuracy and detail.",
      "Analyzes how U.S. relationships, including the Monroe Doctrine, influenced westward expansion and the Mexican-American War, demonstrating a comprehensive understanding of the topic and its complexities."
    ],
    [
      "Presents inaccurate information with no evidence.",
      "Presents mostly inaccurate information with very little evidence.",
      "Presents some accurate information but lacks sufficient evidence.",
      "Presents mostly accurate information with some supporting evidence.",
      "Presents accurate information with relevant and sufficient evidence.",
      "Presents accurate information with compelling and well-analyzed evidence, demonstrating a deep understanding of historical sources."
    ]
  ]
}