{
  "criteria": [
    "Understanding the Shift in Global Power Dynamics",
    "Knowledge of Historical Events and Context",
    "Analysis of Contributing Factors"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the roles of Great Britain and the United States after World War II.",
      "Shows a limited understanding of either Great Britain's declining role or the United States' expanding role, but not both.",
      "Identifies the declining role of Great Britain and the expanding role of the United States, but lacks specific details or supporting evidence.",
      "Explains the declining role of Great Britain and the expanding role of the United States with some specific details, but may have minor inaccuracies or omissions.",
      "Clearly explains the declining role of Great Britain and the expanding role of the United States with accurate and relevant details and examples.",
      "Provides a comprehensive explanation of the shift in global power dynamics, including insightful analysis of the factors contributing to the decline of Great Britain and the rise of the United States."
    ],
    [
      "Displays no knowledge of the historical events and context surrounding the shift in global power.",
      "Shows minimal knowledge of relevant historical events or context.",
      "Identifies some historical events related to the shift in power but struggles to connect them to the broader context.",
      "Discusses relevant historical events and context with some accuracy, but may have gaps in knowledge or understanding.",
      "Demonstrates a strong understanding of the historical events and context, providing accurate details and relevant information.",
      "Exhibits a thorough and nuanced understanding of the historical events and context, connecting them to broader themes and implications of the power shift."
    ],
    [
      "Offers no analysis of the factors that contributed to the declining role of Great Britain and the expanding role of the United States.",
      "Provides a superficial analysis of only one or two contributing factors.",
      "Identifies several factors that contributed to the power shift but lacks depth or supporting evidence.",
      "Analyzes some of the key factors with reasonable depth and provides some supporting evidence.",
      "Offers a well-supported analysis of the major factors contributing to the decline of Great Britain and the rise of the United States.",
      "Presents a comprehensive and insightful analysis of the complex interplay of factors contributing to the shift in global power, demonstrating critical thinking and nuanced understanding."
    ]
  ]
}