{
  "criteria": [
    "Understanding of the Agrarian Economy's Development",
    "Identification of Cotton-Producing States",
    "Significance of Cotton and the Cotton Gin"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the agrarian economy's development in the South.",
      "Shows minimal understanding of the agrarian economy with significant misconceptions.",
      "Displays basic understanding of the agrarian economy's development, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the agrarian economy's development in the South.",
      "Shows a strong understanding of the agrarian economy's development, including key factors and changes over time.",
      "Exhibits a comprehensive understanding of the agrarian economy's development, including nuances and complexities."
    ],
    [
      "Cannot identify any cotton-producing states.",
      "Identifies only one or two cotton-producing states with inaccuracies.",
      "Identifies some cotton-producing states, but misses key states or makes some errors.",
      "Identifies most of the major cotton-producing states.",
      "Accurately identifies the major cotton-producing states and their geographic locations.",
      "Accurately identifies the major cotton-producing states, their geographic locations, and explains regional variations in cotton production."
    ],
    [
      "Does not understand the significance of cotton or the cotton gin.",
      "Shows minimal understanding of the significance of cotton and the cotton gin with significant misconceptions.",
      "Explains the significance of cotton and the cotton gin in a limited way, lacking detail.",
      "Demonstrates a satisfactory understanding of the significance of cotton and the cotton gin in the South's economy.",
      "Shows a strong understanding of the significance of cotton and the cotton gin, including their impact on society and the economy.",
      "Exhibits a comprehensive understanding of the significance of cotton and the cotton gin, including their long-term consequences and connections to other historical events."
    ]
  ]
}