{
  "criteria": [
    "Understanding of Civil Society's Influence on Government",
    "Clarity and Precision of Explanation",
    "Use of Examples and Supporting Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how civil society can influence government beyond voting.",
      "Shows a limited understanding of civil society and its potential influence, primarily focused on voting.",
      "Identifies civil society and mentions one or two ways it can influence government, but lacks depth in explanation.",
      "Explains several ways civil society can influence government (e.g., lobbying, advocacy groups, protests) with some supporting details.",
      "Clearly explains multiple ways civil society influences government, providing relevant examples and explaining their impact.",
      "Provides a comprehensive explanation of how civil society influences government, including diverse methods, detailed examples, and analysis of their effectiveness."
    ],
    [
      "Explanation is unclear, disorganized, and difficult to understand.  Contains significant inaccuracies.",
      "Explanation is somewhat unclear and disorganized, with several inaccuracies.",
      "Explanation is understandable but lacks clarity and precision. Some inaccuracies are present.",
      "Explanation is generally clear and precise, with minor areas for improvement. Few inaccuracies.",
      "Explanation is clear, precise, and well-organized. Information is accurate and effectively communicated.",
      "Explanation is exceptionally clear, precise, and insightful. Demonstrates a mastery of the subject matter with no inaccuracies."
    ],
    [
      "Provides no examples or supporting evidence.",
      "Attempts to provide examples, but they are irrelevant or inaccurate.",
      "Provides one or two basic examples with limited supporting details.",
      "Provides several relevant examples with some supporting details.",
      "Provides multiple, well-chosen examples with clear and relevant supporting evidence.",
      "Provides a wide range of compelling examples and detailed supporting evidence, demonstrating a deep understanding of the topic."
    ]
  ]
}