{
  "criteria": [
    "Understanding of the historical context of women's roles",
    "Explanation of women's increased participation in the labor force",
    "Description of changes in family structure",
    "Analysis of the impact of changing roles on society"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the historical context or previous roles of women in society.",
      "Demonstrates a very limited understanding of the historical context, with significant gaps in knowledge.",
      "Demonstrates a basic understanding of the historical context, but lacks depth and detail.",
      "Demonstrates a satisfactory understanding of the historical context, including previous roles and societal expectations.",
      "Demonstrates a strong understanding of the historical context, including nuanced aspects of women's roles and societal expectations.",
      "Demonstrates a comprehensive and insightful understanding of the historical context, including in-depth knowledge of previous roles, societal expectations, and their evolution."
    ],
    [
      "Fails to explain the reasons for women's increased entry into the labor force.",
      "Provides a superficial explanation with limited detail and accuracy.",
      "Offers a basic explanation but misses some key factors contributing to the change.",
      "Explains the primary reasons for increased participation, such as economic necessity or changing social attitudes.",
      "Provides a detailed explanation of the various factors influencing women's increased participation, including economic, social, and political aspects.",
      "Offers a comprehensive and insightful analysis of the multifaceted factors driving women's increased participation, including historical context and long-term effects."
    ],
    [
      "Does not describe any changes in family structure.",
      "Provides a vague and inaccurate description of family structure changes.",
      "Describes some changes but lacks specifics and relevant details.",
      "Describes notable changes in family structure, such as delayed marriage, smaller families, or single-parent households.",
      "Provides a detailed description of multiple changes in family structure and their potential causes and effects.",
      "Offers a comprehensive and insightful analysis of the shifts in family structure, including the social, economic, and cultural factors driving these changes."
    ],
    [
      "Fails to analyze the broader societal impact.",
      "Offers a superficial analysis with little or no supporting evidence.",
      "Identifies some impacts but lacks depth and critical thinking.",
      "Analyzes the impact of women's changing roles on various aspects of society, such as the economy, politics, and culture.",
      "Provides a comprehensive analysis of the multi-faceted impacts of women's evolving roles, supported by evidence and examples.",
      "Offers a nuanced and insightful analysis of the far-reaching impacts of women's changing roles, demonstrating critical thinking and sophisticated reasoning."
    ]
  ]
}