{
  "criteria": [
    "Understanding of the Roles and Powers of the Papacy and European Monarchs",
    "Analysis of Conflict and Cooperation",
    "Use of Historical Evidence"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no understanding of the roles and powers of the Papacy and European monarchs.",
      "Demonstrates a minimal understanding of the roles or powers of either the Papacy or European monarchs, but not both.",
      "Demonstrates a basic understanding of the roles and powers of both the Papacy and European monarchs, but with significant inaccuracies or omissions.",
      "Demonstrates a satisfactory understanding of the roles and powers of both the Papacy and European monarchs, with minor inaccuracies.",
      "Demonstrates a strong understanding of the roles and powers of both the Papacy and European monarchs, accurately and comprehensively.",
      "Demonstrates a comprehensive and nuanced understanding of the roles and powers of both the Papacy and European monarchs, including their historical context and significance."
    ],
    [
      "Does not identify any instances of conflict or cooperation between the Papacy and European monarchs.",
      "Identifies instances of either conflict or cooperation, but not both.",
      "Identifies instances of both conflict and cooperation, but without providing any analysis or explanation.",
      "Describes instances of conflict and cooperation, providing a basic analysis of the causes or consequences.",
      "Analyzes instances of conflict and cooperation, providing a detailed explanation of the causes, consequences, and historical significance.",
      "Provides a sophisticated analysis of the complex interplay of conflict and cooperation between the Papacy and European monarchs, demonstrating a deep understanding of the historical context."
    ],
    [
      "Provides no historical evidence to support claims.",
      "Provides minimal historical evidence, which may be inaccurate or irrelevant.",
      "Provides some historical evidence, but it is limited or not well-integrated into the analysis.",
      "Provides relevant historical evidence to support claims, but may not fully explain the connection.",
      "Provides well-chosen historical evidence to support claims, clearly explaining the connection and significance.",
      "Uses a wide range of historical evidence effectively and persuasively to support a sophisticated analysis of the topic."
    ]
  ]
}