{
  "criteria": [
    "Understanding of the Bear Flag Republic and its impact on California.",
    "Knowledge of the causes, events, and consequences of the Mexican-American War in California.",
    "Analysis of the social, economic, and demographic impacts of the Gold Rush on California.",
    "Understanding of the process and significance of California's granting of statehood."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the Bear Flag Republic or its significance.",
      "Shows a minimal understanding of the Bear Flag Republic, with significant misconceptions.",
      "Identifies the Bear Flag Republic but struggles to explain its impact or context.",
      "Explains the establishment of the Bear Flag Republic and its immediate consequences with some accuracy.",
      "Analyzes the Bear Flag Republic's impact on California's political landscape and its role in the lead-up to the Mexican-American War.",
      "Provides a comprehensive analysis of the Bear Flag Republic, including its historical context, key figures, and lasting effects on California's identity and political development."
    ],
    [
      "Demonstrates no knowledge of the Mexican-American War in California.",
      "Has some awareness of the Mexican-American War but lacks understanding of its causes or effects.",
      "Identifies the Mexican-American War as a conflict but struggles to explain its relevance to California.",
      "Describes key events of the Mexican-American War in California, such as battles and treaties, with some accuracy.",
      "Explains the causes and consequences of the Mexican-American War in California, including territorial changes and political shifts.",
      "Offers a detailed analysis of the Mexican-American War's impact on California, including its economic, social, and political ramifications for different groups within the region."
    ],
    [
      "Demonstrates no understanding of the Gold Rush or its effects on California.",
      "Shows minimal awareness of the Gold Rush, with significant misconceptions about its impact.",
      "Identifies the Gold Rush as a period of rapid change but struggles to explain its social, economic, or demographic consequences.",
      "Describes the basic social, economic, and demographic changes brought about by the Gold Rush with some accuracy.",
      "Analyzes the ways in which the Gold Rush transformed California's population, economy, and social structure, including its effects on Native Americans and other minority groups.",
      "Provides a comprehensive analysis of the Gold Rush, including its long-term economic, social, and environmental impacts on California and its role in shaping the state's identity."
    ],
    [
      "Demonstrates no understanding of California's path to statehood.",
      "Has a limited awareness of California becoming a state but lacks understanding of the process or significance.",
      "Identifies California as a state but struggles to explain how it achieved statehood or its importance.",
      "Describes the basic steps involved in California's granting of statehood with some accuracy.",
      "Explains the political and social factors that influenced California's path to statehood, including debates over slavery and representation.",
      "Offers a detailed analysis of California's statehood, including its significance in the context of national politics and its impact on the state's future development."
    ]
  ]
}