{
  "criteria": [
    "Understanding of the causes of the Spanish-American War",
    "Knowledge of key events and figures during the Spanish-American War",
    "Analysis of U.S. expansion in the South Pacific",
    "Clarity and Organization"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of the causes of the Spanish-American War.",
      "Student identifies a single cause of the Spanish-American War with limited accuracy.",
      "Student identifies a couple of causes of the Spanish-American War with some accuracy.",
      "Student identifies multiple causes of the Spanish-American War with reasonable accuracy.",
      "Student clearly explains several causes of the Spanish-American War with good accuracy, demonstrating a solid understanding of the historical context.",
      "Student comprehensively explains the multiple causes of the Spanish-American War with excellent accuracy, demonstrating a deep understanding of the historical context and underlying factors."
    ],
    [
      "Student is unable to recall any key events or figures from the Spanish-American War.",
      "Student recalls one or two key events or figures with limited accuracy.",
      "Student recalls some key events and figures with reasonable accuracy.",
      "Student recalls and describes several key events and figures with good accuracy.",
      "Student accurately describes numerous key events and figures, demonstrating a strong understanding of the war's progression.",
      "Student provides a detailed and accurate account of key events, figures, and turning points, showcasing a comprehensive grasp of the Spanish-American War."
    ],
    [
      "Student demonstrates no understanding of U.S. expansion in the South Pacific.",
      "Student identifies U.S. expansion in the South Pacific with minimal explanation.",
      "Student describes U.S. expansion in the South Pacific with limited analysis.",
      "Student analyzes the reasons and effects of U.S. expansion in the South Pacific with reasonable depth.",
      "Student provides a well-reasoned analysis of the political, economic, and social factors driving U.S. expansion in the South Pacific, and its consequences.",
      "Student presents a sophisticated and nuanced analysis of U.S. expansion in the South Pacific, considering multiple perspectives and long-term impacts."
    ],
    [
      "Response is unclear, disorganized, and difficult to understand.",
      "Response lacks clarity and organization, making it challenging to follow.",
      "Response demonstrates some clarity and organization but could be improved.",
      "Response is generally clear and well-organized, with a logical flow of ideas.",
      "Response is clear, well-organized, and effectively communicates information.",
      "Response is exceptionally clear, concise, and logically structured, demonstrating excellent communication skills."
    ]
  ]
}