{
  "criteria": [
    "Understanding of Pre-Columbian Economies",
    "Knowledge of the Franciscans' Role",
    "Understanding of the Transition to an Agricultural Economy",
    "Analysis of Social and Economic Impact"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of the hunter-gatherer economy of pre-Columbian California.",
      "Shows minimal understanding of the hunter-gatherer economy with significant inaccuracies.",
      "Displays a basic understanding of the hunter-gatherer economy with some inaccuracies.",
      "Exhibits a satisfactory understanding of the hunter-gatherer economy with minor inaccuracies.",
      "Demonstrates a strong understanding of the hunter-gatherer economy with few inaccuracies.",
      "Shows a comprehensive and accurate understanding of the hunter-gatherer economy of pre-Columbian California."
    ],
    [
      "Demonstrates no understanding of the Franciscans' role in altering California's economy.",
      "Shows minimal knowledge of the Franciscans' influence with major misconceptions.",
      "Displays a basic awareness of the Franciscans' role with several inaccuracies.",
      "Exhibits a satisfactory understanding of the Franciscans' influence with minor inaccuracies.",
      "Demonstrates a strong understanding of the Franciscans' role with few inaccuracies.",
      "Shows a comprehensive and accurate understanding of the Franciscans' role in transforming California's economy."
    ],
    [
      "Demonstrates no understanding of how the Franciscans introduced and developed an agricultural economy.",
      "Shows minimal understanding of the transition, with significant misconceptions about agricultural practices.",
      "Displays a basic understanding of the shift to agriculture with several inaccuracies.",
      "Exhibits a satisfactory understanding of the transition with minor inaccuracies.",
      "Demonstrates a strong understanding of how the Franciscans established and expanded agriculture.",
      "Shows a comprehensive and accurate understanding of the economic shift from hunter-gatherer to agricultural practices under Franciscan influence."
    ],
    [
      "Provides no analysis of the broader social and economic impact of this transition.",
      "Offers a minimal and superficial analysis with significant misunderstandings.",
      "Presents a basic analysis with several inaccuracies and omissions.",
      "Provides a satisfactory analysis with minor inaccuracies.",
      "Demonstrates a strong analysis of the social and economic consequences of the economic shift.",
      "Shows a comprehensive and insightful analysis of the social and economic impacts of the transition from a hunter-gatherer to an agricultural economy, including impacts on indigenous populations and the environment."
    ]
  ]
}