{
  "criteria": [
    "Understanding of Jefferson's Statute for Religious Freedom",
    "Knowledge of the origins, purpose, and differing views on the separation of church and state",
    "Ability to compare and contrast the views of the Founding Fathers on the separation of church and state"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of Jefferson's Statute for Religious Freedom.",
      "Student demonstrates a minimal understanding of Jefferson's Statute for Religious Freedom.",
      "Student demonstrates a basic understanding of Jefferson's Statute for Religious Freedom but struggles to explain its significance.",
      "Student demonstrates a satisfactory understanding of Jefferson's Statute for Religious Freedom and can explain its significance as a forerunner to the First Amendment.",
      "Student demonstrates a strong understanding of Jefferson's Statute for Religious Freedom, explains its significance, and connects it to broader themes of religious liberty.",
      "Student demonstrates a comprehensive understanding of Jefferson's Statute for Religious Freedom, its historical context, its significance, and its lasting impact on religious freedom in the United States."
    ],
    [
      "Student demonstrates no knowledge of the origins, purpose, or differing views on the separation of church and state.",
      "Student demonstrates minimal knowledge of the origins, purpose, or differing views on the separation of church and state.",
      "Student demonstrates some knowledge but struggles to articulate the origins, purpose, and differing views on the separation of church and state.",
      "Student demonstrates a satisfactory understanding of the origins, purpose, and differing views on the separation of church and state.",
      "Student demonstrates a strong understanding of the origins, purpose, and differing views on the separation of church and state, and can explain the different perspectives.",
      "Student demonstrates a comprehensive understanding of the origins, purpose, and differing views on the separation of church and state, and can analyze the historical and philosophical underpinnings of these views."
    ],
    [
      "Student cannot identify any views of the Founding Fathers on the separation of church and state.",
      "Student can identify one or two Founding Fathers but cannot articulate their views on the separation of church and state.",
      "Student can identify some Founding Fathers and their views but struggles to compare and contrast them.",
      "Student can identify several Founding Fathers and their views on the separation of church and state and can offer basic comparisons.",
      "Student can effectively compare and contrast the views of multiple Founding Fathers on the separation of church and state, highlighting key similarities and differences.",
      "Student provides a nuanced and insightful analysis of the views of the Founding Fathers on the separation of church and state, demonstrating a deep understanding of their motivations and the historical context."
    ]
  ]
}