{
  "criteria": [
    "Understanding of America's motivations for involvement in Panama.",
    "Knowledge of the key events of the Panama Revolution.",
    "Understanding of the impact of the Panama Canal's construction.",
    "Ability to analyze America's role in the Panama Revolution and Canal construction."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of America's interest or motivations in Panama.",
      "Shows a limited understanding of America's motivations, with significant gaps or inaccuracies.",
      "Identifies some of America's motivations but lacks depth or supporting details.",
      "Explains America's motivations for involvement with reasonable clarity and accuracy.",
      "Clearly explains America's motivations, providing relevant supporting details and historical context.",
      "Demonstrates a comprehensive understanding of America's motivations, analyzing the economic, political, and strategic factors influencing US involvement."
    ],
    [
      "Demonstrates no knowledge of the Panama Revolution.",
      "Shows minimal awareness of the Panama Revolution, with significant factual errors.",
      "Identifies a few isolated events of the Revolution, but lacks a coherent narrative.",
      "Describes the main events of the Panama Revolution with some accuracy.",
      "Accurately describes the key events of the Panama Revolution and their significance.",
      "Provides a detailed and nuanced account of the Panama Revolution, including causes, key figures, and consequences."
    ],
    [
      "Demonstrates no understanding of the impact of the Panama Canal's construction.",
      "Shows a limited understanding of the Panama Canal's impact, with significant gaps or inaccuracies.",
      "Identifies some impacts of the Panama Canal, but lacks depth or supporting details.",
      "Explains the impact of the Panama Canal's construction with reasonable clarity and accuracy.",
      "Clearly explains the impact of the Panama Canal's construction, providing relevant supporting details.",
      "Demonstrates a comprehensive understanding of the Panama Canal's impact, analyzing its economic, political, and strategic consequences."
    ],
    [
      "Offers no analysis of America's role.",
      "Provides a superficial and underdeveloped analysis of America's role.",
      "Presents a basic analysis of America's role, but lacks critical thinking or nuance.",
      "Analyzes America's role with reasonable clarity and identifies some key factors.",
      "Offers a well-reasoned and insightful analysis of America's role, considering multiple perspectives.",
      "Presents a sophisticated and nuanced analysis of America's role, demonstrating critical thinking and historical awareness."
    ]
  ]
}