{
  "criteria": [
    "Identification of Safety Rules",
    "Understanding of the Purpose of Safety Rules",
    "Application of Safety Rules in Different Contexts"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify any safety rules for the home, school, or community.",
      "The student identifies only one or two safety rules, with limited accuracy or detail.",
      "The student identifies some safety rules (3-4), but demonstrates a lack of clarity or provides incomplete information.",
      "The student identifies several safety rules for the home, school, and community (5-6) and provides some relevant details.",
      "The student accurately identifies most (7-8) safety rules for the home, school, and community, providing clear and relevant details.",
      "The student comprehensively identifies all (9+) safety rules for the home, school, and community and provides clear, accurate, and thorough details."
    ],
    [
      "The student does not demonstrate any understanding of why safety rules are important.",
      "The student shows a minimal understanding of the purpose of safety rules, struggling to articulate why they exist.",
      "The student demonstrates some understanding of the purpose of safety rules but has difficulty explaining it clearly.",
      "The student explains the purpose of safety rules in a basic way, with limited elaboration or examples.",
      "The student clearly explains the purpose of safety rules, providing relevant examples and showing good understanding.",
      "The student provides a comprehensive and insightful explanation of the purpose of safety rules, demonstrating a deep understanding with well-developed examples."
    ],
    [
      "The student cannot apply safety rules to real-life scenarios in the home, school, or community.",
      "The student struggles to apply safety rules, only able to provide a brief example or a vague scenario.",
      "The student applies safety rules with limited effectiveness or relevance, making errors or missing important details.",
      "The student applies safety rules in several contexts but does not provide details on why the application makes sense.",
      "The student can accurately apply safety rules to a range of scenarios, demonstrating a solid understanding of their relevance.",
      "The student exhibits excellence in applying safety rules with a thorough analysis."
    ]
  ]
}