{
  "criteria": [
    "Understanding the Importance of Adult Supervision",
    "Recognizing Trusted Adults",
    "Understanding Consequences of Not Following Guidelines"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not recognize the need for adult supervision when taking medicine.",
      "The student vaguely acknowledges the need for adult supervision but lacks specific reasoning.",
      "The student identifies that adult supervision is important, especially for prescription medicines, but does not provide detail on why.",
      "The student explains that adult supervision is needed for medicines, including over-the-counter drugs, to ensure correct dosage and avoid interactions.",
      "The student thoroughly explains the necessity of adult supervision for all medications, detailing potential risks such as allergic reactions, side effects, and interactions with other substances.",
      "The student comprehensively discusses the importance of adult supervision for medication, demonstrating an understanding of legal, ethical, and health-related factors. They can advocate for responsible medication practices."
    ],
    [
      "The student cannot identify who qualifies as a trusted adult in the context of medication supervision.",
      "The student lists adults but struggles to identify which adults are 'trusted' and why.",
      "The student correctly lists parents\/guardians as trusted adults for medication supervision but does not consider other possibilities.",
      "The student identifies parents\/guardians, school nurses, and doctors as trusted adults and provides basic reasoning.",
      "The student accurately identifies various trusted adults (parents\/guardians, school nurses, doctors, pharmacists) and provides detailed reasoning.",
      "The student fluently discusses what characterizes a 'trusted adult' in the context of medication, justifying their reasoning with legal, ethical, and health-related factors."
    ],
    [
      "The student does not understand or recognize any potential risks when medicines are taken without adult supervision.",
      "The student vaguely understands that there could be negative consequences but cannot explain them.",
      "The student can identify a couple of risks associated with unsupervised medication, such as incorrect dosage.",
      "The student explains several risks, including incorrect dosage, potential for addiction, and side effects.",
      "The student comprehensively details risks like allergic reactions, side effects, interactions, overdose, and addiction, when medicine is taken without adult supervision.",
      "The student accurately discusses the far-reaching consequences, including health, legal, and ethical implications, of not adhering to adult supervision when taking medicine."
    ]
  ]
}