{
  "criteria": [
    "Understanding the Importance of Reporting",
    "Clarity and Accuracy of Explanation"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate an understanding of why reporting a weapon sighting or knowledge is important.",
      "The student shows a minimal understanding, perhaps mentioning safety but without detail.",
      "The student explains that reporting helps keep people safe, but lacks depth in reasoning.",
      "The student explains the importance of reporting in terms of personal and community safety, and mentions legal obligations or school policies.",
      "The student thoroughly explains the importance of reporting, including multiple reasons such as safety, prevention of violence, and legal\/ethical responsibilities. They articulate why a trusted adult is the appropriate recipient of this information.",
      "The student provides a comprehensive and nuanced explanation of the importance of reporting, demonstrating a deep understanding of the potential consequences of not reporting, and the role of trusted adults in ensuring safety and well-being. They demonstrate understanding of possible obstacles to reporting and suggest solutions."
    ],
    [
      "The student's explanation is unclear, inaccurate, or irrelevant to the prompt.",
      "The student attempts to explain, but the explanation is difficult to understand or contains inaccuracies.",
      "The student's explanation is generally clear but may contain minor inaccuracies or lack detail.",
      "The student provides a clear and mostly accurate explanation, with sufficient detail to convey understanding.",
      "The student provides a clear, accurate, and detailed explanation, demonstrating a strong command of the subject matter.",
      "The student provides an exceptionally clear, accurate, and insightful explanation, demonstrating a deep understanding of the subject matter and the ability to communicate it effectively."
    ]
  ]
}