{
  "criteria": [
    "Identification of Trusted Adults",
    "Understanding of Roles",
    "Examples and Specificity"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student cannot identify any trusted adults who promote healthy growth and development.",
      "The student can identify one or two adults, but the reasoning behind their choices is vague or unclear.",
      "The student can identify one or two adults, and provides a somewhat clear rationale for their choices, but is not comprehensive.",
      "The student identifies at least three trusted adults and provides a clear rationale for each, demonstrating a basic understanding of their roles in health promotion.",
      "The student identifies at least four trusted adults, provides a detailed rationale for each, and demonstrates a solid understanding of their diverse roles in promoting healthy growth and development.",
      "The student comprehensively identifies multiple trusted adults, provides insightful rationales connecting their roles to specific aspects of health, and demonstrates a sophisticated understanding of the importance of seeking guidance from these professionals."
    ],
    [
      "The student shows no understanding of the roles these adults play in promoting healthy growth and development.",
      "The student demonstrates limited understanding of the roles of the adults in promoting healthy growth and development. Descriptions are very high level and vague.",
      "The student shows some understanding of the roles of the adults, but the explanation lacks detail.",
      "The student shows adequate understanding of roles, and is able to describe the primary way these adults promote growth and development.",
      "The student shows strong understanding of the roles, and can describe several ways these adults promote growth and development.",
      "The student demonstrates a comprehensive understanding of the diverse roles these adults play, including preventive care, education, and support for overall well-being, with nuanced and insightful explanations."
    ],
    [
      "The student provides no examples or specific information related to how these adults promote health.",
      "The student provides limited or vague examples of how these adults promote health, lacking specific details.",
      "The student provides general examples of how these adults promote health, but lacks depth or specific connections.",
      "The student provides clear and relevant examples of how these adults promote health, with some specific details.",
      "The student provides detailed and specific examples, illustrating a thorough understanding of how these adults contribute to healthy growth and development.",
      "The student provides insightful, detailed, and nuanced examples, demonstrating a sophisticated understanding of the specific ways these trusted adults promote healthy growth and development in various contexts."
    ]
  ]
}