{
  "criteria": [
    "Identification of School Rules",
    "Understanding of the Rationale Behind the Rules",
    "Examples of How Rules Promote Positive Interactions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any school rules related to getting along with others.",
      "Student identifies one or two school rules vaguely related to getting along with others, but with little accuracy.",
      "Student identifies some school rules related to getting along with others, but with limited detail or accuracy.",
      "Student identifies several school rules related to getting along with others, providing a basic description of each.",
      "Student clearly and accurately describes multiple school rules related to getting along with others, demonstrating a good understanding.",
      "Student comprehensively and accurately describes school rules related to getting along with others, providing context and demonstrating a thorough understanding."
    ],
    [
      "Student does not demonstrate any understanding of why the rules are in place.",
      "Student offers a limited or inaccurate rationale for the rules.",
      "Student provides a basic explanation of why the rules exist, but lacks depth.",
      "Student explains the rationale behind the rules, connecting them to the goal of fostering positive relationships.",
      "Student demonstrates a strong understanding of the rationale, explaining how the rules contribute to a positive school environment.",
      "Student provides a nuanced explanation of the rationale, demonstrating a deep understanding of the rules' importance in promoting respect and understanding among students."
    ],
    [
      "Student does not provide any examples of how the rules promote positive interactions.",
      "Student provides irrelevant or unclear examples.",
      "Student provides a single example of how a rule promotes positive interaction, but it is vague.",
      "Student provides a few general examples of how the rules can lead to positive interactions.",
      "Student gives concrete examples of how specific rules contribute to positive interactions among students.",
      "Student provides insightful and detailed examples of how the rules foster empathy, respect, and cooperation, leading to a more positive school climate."
    ]
  ]
}