{
  "criteria": [
    "Understanding and explanation of personal boundaries and the right to refuse unwanted touch.",
    "Ability to apply the concept to real-life scenarios.",
    "Clarity and effectiveness of communication in conveying the message."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not demonstrate an understanding of personal boundaries or the right to refuse touch.",
      "The student shows a limited understanding of personal boundaries and the right to refuse touch, with significant gaps in comprehension.",
      "The student demonstrates a basic understanding of personal boundaries and the right to refuse touch but struggles to articulate it clearly.",
      "The student explains personal boundaries and the right to refuse touch adequately, with minor areas for improvement.",
      "The student clearly and accurately explains personal boundaries and the right to refuse touch, demonstrating a solid understanding.",
      "The student comprehensively and articulately explains personal boundaries and the right to refuse touch, demonstrating a deep and nuanced understanding."
    ],
    [
      "The student cannot apply the concept to real-life scenarios.",
      "The student struggles to apply the concept to real-life scenarios and provides unrealistic or inappropriate examples.",
      "The student attempts to apply the concept to real-life scenarios but demonstrates difficulty in identifying relevant situations.",
      "The student applies the concept to some real-life scenarios accurately, but may miss nuances or complexities.",
      "The student applies the concept to a variety of real-life scenarios accurately and thoughtfully, demonstrating a good understanding of context.",
      "The student expertly applies the concept to complex real-life scenarios, demonstrating a sophisticated understanding of context and potential consequences."
    ],
    [
      "The student's communication is unclear and ineffective in conveying the message.",
      "The student struggles to communicate the message effectively, with significant issues in clarity and organization.",
      "The student communicates the message with some clarity, but there are areas where improvement is needed.",
      "The student communicates the message adequately, with generally clear and understandable language.",
      "The student communicates the message clearly and effectively, using appropriate language and tone.",
      "The student communicates the message with exceptional clarity, persuasiveness, and sensitivity, tailoring their language to the audience and context."
    ]
  ]
}