{
  "criteria": [
    "Responsiveness to Stimuli",
    "Exploration of Locomotor and Non-Locomotor Movements",
    "Application of Dance Elements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not respond to the stimuli provided.",
      "Student shows minimal response to stimuli, with little to no discernible connection between the stimulus and movement.",
      "Student demonstrates a basic response to stimuli, but the connection to the stimulus is weak or superficial.",
      "Student responds to stimuli with some creativity and connection, showing an understanding of the stimulus's influence on movement.",
      "Student demonstrates a clear and creative response to stimuli, effectively translating the essence of the stimulus into movement.",
      "Student exhibits a highly imaginative and nuanced response to stimuli, demonstrating a deep understanding and masterful translation of the stimulus into compelling and expressive movement."
    ],
    [
      "Student does not attempt to explore different locomotor and non-locomotor movements.",
      "Student attempts to explore movements, but shows little understanding of elements of dance.",
      "Student explores basic locomotor and non-locomotor movements but struggles to vary the elements of dance effectively.",
      "Student experiments with different ways to perform locomotor and non-locomotor movements, showing some variation in the elements of dance.",
      "Student skillfully explores and manipulates locomotor and non-locomotor movements, demonstrating a solid understanding of how to vary the elements of dance to create different effects.",
      "Student exhibits a sophisticated and inventive approach to exploring locomotor and non-locomotor movements, masterfully manipulating the elements of dance to create dynamic and expressive movement sequences."
    ],
    [
      "Student shows no understanding of dance elements.",
      "Student demonstrates minimal awareness of dance elements (e.g., space, time, energy) and their impact on movement.",
      "Student identifies dance elements but struggles to apply them effectively to alter or enhance movements.",
      "Student applies some dance elements to modify movements, demonstrating a basic understanding of their relationship to expressive qualities.",
      "Student skillfully manipulates dance elements to create nuanced and expressive movements, showing a strong command of their impact.",
      "Student demonstrates mastery of dance elements, seamlessly integrating them to craft highly imaginative and evocative movements that enhance the overall artistic expression."
    ]
  ]
}