{"criteria":["Capitalization of Dates and Names","Use of End Punctuation","Comma Usage in Dates and Series","Spelling of Common and Irregular Words","Phonetic Spelling of Untaught Words"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of capitalization rules; frequent errors in capitalizing dates and names.","Demonstrates minimal understanding of capitalization rules; makes frequent errors in capitalizing dates and names.","Demonstrates partial understanding of capitalization rules; makes some errors in capitalizing dates and names.","Demonstrates adequate understanding of capitalization rules; generally capitalizes dates and names correctly, but may have occasional errors.","Demonstrates strong understanding of capitalization rules; consistently capitalizes dates and names correctly with very few errors.","Demonstrates excellent understanding of capitalization rules; consistently and accurately capitalizes dates and names in all contexts."],["Demonstrates no understanding of end punctuation; sentences lack appropriate end marks or have incorrect punctuation.","Demonstrates minimal understanding of end punctuation; frequently omits or misuses end punctuation.","Demonstrates partial understanding of end punctuation; sometimes uses correct end punctuation, but errors are common.","Demonstrates adequate understanding of end punctuation; generally uses correct end punctuation, but may have occasional errors.","Demonstrates strong understanding of end punctuation; consistently uses correct end punctuation with very few errors.","Demonstrates excellent understanding of end punctuation; consistently and accurately uses end punctuation in all types of sentences."],["Demonstrates no understanding of comma usage; omits commas in dates and series or uses them incorrectly.","Demonstrates minimal understanding of comma usage; frequently omits or misuses commas in dates and series.","Demonstrates partial understanding of comma usage; sometimes uses commas correctly in dates and series, but errors are common.","Demonstrates adequate understanding of comma usage; generally uses commas correctly in dates and series, but may have occasional errors.","Demonstrates strong understanding of comma usage; consistently uses commas correctly in dates and series with very few errors.","Demonstrates excellent understanding of comma usage; consistently and accurately uses commas in dates and series in all contexts."],["Demonstrates no understanding of conventional spelling; frequent errors in common and irregular words.","Demonstrates minimal understanding of conventional spelling; makes frequent errors in common and irregular words.","Demonstrates partial understanding of conventional spelling; makes some errors in common and irregular words.","Demonstrates adequate understanding of conventional spelling; generally spells common and irregular words correctly, but may have occasional errors.","Demonstrates strong understanding of conventional spelling; consistently spells common and irregular words correctly with very few errors.","Demonstrates excellent understanding of conventional spelling; consistently and accurately spells common and irregular words in all contexts."],["Unable to apply phonetic spelling; misspells untaught words without any phonetic basis.","Demonstrates minimal phonetic awareness; attempts phonetic spelling, but with little accuracy.","Demonstrates partial phonetic awareness; some attempts at phonetic spelling are recognizable, but many errors persist.","Demonstrates adequate phonetic awareness; generally spells untaught words phonetically, but may have some inconsistencies.","Demonstrates strong phonetic awareness; consistently spells untaught words phonetically with a high degree of accuracy.","Demonstrates excellent phonetic awareness; consistently and accurately spells untaught words phonetically, demonstrating a strong grasp of phonemic awareness and spelling conventions."]]}