{"criteria":["Use of Context Clues, Affixes, and Root Words","Ability to Determine Meaning","Determine meaning of words\/phrases using context clues"],"points":[0,1,2,3,4,5],"descriptions":[["Does not attempt to use context clues, affixes, or root words to determine meaning.","Attempts to use context clues, affixes, or root words, but demonstrates little to no understanding.","Uses context clues, affixes, or root words with limited success; struggles to accurately determine the meaning of unfamiliar words or phrases.","Generally uses context clues, affixes, and root words effectively to determine the meaning of unfamiliar words and phrases, but may have occasional inaccuracies.","Consistently and accurately uses context clues, affixes, and root words to determine the meaning of unfamiliar words and phrases.","Masterfully and insightfully uses context clues, affixes, and root words to determine the nuanced meaning of unfamiliar words and phrases, demonstrating a sophisticated understanding of language."],["Unable to identify or explain the meaning of words or phrases.","Struggles to identify or explain the meaning of words or phrases, even with guidance.","Identifies and explains the meaning of some words or phrases but demonstrates gaps in understanding.","Identifies and explains the meaning of most words and phrases accurately, demonstrating a solid understanding.","Confidently and accurately identifies and explains the meaning of a wide range of words and phrases.","Demonstrates an exceptional ability to identify and explain the nuanced meanings of complex words and phrases, displaying a comprehensive vocabulary."],["Unable to determine meaning of a word or phrase","With help, attempts to determine meaning of word or phrase with significant errors","Determine meaning with some errors when using context clues","Determine meaning with few errors when using context clues","Determine meaning with no errors when using context clues","Determine complex\/nuanced meaning with no errors when using context clues"]]}