{"criteria":["Understanding of Word Relationships and Nuances","Identifying Real-Life Connections","Distinguishing Shades of Meaning"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of word relationships or nuances in word meanings.  Shows no ability to sort words into categories or define them by attributes.","Student demonstrates a minimal understanding of word relationships and nuances in word meanings.  Struggles to sort words into categories or define them by attributes, even with significant guidance.","Student demonstrates a basic understanding of word relationships and nuances in word meanings with some guidance. Can sort simple words into categories and provide basic definitions with prompting.","Student demonstrates a moderate understanding of word relationships and nuances in word meanings.  Can sort words into categories and define them by attributes with occasional errors or need for assistance.","Student demonstrates a strong understanding of word relationships and nuances in word meanings.  Can sort words into various categories and define them by key attributes accurately and independently.","Student demonstrates an exceptional understanding of word relationships and nuances in word meanings.  Can sort words into complex categories, define them precisely, and explain real-life connections with sophistication."],["Student is unable to identify any real-life connections between words and their uses.","Student struggles to identify real-life connections between words and their uses, even when provided with examples.","Student can identify simple real-life connections between words and their uses with significant prompting.","Student identifies some real-life connections between words and their uses with minor prompting and may have difficulty explaining the connection.","Student accurately identifies and explains real-life connections between words and their uses in familiar contexts.","Student insightfuly identifies, explains, and provides nuanced examples of real-life connections between words and their uses in various contexts."],["Student cannot distinguish shades of meaning among verbs or adjectives.","Student demonstrates difficulty distinguishing shades of meaning among verbs and adjectives, even when provided with definitions and examples.","Student begins to distinguish shades of meaning among some verbs and adjectives with direct instruction and support.","Student can differentiate between common verbs and adjectives with differing intensities with some accuracy.","Student accurately distinguishes shades of meaning among verbs and adjectives and can use them appropriately in context.","Student demonstrates a sophisticated understanding of shades of meaning and uses a wide range of verbs and adjectives with precision to convey subtle differences in meaning."]]}