{"criteria":["Use of Conjunctions to Signal Simple Relationships","Vocabulary and Phrase Usage","Engagement with and Response to Texts"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of conjunctions or their use in signaling relationships.","Student demonstrates minimal understanding of conjunctions and struggles to use them correctly in simple sentences.","Student demonstrates a basic understanding of conjunctions but uses them inconsistently or inappropriately in simple sentences.","Student demonstrates a satisfactory understanding of conjunctions and uses them correctly in most simple sentences to signal relationships.","Student demonstrates a strong understanding of conjunctions and uses them effectively in simple sentences to signal clear relationships.","Student demonstrates an excellent understanding of conjunctions and uses them skillfully in varied sentence structures to signal nuanced relationships, enhancing clarity and coherence."],["Student's vocabulary is limited, and they struggle to use words and phrases acquired through conversations and reading.","Student attempts to use acquired words and phrases, but their usage is often inaccurate or inappropriate.","Student uses some acquired words and phrases, but their vocabulary remains limited and their usage is not always effective.","Student uses a variety of acquired words and phrases appropriately in their writing and speaking.","Student demonstrates a strong command of acquired words and phrases, using them effectively to enhance their communication.","Student demonstrates an exceptional command of acquired words and phrases, using them skillfully and creatively to express complex ideas with precision and nuance."],["Student does not engage with texts or demonstrate any response to them.","Student shows minimal engagement with texts and struggles to formulate a coherent response.","Student provides a basic response to texts, but their understanding is superficial.","Student engages with texts and provides a thoughtful response that demonstrates comprehension.","Student engages deeply with texts and provides a well-reasoned response that demonstrates critical thinking.","Student engages critically with texts and provides an insightful and original response that demonstrates a sophisticated understanding of the material."]]}