{"criteria":["Understanding of Language Function","Use of Context Clues","Understanding of Nuances in Word Choices"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of how language functions in different contexts.","The student shows minimal understanding of how language functions in different contexts and makes frequent errors.","The student demonstrates some understanding of how language functions in different contexts but still makes several errors.","The student generally understands how language functions in different contexts, with occasional errors.","The student demonstrates a strong understanding of how language functions in different contexts, with few errors.","The student demonstrates a sophisticated understanding of how language functions in different contexts and consistently uses language effectively and accurately."],["The student is unable to use context clues to determine or clarify the meaning of words and phrases.","The student struggles to use context clues and rarely determines the correct meaning of words and phrases.","The student attempts to use context clues but often misinterprets or incorrectly determines the meaning of words and phrases.","The student generally uses context clues to determine the meaning of words and phrases, but may require some assistance.","The student effectively uses context clues to determine the meaning of words and phrases with minimal errors.","The student adeptly and consistently uses context clues to clarify and determine the precise meaning of words and phrases in various contexts."],["The student shows no awareness of the nuances and shades of meaning in word choices.","The student is vaguely aware of the nuances and shades of meaning in word choices but cannot apply them effectively.","The student sometimes recognizes nuances and shades of meaning in word choices but struggles with consistent application.","The student usually recognizes and appreciates the nuances and shades of meaning in word choices, applying them appropriately in most cases.","The student consistently recognizes and understands the nuances and shades of meaning in word choices, using them skillfully.","The student demonstrates a deep understanding of the subtleties of language and consistently and creatively uses nuances and shades of meaning in their word choices to enhance communication."]]}