{"criteria":["Command of Basic Grammatical Elements (Nouns, Pronouns, Verbs, Adjectives, Conjunctions, Determiners, Prepositions)","Sentence Formation and Expansion","Verb Tense Usage"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of standard English grammar and usage.","Demonstrates very limited command of standard English grammar and usage, with frequent errors.","Demonstrates some command of standard English grammar and usage, but with noticeable errors that occasionally impede understanding.","Demonstrates a general command of standard English grammar and usage, with occasional errors that do not significantly impede understanding.","Demonstrates a strong command of standard English grammar and usage, with few errors.","Demonstrates consistent and accurate command of standard English grammar and usage in all writing and speaking."],["Unable to form or expand simple sentences.","Forms only very basic simple sentences with difficulty; struggles with compound sentences.","Forms simple sentences adequately but struggles with expanding them or forming compound sentences; errors in sentence structure.","Forms and expands simple sentences and constructs basic compound sentences with some errors.","Forms and expands simple and compound sentences effectively with few errors.","Consistently produces and expands complete simple and compound declarative, interrogative, imperative, and exclamatory sentences with sophistication and precision."],["Demonstrates no understanding of the different verb tenses.","Demonstrates minimal understanding of verb tenses, with frequent errors in usage.","Demonstrates some understanding of verb tenses but struggles to use them correctly in writing and speaking.","Generally uses correct verb tenses, but with occasional inconsistencies or errors.","Uses verb tenses accurately and consistently to convey a sense of past, present, and future.","Demonstrates sophisticated use of verb tenses to convey subtle differences in time and meaning with consistent accuracy."]]}