{"criteria":["Capitalization: Correct use of capitalization for holidays, product names, and geographic names.","Comma Usage: Correct use of commas in greetings and closings of letters.","Apostrophe Usage: Correct use of apostrophes in contractions and possessives.","Spelling Patterns: Generalization of learned spelling patterns when writing new words.","Reference Materials: Use of reference materials to check and correct spellings."],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of capitalization rules. Errors are frequent and impede readability.","Student demonstrates limited understanding of capitalization rules. Errors are frequent but do not significantly impede readability.","Student demonstrates partial understanding of capitalization rules. Errors are present in capitalization of holidays, product names, or geographic names.","Student demonstrates a general understanding of capitalization rules. Minor errors may be present, but the overall capitalization is accurate.","Student demonstrates a strong understanding of capitalization rules. Capitalizes holidays, product names, and geographic names accurately with few errors.","Student demonstrates a comprehensive understanding of capitalization rules. Capitalizes holidays, product names, and geographic names accurately and consistently."],["Student demonstrates no understanding of comma usage in greetings and closings. Errors are frequent and confusing.","Student demonstrates limited understanding of comma usage in greetings and closings. Errors are present, but the intent is somewhat clear.","Student demonstrates partial understanding of comma usage. May omit commas or place them incorrectly in greetings or closings.","Student demonstrates a general understanding of comma usage. Uses commas in greetings and closings, but may have minor inconsistencies.","Student demonstrates a strong understanding of comma usage. Uses commas correctly in greetings and closings with few errors.","Student demonstrates a comprehensive understanding of comma usage. Consistently uses commas correctly in greetings and closings."],["Student demonstrates no understanding of apostrophe usage. Errors are frequent and impede understanding.","Student demonstrates limited understanding of apostrophe usage. Errors are present, but the general intent is discernible.","Student demonstrates partial understanding of apostrophe usage. Errors are present in contractions or possessives.","Student demonstrates a general understanding of apostrophe usage. Uses apostrophes in contractions and possessives, but may have minor errors.","Student demonstrates a strong understanding of apostrophe usage. Uses apostrophes correctly in contractions and possessives with few errors.","Student demonstrates a comprehensive understanding of apostrophe usage. Consistently uses apostrophes correctly in contractions and possessives."],["Student demonstrates no ability to generalize spelling patterns. Spelling errors are frequent and show no application of learned patterns.","Student demonstrates limited ability to generalize spelling patterns. Attempts to apply patterns are inconsistent and often incorrect.","Student demonstrates some ability to generalize spelling patterns. Applies learned patterns with mixed results, some words are spelled correctly, others are not.","Student demonstrates a general ability to generalize spelling patterns. Applies learned patterns to spell words, with occasional errors.","Student demonstrates a strong ability to generalize spelling patterns. Accurately applies learned patterns to spell unfamiliar words with few errors.","Student demonstrates a comprehensive ability to generalize spelling patterns. Consistently and accurately applies learned patterns to spell unfamiliar words."],["Student makes no attempt to consult reference materials. Spelling errors are numerous and uncorrected.","Student attempts to consult reference materials but is unable to effectively use them to correct errors.","Student consults reference materials but does not correct all spelling errors. Some improvement is evident.","Student consults reference materials and corrects some spelling errors. Demonstrates a basic understanding of how to use references.","Student consults reference materials and corrects most spelling errors. Demonstrates effective use of references.","Student consistently consults reference materials and corrects all spelling errors. Demonstrates mastery in using references to ensure correct spelling."]]}