{"criteria":["Use of Acquired Vocabulary and Phrases","Responding to Texts","Use of Adjectives and Adverbs to Describe"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no use of acquired vocabulary or phrases in their communication.","Student demonstrates minimal use of acquired vocabulary and phrases, with frequent inaccuracies.","Student demonstrates some use of acquired vocabulary and phrases, but the usage is basic and lacks detail.","Student demonstrates adequate use of acquired vocabulary and phrases, incorporating some adjectives and adverbs.","Student demonstrates proficient use of acquired vocabulary and phrases, effectively using adjectives and adverbs to describe.","Student demonstrates sophisticated and nuanced use of acquired vocabulary and phrases, using adjectives and adverbs to create vivid and detailed descriptions."],["Student does not attempt to respond to texts or incorporate them into their communication.","Student attempts to respond to texts, but the response is unclear or irrelevant.","Student responds to texts in a basic way, but lacks depth or connection to personal experiences.","Student responds to texts adequately, making connections to personal experiences and using some descriptive language.","Student responds to texts thoughtfully, making clear connections to personal experiences and using descriptive language effectively.","Student responds to texts insightfully, making nuanced connections to personal experiences and using descriptive language to create vivid imagery."],["Student demonstrates no use of adjectives and adverbs.","Student attempts to use adjectives and adverbs, but the usage is incorrect or inappropriate.","Student uses adjectives and adverbs in a limited way, with little impact on the description.","Student uses adjectives and adverbs adequately, enhancing the description to some extent.","Student uses adjectives and adverbs proficiently, creating a clear and detailed description.","Student uses adjectives and adverbs masterfully, creating a vivid, precise, and engaging description."]]}