{"criteria":["Use of Collective and Plural Nouns","Use of Reflexive Pronouns and Irregular Verb Tenses","Correct Use of Adjectives and Adverbs","Sentence Structure and Clarity","Readability and Legibility"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of collective nouns or frequently occurring irregular plural nouns. Errors are frequent and impede understanding.","Student demonstrates limited understanding of collective nouns and frequently occurring irregular plural nouns. Errors are frequent.","Student demonstrates some understanding of collective nouns and frequently occurring irregular plural nouns. Errors are occasionally present.","Student demonstrates a clear understanding of collective nouns and frequently occurring irregular plural nouns. Few errors are present.","Student demonstrates a strong understanding of collective nouns and frequently occurring irregular plural nouns. Errors are very rare.","Student demonstrates a comprehensive understanding of collective nouns and frequently occurring irregular plural nouns with no errors. Demonstrates ability to use correctly and explain why."],["Student demonstrates no understanding of reflexive pronouns or irregular verb tenses. Errors are frequent and impede understanding.","Student demonstrates limited understanding of reflexive pronouns and irregular verb tenses. Errors are frequent.","Student demonstrates some understanding of reflexive pronouns and irregular verb tenses. Errors are occasionally present.","Student demonstrates a clear understanding of reflexive pronouns and irregular verb tenses. Few errors are present.","Student demonstrates a strong understanding of reflexive pronouns and irregular verb tenses. Errors are very rare.","Student demonstrates a comprehensive understanding of reflexive pronouns and irregular verb tenses with no errors. Demonstrates ability to use correctly and explain why."],["Student demonstrates no understanding of adjectives and adverbs. Errors are frequent and impede understanding.","Student demonstrates limited understanding of adjectives and adverbs. Errors are frequent.","Student demonstrates some understanding of adjectives and adverbs. Errors are occasionally present.","Student demonstrates a clear understanding of adjectives and adverbs. Few errors are present.","Student demonstrates a strong understanding of adjectives and adverbs. Errors are very rare.","Student demonstrates a comprehensive understanding of adjectives and adverbs with no errors. Demonstrates ability to use correctly and explain why."],["Student demonstrates no ability to construct complete simple and compound sentences. Writing is unclear and disorganized.","Student struggles to construct complete simple and compound sentences. Writing is difficult to understand.","Student can construct some complete simple and compound sentences, but struggles with more complex structures. Writing is somewhat clear.","Student consistently constructs complete simple and compound sentences. Writing is clear and organized.","Student expertly constructs complete simple and compound sentences with varied sentence structure. Writing is highly effective.","Student expertly constructs complete simple and compound sentences with varied sentence structure and uses it to add meaning. Writing is highly effective."],["Document is unreadable due to illegible print or formatting issues.","Document is difficult to read due to print or formatting issues.","Document is mostly readable, but some print or formatting issues are present.","Document is readable with legible print and clear formatting.","Document is highly readable and visually appealing with excellent print quality and formatting.","Document is highly readable and visually appealing with excellent print quality and formatting that helps the reader understand the underlying meaning of the document."]]}