{"criteria":["Use of Context Clues","Understanding of Prefixes and Root Words","Prediction of Compound Word Meanings","Use of Glossaries and Dictionaries"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of how to use context clues to determine the meaning of unknown words or phrases.","Student attempts to use context clues but struggles to apply them effectively, resulting in inaccurate or incomplete interpretations.","Student inconsistently uses context clues to infer the meaning of words or phrases, with limited success.","Student generally uses context clues effectively to understand the meaning of unfamiliar words or phrases, though may occasionally miss nuances or subtleties.","Student consistently and accurately uses context clues to determine the meaning of unknown words and phrases, demonstrating a solid understanding of contextual analysis.","Student expertly and insightfully uses context clues to determine the meaning of complex or nuanced words and phrases, showcasing a mastery of contextual analysis."],["Student shows no recognition of prefixes or root words and cannot use them to determine the meaning of new words.","Student recognizes some prefixes or root words but is unable to apply this knowledge to decipher the meaning of unfamiliar words.","Student attempts to use knowledge of prefixes and root words to determine meaning, but with limited success and frequent errors.","Student can often use prefixes and root words to infer the meaning of new words, but may struggle with more complex or less common word parts.","Student consistently and accurately uses knowledge of prefixes and root words to determine the meaning of new words, demonstrating a strong understanding of morphology.","Student expertly uses knowledge of prefixes and root words, including less common ones, to precisely determine the meaning of new words, showing mastery of morphological analysis."],["Student does not attempt to use knowledge of individual words to predict the meaning of compound words.","Student struggles to connect the meanings of individual words to the overall meaning of compound words.","Student inconsistently uses knowledge of individual words to predict the meaning of compound words, with limited accuracy.","Student usually predicts the meaning of compound words based on the meanings of individual words, but may struggle with more idiomatic or figurative compounds.","Student accurately predicts the meaning of compound words based on the meanings of their component words, demonstrating a strong grasp of vocabulary and word formation.","Student expertly and insightfully predicts the meaning of compound words, including those with less obvious connections between component words, showing mastery of vocabulary and linguistic analysis."],["Student does not use glossaries or dictionaries to clarify word meanings.","Student attempts to use glossaries or dictionaries but struggles to locate words or interpret definitions.","Student inconsistently uses glossaries or dictionaries to clarify word meanings, with limited effectiveness.","Student generally uses glossaries or dictionaries to determine or clarify word meanings, though may need some guidance.","Student effectively and independently uses glossaries and dictionaries to determine or clarify the meaning of words and phrases, demonstrating resourcefulness and vocabulary skills.","Student expertly uses glossaries and dictionaries, including digital resources, to precisely determine the meaning of words and phrases, showcasing advanced vocabulary skills and research abilities."]]}