{"criteria":["Capitalization in Titles","Commas in Addresses","Commas and Quotation Marks in Dialogue","Formation and Use of Possessives","Conventional Spelling","Application of Spelling Patterns and Generalizations","Use of Reference Materials"],"points":[0,1,2,3,4,5],"descriptions":[["No capitalization of appropriate words in titles.","Rarely capitalizes appropriate words in titles; many errors.","Capitalizes some appropriate words in titles, but inconsistencies are present.","Generally capitalizes appropriate words in titles, with a few minor errors.","Consistently capitalizes appropriate words in titles; demonstrates good understanding.","Capitalizes all appropriate words in titles flawlessly, showing mastery."],["No commas used in addresses.","Rarely uses commas in addresses; many errors.","Uses commas in addresses inconsistently.","Generally uses commas correctly in addresses, with a few errors.","Consistently uses commas correctly in addresses; demonstrates good understanding.","Uses commas correctly and flawlessly in addresses, showing mastery."],["No commas or quotation marks used in dialogue.","Rarely uses commas or quotation marks correctly in dialogue; many errors.","Uses commas and quotation marks inconsistently in dialogue.","Generally uses commas and quotation marks correctly in dialogue, with a few errors.","Consistently uses commas and quotation marks correctly in dialogue; demonstrates good understanding.","Uses commas and quotation marks correctly and flawlessly in dialogue, showing mastery."],["Incorrect or absent possessive forms.","Rarely forms or uses possessives correctly; many errors.","Forms and uses some possessives correctly, but inconsistencies are present.","Generally forms and uses possessives correctly, with a few minor errors.","Consistently forms and uses possessives correctly; demonstrates good understanding.","Forms and uses possessives flawlessly, showing mastery."],["Frequent spelling errors hinder understanding.","Many spelling errors in high-frequency and studied words.","Some spelling errors, but meaning generally clear.","Few spelling errors; mostly correct.","Demonstrates strong spelling skills; very few errors.","Exceptional spelling accuracy; virtually no errors."],["No evidence of using spelling patterns or generalizations.","Rarely applies spelling patterns or generalizations.","Applies some spelling patterns or generalizations inconsistently.","Generally applies spelling patterns and generalizations correctly, with minor inconsistencies.","Consistently applies spelling patterns and generalizations effectively.","Masterful application of spelling patterns and generalizations in writing."],["Does not consult reference materials for spelling.","Rarely consults reference materials and makes little to no corrections.","Consults reference materials sometimes but misses errors.","Consults reference materials and corrects some errors.","Regularly consults reference materials and corrects most errors.","Proactively consults reference materials, identifies, and corrects all spelling errors effectively."]]}