{"criteria":["Use of grade-appropriate conversational words and phrases.","Use of grade-appropriate general academic words and phrases.","Use of grade-appropriate domain-specific words and phrases.","Use of words and phrases that signal spatial and temporal relationships"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no use of grade-appropriate conversational words and phrases.","Student demonstrates minimal and inappropriate use of grade-appropriate conversational words and phrases.","Student demonstrates limited use of grade-appropriate conversational words and phrases; usage is often incorrect or out of context.","Student demonstrates adequate use of grade-appropriate conversational words and phrases, but with some inconsistencies or minor errors.","Student demonstrates consistent and accurate use of grade-appropriate conversational words and phrases.","Student demonstrates skillful and nuanced use of grade-appropriate conversational words and phrases, enhancing communication effectively."],["Student demonstrates no use of grade-appropriate general academic words and phrases.","Student demonstrates minimal and inappropriate use of grade-appropriate general academic words and phrases.","Student demonstrates limited use of grade-appropriate general academic words and phrases; usage is often incorrect or out of context.","Student demonstrates adequate use of grade-appropriate general academic words and phrases, but with some inconsistencies or minor errors.","Student demonstrates consistent and accurate use of grade-appropriate general academic words and phrases.","Student demonstrates skillful and nuanced use of grade-appropriate general academic words and phrases, enhancing communication effectively."],["Student demonstrates no use of grade-appropriate domain-specific words and phrases.","Student demonstrates minimal and inappropriate use of grade-appropriate domain-specific words and phrases.","Student demonstrates limited use of grade-appropriate domain-specific words and phrases; usage is often incorrect or out of context.","Student demonstrates adequate use of grade-appropriate domain-specific words and phrases, but with some inconsistencies or minor errors.","Student demonstrates consistent and accurate use of grade-appropriate domain-specific words and phrases.","Student demonstrates skillful and nuanced use of grade-appropriate domain-specific words and phrases, enhancing communication effectively."],["Student demonstrates no use of words and phrases that signal spatial and temporal relationships.","Student demonstrates minimal and inappropriate use of words and phrases that signal spatial and temporal relationships.","Student demonstrates limited use of words and phrases that signal spatial and temporal relationships; usage is often incorrect or confusing.","Student demonstrates adequate use of words and phrases that signal spatial and temporal relationships, but with some inconsistencies or minor errors.","Student demonstrates consistent and accurate use of words and phrases that signal spatial and temporal relationships.","Student demonstrates skillful and nuanced use of words and phrases that signal spatial and temporal relationships, enhancing clarity and context."]]}