{"criteria":["Effective Word Choice for Intended Audience and Purpose","Distinction Between Spoken and Written Conventions","Control of Grammar and Mechanics"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no awareness of word choice and its impact on the audience or purpose. Language is vague, inappropriate, or confusing.","Demonstrates minimal awareness of word choice. Language is simplistic and lacks precision. May contain some inappropriate or ineffective word choices.","Demonstrates basic awareness of word choice. Language is generally appropriate but lacks nuance. Some attempts at effective word choice are evident, but they are not always successful.","Demonstrates satisfactory word choice. Language is appropriate for the audience and purpose. Uses some vivid language, but it may be inconsistent.","Demonstrates strong word choice. Language is precise and engaging, tailored to the audience and purpose. Uses vivid language and demonstrates an understanding of connotation and tone.","Demonstrates exceptional word choice. Language is sophisticated and compelling, demonstrating a masterful command of vocabulary and tone. Enhances the impact on the audience and elevates the overall quality of the work."],["Shows no understanding of the differences between spoken and written English. Uses slang, colloquialisms, and informal language inappropriately in written work.","Shows limited understanding of the differences between spoken and written English. Makes frequent errors in grammar, syntax, and register.","Shows some understanding of the differences between spoken and written English. Makes occasional errors in grammar, syntax, and register.","Shows a good understanding of the differences between spoken and written English. Generally uses appropriate grammar, syntax, and register in written work.","Shows a strong understanding of the differences between spoken and written English. Uses appropriate grammar, syntax, and register consistently in written work. Can effectively adapt language for different contexts.","Shows a sophisticated understanding of the differences between spoken and written English. Uses language with precision and nuance, demonstrating a mastery of both spoken and written conventions. Can effectively manipulate language for rhetorical effect."],["Displays pervasive errors in grammar, mechanics, and spelling that impede understanding.","Displays frequent errors in grammar, mechanics, and spelling that often impede understanding.","Displays some errors in grammar, mechanics, and spelling that occasionally impede understanding.","Displays few errors in grammar, mechanics, and spelling that do not impede understanding.","Displays very few errors in grammar, mechanics, and spelling; errors are negligible.","Displays virtually no errors in grammar, mechanics, and spelling; demonstrates a command of standard written English."]]}