{"criteria":["Understanding Literal vs. Non-Literal Meanings","Identifying Real-Life Connections of Words","Distinguishing Shades of Meaning"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not demonstrate any understanding of the difference between literal and non-literal meanings.","Student struggles to differentiate between literal and non-literal meanings in simple contexts.","Student can identify literal meanings but has difficulty with non-literal meanings.","Student can usually distinguish between literal and non-literal meanings but makes occasional errors.","Student consistently distinguishes between literal and non-literal meanings in most contexts.","Student expertly distinguishes between literal and non-literal meanings, even in complex or nuanced contexts, and can explain the effect of using figurative language."],["Student cannot connect words to real-life examples or uses.","Student struggles to provide real-life examples for given words.","Student can provide basic real-life examples but lacks detail or explanation.","Student identifies real-life connections for common words but struggles with more abstract terms.","Student effectively connects words to relevant real-life scenarios and provides clear descriptions.","Student skillfully connects words to real-life situations, providing insightful and nuanced explanations of their usage and implications."],["Student does not recognize differences in meaning between related words.","Student struggles to differentiate between shades of meaning in related words.","Student identifies some differences in meaning but cannot articulate them clearly.","Student distinguishes between shades of meaning for some related words but struggles with more subtle differences.","Student clearly distinguishes between shades of meaning among related words and provides accurate explanations.","Student expertly distinguishes between subtle shades of meaning, articulating the nuances with precision and providing examples of how these differences affect interpretation."]]}