{"criteria":["Contextual Clues: Ability to use sentence-level context to determine the meaning of words or phrases.","Affix Analysis: Ability to determine word meaning by understanding affixes (prefixes and suffixes).","Root Word Connections: Ability to use known root words to understand the meaning of unfamiliar words.","Resource Utilization: Skill in using glossaries and dictionaries (print and digital) to clarify word meanings."],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of how to use context to determine word meaning.","Student struggles to use context; interpretations are often illogical or unrelated to the provided text.","Student occasionally uses context to infer word meaning, but with limited success or accuracy.","Student usually uses context effectively to determine word meaning, but may occasionally misinterpret more complex sentences.","Student consistently and effectively uses sentence-level context to accurately determine the meaning of unfamiliar words and phrases.","Student expertly uses context, including subtle cues, to determine word meaning and demonstrates a nuanced understanding of language."],["Student shows no understanding of affixes or how they change the meaning of words.","Student is unable to identify common affixes or how they alter word meaning.","Student recognizes some common affixes, but struggles to explain how they change the meaning of base words.","Student can usually determine the meaning of new words with common affixes, but may struggle with less familiar ones.","Student accurately determines word meaning using knowledge of affixes and provides clear explanations of how the affixes change the base word's meaning.","Student expertly deconstructs complex words using affix analysis and applies this knowledge to understand nuanced differences in meaning."],["Student does not recognize root words or understand their relationship to other words.","Student cannot connect known root words to unfamiliar words with the same root.","Student identifies some root words but has difficulty explaining how they relate to the meaning of unfamiliar words.","Student can often use known root words to infer the meaning of new words, but may struggle with words that have multiple meanings.","Student consistently uses root word knowledge to accurately determine the meaning of unfamiliar words and clearly explains the connections.","Student skillfully uses root word analysis to understand complex vocabulary and can identify subtle shifts in meaning based on different usages of the same root."],["Student does not attempt to use resources or is unable to locate relevant information.","Student attempts to use resources, but struggles to find the correct definitions or understand the information provided.","Student uses resources with some success but may not select the most appropriate definition or fully understand its nuances.","Student effectively uses glossaries and dictionaries to clarify word meaning, but may occasionally need guidance in selecting the most relevant definition.","Student independently and accurately uses both print and digital resources to determine the precise meaning of words and phrases, selecting the most appropriate definition for the context.","Student expertly uses a variety of resources (glossaries, dictionaries, and other reference materials) to analyze word meanings and effectively communicates their understanding."]]}