{"criteria":["Understanding Noun Functions: Demonstrates understanding of the roles of nouns (common, proper, abstract) within sentences.","Verb Tense Usage: Correctly forms and uses regular and irregular verb tenses (simple past, present, future).","Subject-Verb and Pronoun-Antecedent Agreement: Maintains agreement between subjects and verbs, and pronouns and their antecedents.","Use of Modifiers: Correctly forms and uses comparative and superlative adjectives and adverbs.","Sentence Structure: Constructs simple, compound, and complex sentences correctly."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of noun functions or types.","Struggles to identify nouns and their basic functions in simple sentences.","Identifies nouns and their functions with limited accuracy; struggles with abstract nouns.","Accurately identifies common and proper nouns and their functions in most sentences; shows basic understanding of abstract nouns.","Demonstrates a strong understanding of noun functions, including abstract nouns, with few errors.","Expertly identifies and explains the nuanced functions of all noun types, including abstract nouns, in complex sentences."],["Unable to form or use verb tenses correctly.","Struggles to form basic verb tenses; frequent errors in usage.","Forms simple verb tenses with limited accuracy; errors in irregular verb forms.","Generally forms verb tenses correctly in simple sentences; occasional errors with irregular verbs.","Demonstrates consistent accuracy in forming and using verb tenses, including irregular forms, with few errors.","Masterfully uses a variety of verb tenses to convey precise meaning and nuance; no errors."],["Demonstrates no understanding of subject-verb or pronoun-antecedent agreement.","Frequent errors in subject-verb and pronoun-antecedent agreement, leading to confusion.","Inconsistent agreement between subjects and verbs, and pronouns and antecedents.","Generally maintains agreement in simple sentences; occasional errors in more complex constructions.","Demonstrates consistent agreement between subjects and verbs, and pronouns and antecedents, in most contexts.","Maintains flawless agreement even in complex and unusual sentence structures; demonstrates a sophisticated understanding of grammatical relationships."],["Unable to form or use comparative\/superlative adjectives\/adverbs.","Struggles to form comparative and superlative forms; misuse of modifiers.","Forms basic comparative and superlative adjectives\/adverbs with limited accuracy.","Generally uses comparative and superlative forms correctly in simple sentences.","Demonstrates accurate use of comparative and superlative adjectives\/adverbs in most contexts.","Masterfully uses comparative and superlative modifiers to enhance writing and convey precise degrees of comparison; no errors."],["Unable to construct complete or coherent sentences.","Only constructs simple sentences with frequent errors in structure.","Constructs simple and some compound sentences with limited accuracy.","Consistently writes simple and compound sentences correctly, attempts complex sentences.","Constructs grammatically correct and varied simple, compound, and complex sentences.","Expertly constructs complex and sophisticated sentences with varied structure and purpose to elevate the quality of writing."]]}