{"criteria":["Contextual Understanding","Use of Affixes and Roots","Reference Material Utilization"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of word meanings within context.","Struggles to infer word meanings from context; relies heavily on direct definitions.","Identifies some word meanings using context but misses nuances or less obvious connections.","Generally determines word meanings from context with reasonable accuracy.","Accurately infers word meanings from context, demonstrating an understanding of complex relationships.","Masterfully determines word meanings from a variety of complex contexts, demonstrating a sophisticated understanding."],["Unable to identify or use Greek and Latin affixes and roots to determine word meaning.","Identifies a few common affixes and roots but struggles to apply them to unfamiliar words.","Uses some affixes and roots to decipher word meaning, but with limited success or accuracy.","Appropriately uses common affixes and roots as clues to determine the meaning of many words.","Confidently and accurately uses a wide range of affixes and roots to decipher the meaning of complex and unfamiliar words.","Demonstrates expert knowledge of Greek and Latin affixes and roots, using them insightfully to analyze and understand complex vocabulary."],["Does not consult reference materials to clarify word meanings.","Attempts to use reference materials but struggles to locate relevant information or interpret entries.","Consults reference materials with some success but may misinterpret information or choose inappropriate definitions.","Uses reference materials effectively to determine and clarify word meanings and identify alternate word choices.","Demonstrates efficient and accurate use of reference materials to clarify precise word meanings, pronunciations, and alternate word choices.","Skillfully uses a variety of reference materials, both print and digital, to gain a comprehensive understanding of word meanings, nuances, and etymologies."]]}