{"criteria":["Capitalization: Demonstrates correct capitalization in various contexts.","Punctuation: Accurately uses commas and quotation marks to mark direct speech and quotations from a text.","Comma Usage in Compound Sentences: Correctly places a comma before a coordinating conjunction in a compound sentence.","Spelling: Spells grade-appropriate words correctly, consulting references when necessary."],"points":[0,1,2,3,4,5],"descriptions":[["Displays no understanding of capitalization rules; frequent errors throughout.","Demonstrates limited understanding of capitalization; makes frequent errors.","Demonstrates some understanding of capitalization; makes several errors.","Demonstrates reasonable understanding of capitalization; makes occasional errors that do not impede understanding.","Demonstrates strong understanding of capitalization; makes few errors.","Demonstrates consistent and accurate use of capitalization in all contexts."],["Displays no understanding of using commas and quotation marks; frequent errors throughout.","Demonstrates limited understanding of using commas and quotation marks; makes frequent errors.","Demonstrates some understanding of using commas and quotation marks; makes several errors.","Demonstrates reasonable understanding of using commas and quotation marks; makes occasional errors that do not impede understanding.","Demonstrates strong understanding of using commas and quotation marks; makes few errors.","Demonstrates consistent and accurate use of commas and quotation marks in all contexts."],["Displays no understanding of comma usage in compound sentences; frequent errors throughout.","Demonstrates limited understanding of comma usage in compound sentences; makes frequent errors.","Demonstrates some understanding of comma usage in compound sentences; makes several errors.","Demonstrates reasonable understanding of comma usage in compound sentences; makes occasional errors.","Demonstrates strong understanding of comma usage in compound sentences; makes few errors.","Demonstrates consistent and accurate use of commas in compound sentences."],["Displays poor spelling skills; frequent misspellings of grade-appropriate words, with no apparent effort to correct them.","Demonstrates limited spelling skills; frequent misspellings of grade-appropriate words, with minimal effort to correct them.","Demonstrates some spelling skills; several misspellings of grade-appropriate words, with some effort to consult references.","Demonstrates reasonable spelling skills; occasional misspellings of grade-appropriate words, consulting references when needed.","Demonstrates strong spelling skills; few misspellings of grade-appropriate words, effectively using references to correct them.","Demonstrates consistent and accurate spelling of grade-appropriate words, effectively using references as needed."]]}