{"criteria":["Demonstrates understanding and accurate use of grade-appropriate general academic vocabulary.","Demonstrates understanding and accurate use of grade-appropriate domain-specific vocabulary related to the topic.","Effectively uses vocabulary to signal precise actions, emotions, or states of being."],"points":[0,1,2,3,4,5],"descriptions":[["No demonstration of understanding or use of academic vocabulary.","Minimal demonstration of understanding or use of academic vocabulary; frequent errors in usage.","Limited demonstration of understanding or use of academic vocabulary; some errors in usage.","Adequate demonstration of understanding and use of academic vocabulary; occasional minor errors in usage.","Good demonstration of understanding and accurate use of academic vocabulary; rare errors in usage.","Excellent and consistent demonstration of understanding and accurate use of academic vocabulary; no errors in usage."],["No demonstration of understanding or use of domain-specific vocabulary.","Minimal demonstration of understanding or use of domain-specific vocabulary; frequent errors in usage.","Limited demonstration of understanding or use of domain-specific vocabulary; some errors in usage.","Adequate demonstration of understanding and use of domain-specific vocabulary; occasional minor errors in usage.","Good demonstration of understanding and accurate use of domain-specific vocabulary; rare errors in usage.","Excellent and consistent demonstration of understanding and accurate use of domain-specific vocabulary; no errors in usage."],["No effective use of vocabulary to signal precise actions, emotions, or states of being.","Limited or ineffective use of vocabulary to signal precise actions, emotions, or states of being; choices are vague or inaccurate.","Some effective use of vocabulary to signal precise actions, emotions, or states of being; choices are sometimes imprecise.","Adequate and appropriate use of vocabulary to signal precise actions, emotions, or states of being; choices are generally clear.","Thoughtful and precise use of vocabulary to signal precise actions, emotions, or states of being; enhances clarity and understanding.","Sophisticated and nuanced use of vocabulary to signal precise actions, emotions, or states of being; demonstrates mastery of language and elevates communication."]]}