{"criteria":["Understanding of Similes and Metaphors","Recognition and Explanation of Idioms, Adages, and Proverbs","Understanding of Antonyms and Synonyms"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not understand or identify similes and metaphors.","Student identifies similes and metaphors with limited accuracy; struggles to explain their meaning in context.","Student identifies similes and metaphors with some accuracy; explanation of meaning in context is basic and may lack depth.","Student accurately identifies similes and metaphors; provides a clear explanation of their meaning in context.","Student accurately identifies similes and metaphors; provides a detailed and insightful explanation of their meaning in context, demonstrating a strong understanding.","Student demonstrates mastery in identifying and explaining similes and metaphors, offering nuanced interpretations and demonstrating sophisticated comprehension in context."],["Student does not recognize or understand idioms, adages, and proverbs.","Student recognizes a few common idioms, adages, and proverbs but struggles to explain their meaning.","Student recognizes some common idioms, adages, and proverbs and provides a basic explanation of their meaning.","Student recognizes and explains the meaning of common idioms, adages, and proverbs accurately.","Student recognizes and explains the meaning of a wide range of idioms, adages, and proverbs, demonstrating a strong understanding.","Student demonstrates comprehensive knowledge of idioms, adages, and proverbs, providing insightful explanations and applying them effectively in context."],["Student does not understand the concept of antonyms and synonyms.","Student struggles to relate words to their antonyms and synonyms.","Student identifies some antonyms and synonyms but with limited accuracy.","Student demonstrates a good understanding of antonyms and synonyms, relating words appropriately.","Student demonstrates a strong understanding of antonyms and synonyms, providing accurate and relevant examples.","Student demonstrates a sophisticated understanding of antonyms and synonyms, distinguishing between similar meanings and providing nuanced examples."]]}