{"criteria":["Use of Interrogative and Relative Pronouns\/Adverbs","Form and Use of Progressive Verb Tenses","Use of Modal Auxiliaries","Adjective Order","Form and Use of Prepositional Phrases","Complete Sentences","Correct Use of Frequently Confused Words"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not use interrogative or relative pronouns and adverbs correctly or at all.","Student uses interrogative and relative pronouns\/adverbs with frequent errors that impede understanding.","Student uses interrogative and relative pronouns\/adverbs with some errors, but the meaning is generally clear.","Student correctly uses most interrogative and relative pronouns\/adverbs with only minor errors.","Student demonstrates skillful use of interrogative and relative pronouns\/adverbs with very few errors.","Student demonstrates mastery in the use of interrogative and relative pronouns\/adverbs, enhancing the clarity and sophistication of their writing\/speaking."],["Student does not demonstrate understanding or use of progressive verb tenses.","Student attempts to use progressive verb tenses, but errors are frequent and confusing.","Student uses progressive verb tenses with some accuracy, but inconsistencies are present.","Student generally uses progressive verb tenses correctly with occasional lapses.","Student demonstrates consistent and correct use of progressive verb tenses.","Student employs progressive verb tenses accurately and effectively to convey nuances in time and action."],["Student does not use modal auxiliaries or demonstrates a lack of understanding of their function.","Student attempts to use modal auxiliaries, but their usage is often incorrect or inappropriate.","Student uses modal auxiliaries with limited accuracy, sometimes conveying unintended meanings.","Student generally uses modal auxiliaries correctly to express various conditions, with few errors.","Student demonstrates a strong command of modal auxiliaries, using them effectively to convey different conditions.","Student uses modal auxiliaries with precision and sophistication to convey subtle shades of meaning."],["Student shows no understanding of conventional adjective order in sentences.","Student frequently misorders adjectives, resulting in awkward or confusing phrasing.","Student occasionally misorders adjectives, but the overall meaning remains understandable.","Student generally orders adjectives correctly according to conventional patterns.","Student consistently orders adjectives correctly, demonstrating attention to detail.","Student demonstrates a nuanced understanding of adjective order, using it to enhance the flow and clarity of their writing\/speaking."],["Student does not use prepositional phrases or demonstrates a lack of understanding of their function.","Student attempts to use prepositional phrases, but their usage is often incorrect or inappropriate.","Student uses prepositional phrases with limited accuracy, sometimes conveying unintended meanings.","Student generally uses prepositional phrases correctly, with few errors.","Student demonstrates a strong command of prepositional phrases, using them effectively.","Student uses prepositional phrases with precision and sophistication to add details and nuance to sentences."],["Student consistently produces sentence fragments and run-ons, demonstrating a lack of understanding of sentence structure.","Student produces frequent sentence fragments and run-ons that impede understanding.","Student produces some sentence fragments and run-ons, but the overall meaning is generally clear.","Student generally produces complete sentences, with only occasional fragments or run-ons.","Student consistently produces complete sentences, demonstrating a strong command of sentence structure.","Student crafts complex and complete sentences with precision and clarity, enhancing the overall impact of their writing\/speaking."],["Student frequently confuses commonly misused words (e.g., to\/too\/two, there\/their\/they're), leading to significant errors in meaning.","Student often confuses commonly misused words, resulting in some confusion for the reader\/listener.","Student occasionally confuses commonly misused words, but the overall meaning remains clear.","Student generally uses commonly misused words correctly, with only minor errors.","Student consistently uses commonly misused words correctly, demonstrating attention to detail.","Student demonstrates mastery of commonly misused words, enhancing the precision and clarity of their writing\/speaking."]]}