{"criteria":["Contextual Understanding","Use of Affixes and Roots","Reference Material Usage"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of how context clues can aid in deciphering word meanings.","Struggles to use context clues; meaning remains unclear or is incorrectly identified.","Can sometimes use context, but understanding is superficial or incomplete.","Uses context to infer the general meaning of words, but may miss nuances or secondary meanings.","Effectively uses context clues to determine the meaning of unfamiliar words with good accuracy.","Masterfully uses context clues, including complex relationships within the text, to precisely determine the meaning of unfamiliar words and phrases, demonstrating nuanced comprehension."],["Unable to identify or use common Greek and Latin affixes and roots to determine word meanings.","Shows minimal awareness of affixes and roots; unable to apply them effectively.","Identifies some affixes and roots but struggles to connect them to the meaning of the whole word.","Uses common affixes and roots to infer the general meaning of words, but accuracy is inconsistent.","Accurately applies knowledge of Greek and Latin affixes and roots to decipher the meaning of words.","Expertly uses knowledge of affixes and roots, even in complex words, to determine precise meanings and demonstrate a strong understanding of word origins."],["Does not attempt to use reference materials or is unable to locate relevant information.","Attempts to use reference materials but struggles to find the correct word or meaning.","Can locate words in reference materials but has difficulty interpreting the definitions or choosing the appropriate meaning.","Uses reference materials to find the general meaning of words, but may not identify the most precise or appropriate definition.","Effectively uses reference materials to determine the precise meaning of words and phrases, including pronunciation and alternate word choices.","Skillfully and efficiently uses a variety of reference materials, both print and digital, to determine precise meanings, pronunciations, and alternate word choices, demonstrating resourcefulness and a deep understanding of language."]]}