{"criteria":["Accuracy of Word\/Phrase Usage","Application of Words\/Phrases in Logical Relationships","Variety of Vocabulary"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding or use of grade-appropriate academic or domain-specific vocabulary.","Uses very few grade-appropriate academic or domain-specific words\/phrases with frequent errors in meaning or context.","Uses some grade-appropriate academic or domain-specific words\/phrases, but demonstrates limited understanding or application; errors are noticeable.","Generally uses grade-appropriate academic or domain-specific words\/phrases accurately, though occasional errors in usage or meaning may be present.","Uses grade-appropriate academic and domain-specific words\/phrases accurately and appropriately, demonstrating a strong understanding of their meanings and contexts.","Uses a wide range of grade-appropriate academic and domain-specific words\/phrases with precision, nuance, and sophistication, enhancing the clarity and impact of communication."],["Shows no understanding of logical relationships between ideas and does not use words\/phrases to signal these relationships.","Attempts to use words\/phrases to signal logical relationships (e.g., contrast, addition), but does so incorrectly or in a confusing manner.","Uses words\/phrases to signal basic logical relationships, but application is inconsistent or inappropriate in some instances.","Generally uses words\/phrases (e.g., however, in addition) to signal logical relationships accurately, enhancing the connection between ideas.","Skillfully uses words\/phrases to signal a variety of logical relationships, clarifying the connections between ideas and enhancing the flow of communication.","Masterfully employs a diverse range of words\/phrases to signal complex logical relationships, creating seamless transitions and demonstrating a sophisticated understanding of rhetorical techniques."],["Vocabulary is very limited.","Vocabulary is limited.","Vocabulary is adequate but lacks variety.","Vocabulary is generally varied and appropriate.","Vocabulary is varied and demonstrates a strong command of language.","Vocabulary is exceptionally varied and sophisticated."]]}