{"criteria":["Understanding and application of conjunctions, prepositions, and interjections.","Formation and use of perfect verb tenses.","Use of verb tense to convey time, sequence, states, and conditions.","Recognition and correction of inappropriate shifts in verb tense.","Use of correlative conjunctions."],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the function of conjunctions, prepositions, and interjections.","Student demonstrates a minimal understanding of the function of conjunctions, prepositions, and interjections with frequent errors.","Student demonstrates a basic understanding of the function of conjunctions, prepositions, and interjections but struggles with application in sentences.","Student demonstrates a satisfactory understanding of the function of conjunctions, prepositions, and interjections and can apply them correctly in simple sentences.","Student demonstrates a strong understanding of the function of conjunctions, prepositions, and interjections and can apply them correctly in a variety of sentence structures.","Student demonstrates a comprehensive understanding of the function of conjunctions, prepositions, and interjections and uses them effectively and creatively in writing and speaking."],["Student is unable to form or use perfect verb tenses.","Student attempts to form perfect verb tenses but with significant errors in formation and usage.","Student can form some perfect verb tenses but struggles with consistent and correct usage.","Student can form and use perfect verb tenses correctly in most instances but may make occasional errors.","Student consistently forms and uses perfect verb tenses correctly to convey time and sequence effectively.","Student demonstrates mastery in forming and using perfect verb tenses, employing them skillfully to add nuance and complexity to writing and speaking."],["Student does not use verb tense to effectively convey time, sequence, states, or conditions.","Student attempts to use verb tense to convey time, sequence, states, or conditions but with frequent errors and confusion.","Student demonstrates a basic understanding of verb tense but struggles to consistently convey time, sequence, states, or conditions accurately.","Student generally uses verb tense correctly to convey time, sequence, states, and conditions but may have occasional lapses in consistency.","Student consistently uses verb tense accurately and effectively to convey time, sequence, states, and conditions.","Student skillfully manipulates verb tense to create specific effects and convey subtle nuances of time, sequence, states, and conditions in writing and speaking."],["Student does not recognize or correct inappropriate shifts in verb tense.","Student occasionally identifies inappropriate shifts in verb tense but struggles to correct them effectively.","Student can recognize some inappropriate shifts in verb tense and attempts to correct them, but with limited success.","Student generally recognizes and corrects inappropriate shifts in verb tense in their own writing and speaking.","Student consistently recognizes and corrects inappropriate shifts in verb tense, demonstrating a strong command of verb tense consistency.","Student demonstrates a keen awareness of verb tense consistency and skillfully corrects even subtle or complex shifts in tense."],["Student does not use correlative conjunctions correctly.","Student attempts to use correlative conjunctions but with frequent errors in pairing and usage.","Student uses some correlative conjunctions correctly but struggles with consistent and accurate application.","Student generally uses correlative conjunctions correctly in simple sentences.","Student consistently uses correlative conjunctions correctly and effectively in a variety of sentence structures.","Student demonstrates a sophisticated understanding of correlative conjunctions and uses them skillfully to enhance clarity and coherence in writing and speaking."]]}