{"criteria":["Interpretation of Figurative Language (Similes and Metaphors)","Understanding of Idioms, Adages, and Proverbs","Application of Word Relationships (Synonyms, Antonyms, Homographs)"],"points":[0,1,2,3,4,5],"descriptions":[["No attempt to interpret figurative language.","Struggles to identify or interpret even simple similes and metaphors; demonstrates significant misunderstanding.","Identifies similes and metaphors but offers inaccurate or incomplete interpretations.","Adequately interprets common similes and metaphors, but may miss nuances or more complex examples.","Accurately interprets a variety of similes and metaphors, demonstrating a good understanding of their meaning in context.","Insightfully interprets complex and nuanced figurative language, demonstrating a sophisticated understanding of its effect on meaning."],["No recognition or understanding of idioms, adages, or proverbs.","Struggles to recognize common idioms, adages, and proverbs; interprets them literally and inappropriately.","Recognizes some common idioms, adages, and proverbs but struggles to explain their meaning or use them correctly.","Understands the general meaning of common idioms, adages, and proverbs, but may struggle with more obscure examples or subtle variations.","Accurately explains the meaning of a variety of idioms, adages, and proverbs, and uses them appropriately in context.","Demonstrates a deep understanding of idioms, adages, and proverbs, including their cultural significance and subtle nuances."],["No understanding of word relationships is demonstrated.","Struggles to identify synonyms, antonyms, or homographs; unable to use these relationships to understand word meanings.","Identifies some synonyms, antonyms, and homographs but struggles to explain how these relationships affect word meaning.","Uses common synonyms, antonyms, and homographs to understand word meanings in a basic way.","Uses a variety of word relationships to enhance understanding of word meanings, demonstrating a strong vocabulary.","Skillfully uses word relationships to understand complex and nuanced word meanings, enriching their own vocabulary and comprehension."]]}