{"criteria":["Sentence Variety","Style and Tone Consistency","Impact on Reader\/Listener"],"points":[0,1,2,3,4,5],"descriptions":[["No discernible variety in sentence structure. Sentences are monotonous and repetitive.","Limited sentence variety. Sentences are mostly simple and similar in structure.","Some attempt at sentence variety, but with limited success. Noticeable repetition in sentence patterns.","Adequate sentence variety. Demonstrates a mix of simple, compound, and complex sentences.","Good sentence variety. Effectively uses a range of sentence structures to enhance meaning and interest.","Excellent sentence variety. Skillfully manipulates sentence structure to create a sophisticated and engaging style."],["Inconsistent style and tone throughout the piece. Shifts in voice and attitude are jarring and inappropriate.","Style and tone are somewhat inconsistent. Noticeable shifts that detract from the overall coherence.","Attempts to maintain a consistent style and tone, but with occasional lapses.","Generally maintains a consistent style and tone appropriate for the intended audience and purpose.","Maintains a consistently engaging and appropriate style and tone throughout the piece.","Masterfully maintains a consistent and compelling style and tone that enhances the overall impact of the work."],["Sentence structure and tone choices detract significantly from clarity and engagement, confusing or alienating the audience.","Sentence structure and tone choices sometimes hinder understanding or engagement. Audience may struggle to connect with the material.","Sentence structure and tone choices have a neutral impact on the audience. Reader\/listener neither particularly engaged nor disengaged.","Sentence structure and tone choices contribute somewhat to clarity and engagement, maintaining audience interest.","Sentence structure and tone choices effectively enhance clarity and engagement, capturing and maintaining audience interest.","Sentence structure and tone choices create a powerful and lasting impact on the reader\/listener, elevating the work to a sophisticated level."]]}