{"criteria":["Interpretation of Figures of Speech","Understanding Word Relationships","Distinguishing Connotations"],"points":[0,1,2,3,4,5],"descriptions":[["No attempt to interpret figurative language.","Struggles to identify and interpret figures of speech; interpretation is often inaccurate or missing.","Identifies some figures of speech but interpretation is superficial or incomplete.","Generally interprets figures of speech accurately, but may miss nuances or deeper meanings.","Demonstrates a strong understanding of figures of speech, providing accurate and insightful interpretations.","Masterfully interprets figures of speech, revealing a deep understanding of their purpose and effect in context."],["Does not recognize relationships between words.","Struggles to identify relationships between words; understanding is limited and often incorrect.","Identifies basic word relationships (e.g., cause\/effect) but struggles with more complex connections.","Understands common word relationships and uses them to infer meaning, but may miss subtle connections.","Demonstrates a strong understanding of various word relationships, using them effectively to enhance comprehension.","Expertly analyzes word relationships, revealing a sophisticated understanding of how words connect and influence each other."],["Unable to distinguish between connotations of similar words.","Confuses connotations of words with similar denotations; demonstrates little awareness of subtle differences.","Recognizes that words have connotations, but struggles to articulate the differences between similar words.","Distinguishes between the connotations of some words with similar denotations, but understanding is not always consistent.","Clearly distinguishes between the connotations of words with similar denotations, providing insightful explanations of their nuances.","Masterfully differentiates between connotations, demonstrating a nuanced understanding of how word choice affects meaning and tone."]]}