{"criteria":["Accuracy in using grade-appropriate vocabulary","Ability to define and use domain-specific words and phrases","Skill in gathering vocabulary knowledge from context"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding or use of grade-appropriate vocabulary.","Demonstrates minimal understanding and infrequent use of grade-appropriate vocabulary; frequent errors.","Demonstrates some understanding and inconsistent use of grade-appropriate vocabulary; noticeable errors.","Demonstrates a general understanding and regular use of grade-appropriate vocabulary; occasional errors.","Demonstrates a strong understanding and consistent use of grade-appropriate vocabulary; rare errors.","Demonstrates a sophisticated understanding and seamless integration of grade-appropriate vocabulary; virtually no errors."],["Unable to define or use domain-specific words and phrases related to the topic.","Struggles to define and use domain-specific words and phrases; definitions are often incorrect or incomplete.","Can define and use some domain-specific words and phrases, but understanding is limited.","Can define and use most domain-specific words and phrases correctly, demonstrating a good understanding.","Demonstrates a strong command of domain-specific words and phrases, using them effectively in context.","Expertly defines and uses domain-specific words and phrases, enhancing comprehension and expression with precision."],["Shows no effort or ability to gather vocabulary knowledge from context.","Rarely attempts to infer meaning from context; struggles to identify relevant clues.","Attempts to infer meaning from context but is often unsuccessful or misinterprets clues.","Can usually infer the meaning of unfamiliar words from context with some accuracy.","Consistently and accurately infers the meaning of unfamiliar words and phrases from context.","Masterfully gathers vocabulary knowledge from context, using nuanced understanding to enhance comprehension and expression."]]}