{"criteria":["Contextual Understanding","Use of Affixes and Roots","Reference Material Usage","Verification of Meaning"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of word meanings in context.","Struggles to use context to infer word meanings; interpretations are often inaccurate.","Can sometimes use context to infer word meanings, but with limited success and occasional inaccuracies.","Generally uses context effectively to infer word meanings, with reasonable accuracy.","Consistently and accurately uses context to determine the meaning of unfamiliar words and phrases.","Masterfully uses context to determine nuanced meanings of complex words and phrases, demonstrating a sophisticated understanding."],["Unable to identify or use common Greek or Latin affixes and roots.","Identifies a few affixes\/roots but struggles to apply them to determine word meanings.","Can identify some affixes\/roots and occasionally use them to infer word meanings, but with limited accuracy.","Uses common affixes\/roots to infer word meanings with reasonable accuracy.","Confidently and accurately uses common affixes\/roots to determine the meaning of unfamiliar words.","Skillfully applies knowledge of affixes\/roots to decipher complex and less common words, demonstrating a deep understanding of word origins."],["Does not use reference materials to determine word meanings.","Attempts to use reference materials but struggles with navigation or interpretation.","Can use reference materials to find basic definitions but struggles with precise meanings or parts of speech.","Uses reference materials effectively to find pronunciations and determine precise meanings and parts of speech.","Efficiently and accurately uses a variety of reference materials (print and digital) to clarify word meanings and usage.","Demonstrates expert use of reference materials, including the ability to synthesize information from multiple sources to achieve a comprehensive understanding of word meanings."],["Does not attempt to verify the meaning of words.","Attempts to verify meaning but struggles with the process or accuracy.","Sometimes verifies meaning by checking context or a dictionary, but inconsistently.","Regularly verifies the meaning of words by checking context or a dictionary.","Consistently verifies preliminary determinations of word meanings, ensuring accuracy.","Critically evaluates and synthesizes information from multiple sources to confirm and refine understanding of word meanings."]]}