{"criteria":["Pronoun Case Accuracy: Demonstrates correct use of subjective, objective, and possessive pronoun cases.","Intensive Pronoun Usage: Uses intensive pronouns (e.g., myself, ourselves) correctly.","Pronoun Number and Person Consistency: Avoids inappropriate shifts in pronoun number and person.","Pronoun Clarity: Avoids vague pronouns with unclear or ambiguous antecedents.","Recognition and Correction of Non-Standard English: Identifies and corrects variations from standard English in writing and speaking."],"points":[0,1,2,3,4,5],"descriptions":[["Pronoun case errors are frequent and demonstrate a lack of understanding.","Pronoun case errors are noticeable and sometimes interfere with meaning.","Pronoun case errors are present but do not significantly impede understanding.","Generally uses correct pronoun cases; occasional minor errors are present.","Demonstrates strong command of pronoun cases with very few errors.","Demonstrates consistent and accurate use of pronoun cases in all contexts."],["Misuses or omits intensive pronouns, demonstrating a lack of understanding.","Attempts to use intensive pronouns, but errors are frequent.","Uses some intensive pronouns correctly, but errors are present.","Generally uses intensive pronouns correctly; occasional errors may occur.","Demonstrates a strong understanding of intensive pronoun usage with very few errors.","Uses intensive pronouns correctly and effectively to enhance writing."],["Frequent and confusing shifts in pronoun number and person.","Noticeable shifts in pronoun number and person that sometimes interfere with meaning.","Some shifts in pronoun number and person, but meaning is generally clear.","Generally maintains consistent pronoun number and person; occasional minor shifts are present.","Demonstrates strong consistency in pronoun number and person with very few errors.","Maintains consistent pronoun number and person throughout the writing."],["Pronouns are frequently vague and confusing, making it difficult to understand antecedents.","Pronouns are sometimes vague, and antecedents are occasionally unclear.","Pronouns are generally clear, but some instances of vague antecedents exist.","Pronoun antecedents are generally clear; occasional minor ambiguities may be present.","Demonstrates strong pronoun clarity with very few instances of vague antecedents.","Pronoun references are consistently clear and unambiguous throughout the writing."],["Does not recognize or attempt to correct variations from standard English.","Recognizes some variations from standard English but struggles to correct them.","Identifies some variations and makes limited corrections; errors remain.","Recognizes most variations and makes some corrections; some errors may persist.","Identifies and corrects most variations from standard English with few errors.","Consistently identifies and corrects variations from standard English, demonstrating strong command of conventional language."]]}