{"criteria":["Understanding of Phrase and Clause Function","Effective Use of Sentence Structure","Placement of Modifiers"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of phrases and clauses or their function in sentences.","Shows minimal understanding of phrases and clauses; struggles to identify their function in sentences.","Identifies phrases and clauses but has difficulty explaining their specific function in most sentences.","Explains the function of phrases and clauses in simple sentences but struggles with more complex examples.","Clearly explains the function of phrases and clauses in a variety of sentences, demonstrating a solid understanding.","Masterfully explains the function of phrases and clauses in complex sentences and can apply this understanding to improve writing."],["Unable to differentiate between simple, compound, complex, and compound-complex sentences.","Identifies some sentence structures but cannot effectively use them to convey different relationships between ideas.","Uses simple and compound sentences correctly, but struggles with complex and compound-complex structures.","Uses a variety of sentence structures, but the choices do not always effectively signal the intended relationships between ideas.","Chooses among sentence structures to clearly signal differing relationships among ideas, enhancing the clarity of writing.","Skillfully manipulates sentence structure to create nuanced relationships between ideas, adding depth and sophistication to writing."],["Frequently misplaces modifiers, leading to unclear or nonsensical sentences; unable to identify dangling modifiers.","Sometimes misplaces modifiers; struggles to correct misplaced and dangling modifiers.","Corrects some misplaced modifiers but misses others; identifies some dangling modifiers but not consistently.","Mostly places modifiers correctly; identifies and corrects most misplaced and dangling modifiers.","Places modifiers effectively to enhance meaning; consistently identifies and corrects misplaced and dangling modifiers.","Demonstrates precise control over modifier placement, using them to create stylistic effects; expertly identifies and corrects even subtle errors in modifier placement."]]}