{"criteria":["Interpretation of Figurative Language","Understanding Word Relationships","Discernment of Connotations"],"points":[0,1,2,3,4,5],"descriptions":[["No attempt to interpret figurative language or allusions.","Struggles to identify or interpret even simple figures of speech; literal understanding dominates.","Identifies basic figures of speech but struggles with complex or nuanced allusions; interpretation is often superficial.","Generally interprets figures of speech and allusions accurately, but may miss subtle connotations or deeper meanings.","Demonstrates a strong understanding of figurative language, including literary, biblical, and mythological allusions, in context; insightful interpretations.","Exhibits a sophisticated and nuanced understanding of figurative language; skillfully interprets complex allusions and their implications within the text."],["Unable to identify or explain relationships between words.","Struggles to recognize basic word relationships such as synonyms or antonyms; limited vocabulary understanding.","Identifies some word relationships but struggles to apply this knowledge to understand unfamiliar words or complex texts.","Uses word relationships to understand the meaning of unfamiliar words with some success; can identify synonyms, antonyms, and analogies.","Effectively uses word relationships (synonyms, antonyms, analogies) to enhance understanding of vocabulary and complex texts; clear explanations.","Masterfully uses word relationships to unlock nuanced meanings and make insightful connections between words, demonstrating a rich vocabulary and sophisticated understanding."],["Does not recognize or understand the concept of connotation.","Confuses denotation and connotation; unable to distinguish between similar words with different associations.","Recognizes that words can have different connotations but struggles to articulate the nuances; limited understanding of the impact of word choice.","Distinguishes between the connotations of words with similar denotations with reasonable accuracy; recognizes the impact of word choice on tone and meaning.","Demonstrates a strong ability to discern subtle differences in connotation between words; effectively uses connotation to enhance writing and understanding.","Exhibits a masterful command of connotation, using it to create specific effects and convey complex meanings; demonstrates a deep understanding of the power of word choice."]]}