{"criteria":["Contextual Understanding","Use of Affixes and Roots","Reference Material Usage","Verification of Word Meaning"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of how context clues can aid in determining word meaning.","Struggles to use context clues to infer the meaning of unfamiliar words or phrases.","Can sometimes use context clues to infer the meaning of simple words, but struggles with complex sentences or paragraphs.","Consistently uses context clues to determine the meaning of most unfamiliar words and phrases, showing a good understanding of sentence structure.","Skillfully uses context clues, including complex sentence structures and paragraph organization, to accurately determine the meaning of unfamiliar words and phrases.","Masterfully and insightfully uses context clues to determine nuanced meanings of words and phrases, even in complex or ambiguous texts; demonstrates a sophisticated understanding of how context shapes meaning."],["Unable to identify or use common Greek or Latin affixes and roots to determine word meaning.","Shows limited awareness of affixes and roots; unable to apply this knowledge to decipher word meanings.","Can identify a few common affixes and roots, but struggles to connect them to the meaning of unfamiliar words.","Uses common affixes and roots effectively to determine the meaning of many unfamiliar words, demonstrating a solid understanding of word origins.","Confidently and accurately uses a wide range of Greek and Latin affixes and roots to determine the meaning of complex and unfamiliar words.","Demonstrates expert-level knowledge of Greek and Latin affixes and roots, using them to unlock the meaning of obscure or technical vocabulary with precision and insight; can explain the etymological connections between words."],["Does not consult reference materials to clarify word meanings.","Reluctant to use reference materials or uses them ineffectively.","Consults reference materials but struggles to locate relevant information or misinterprets definitions.","Uses dictionaries, glossaries, and thesauruses to effectively determine or clarify the meaning of words, including pronunciation and part of speech.","Critically evaluates and compares information from multiple reference sources (print and digital) to determine the most precise meaning of a word, including its etymology.","Selects and uses reference materials with exceptional skill, demonstrating a nuanced understanding of their strengths and limitations; adeptly synthesizes information from various sources to construct comprehensive definitions and etymological analyses."],["Accepts the first definition encountered without verification.","Rarely attempts to verify the meaning of a word.","Sometimes attempts to verify word meaning but does so inconsistently or ineffectively.","Consistently verifies the inferred meaning of words by checking in context and\/or in a dictionary.","Independently and thoughtfully verifies word meanings, using multiple strategies to ensure accuracy and appropriateness in the given context.","Demonstrates a sophisticated and reflective approach to verifying word meanings, considering subtle nuances of language and employing a range of strategies to confirm understanding; identifies and resolves ambiguities with exceptional clarity."]]}