{"criteria":["Accurate Use of Grade-Appropriate Vocabulary","Application of Domain-Specific Words and Phrases","Vocabulary Knowledge Gathering Strategies"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding or use of grade-appropriate vocabulary.","Demonstrates very limited understanding and use of grade-appropriate vocabulary; relies heavily on basic words.","Demonstrates some understanding and use of grade-appropriate vocabulary, but with frequent errors or misapplication.","Demonstrates adequate understanding and use of grade-appropriate vocabulary, with occasional errors; vocabulary is generally appropriate for the context.","Demonstrates strong understanding and accurate use of grade-appropriate vocabulary; enhances communication with precise word choices.","Demonstrates sophisticated understanding and masterful use of grade-appropriate vocabulary; elevates communication with nuanced and precise word choices."],["Does not attempt to use domain-specific words or phrases.","Attempts to use domain-specific words or phrases, but demonstrates little understanding or incorrect usage.","Uses domain-specific words and phrases with limited accuracy or understanding; usage is often forced or out of context.","Appropriately uses domain-specific words and phrases, demonstrating a general understanding of their meaning and context.","Skillfully incorporates domain-specific words and phrases, enhancing communication and demonstrating a strong understanding of their nuances.","Masterfully integrates domain-specific words and phrases, elevating communication and demonstrating a comprehensive and nuanced understanding."],["Shows no awareness of strategies for gathering vocabulary knowledge.","Demonstrates limited awareness of strategies for gathering vocabulary knowledge; unable to apply them effectively.","Identifies some strategies for gathering vocabulary knowledge, but struggles to apply them consistently or effectively.","Applies basic strategies for gathering vocabulary knowledge (e.g., using a dictionary) with some success.","Effectively employs a variety of strategies for gathering vocabulary knowledge, such as context clues, root words, and affixes.","Independently and strategically selects and applies a wide range of resources to expand vocabulary knowledge; demonstrates a proactive approach to learning new words."]]}