{
  "criteria": [
    "Understanding and Application of Verbals (Gerunds, Participles, Infinitives)",
    "Formation and Use of Active and Passive Voice",
    "Formation and Use of Verb Moods (Indicative, Imperative, Interrogative, Conditional, Subjunctive)",
    "Recognition and Correction of Inappropriate Shifts in Verb Voice and Mood"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of verbals or their function in sentences.",
      "Student shows minimal understanding of verbals and struggles to identify them in sentences.",
      "Student identifies verbals in simple sentences but struggles with complex sentences or their specific functions.",
      "Student identifies verbals and their basic functions in most sentences, but may have occasional errors.",
      "Student demonstrates a strong understanding of verbals and their functions, applying this knowledge effectively in writing and speaking.",
      "Student demonstrates a comprehensive understanding of verbals, using them skillfully and accurately in various contexts to enhance their writing and speaking."
    ],
    [
      "Student does not understand or cannot form active or passive voice.",
      "Student struggles to form active and passive voice, with frequent errors in construction.",
      "Student can form simple active and passive sentences, but struggles with more complex constructions or transformations.",
      "Student generally forms active and passive voice correctly, but may make occasional errors in tense or agreement.",
      "Student demonstrates proficient use of active and passive voice, using them appropriately and effectively in their writing.",
      "Student skillfully manipulates active and passive voice to achieve specific rhetorical effects, demonstrating mastery of this concept."
    ],
    [
      "Student does not demonstrate understanding of different verb moods.",
      "Student shows minimal understanding of verb moods and struggles to form them correctly.",
      "Student can form basic sentences in indicative, imperative, and interrogative moods, but struggles with conditional and subjunctive.",
      "Student forms sentences in most verb moods correctly, but may have occasional errors in more complex or nuanced situations.",
      "Student demonstrates consistent and accurate use of all verb moods in their writing and speaking.",
      "Student expertly uses different verb moods to convey precise meaning and tone, demonstrating a sophisticated understanding of their function."
    ],
    [
      "Student does not recognize inappropriate shifts in verb voice or mood.",
      "Student struggles to identify shifts in verb voice or mood, even when they are obvious.",
      "Student can identify some shifts in verb voice or mood, but struggles to correct them effectively.",
      "Student generally recognizes and corrects inappropriate shifts, but may miss subtle errors.",
      "Student consistently identifies and corrects inappropriate shifts in verb voice and mood, demonstrating a strong command of grammar.",
      "Student demonstrates an exceptional ability to maintain consistency in verb voice and mood, enhancing the clarity and effectiveness of their writing."
    ]
  ]
}