{"criteria":["Command of Conventions","Use of Upper- and Lowercase Letters","Use of Nouns and Verbs","Formation of Plural Nouns","Understanding and Use of Question Words","Use of Prepositions","Production of Complete Sentences"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of standard English grammar and usage. Writing or speaking is incomprehensible.","The student demonstrates a very limited understanding of standard English grammar and usage. Errors frequently impede communication.","The student demonstrates a basic understanding of standard English grammar and usage, but with frequent errors that sometimes impede communication.","The student demonstrates a satisfactory understanding of standard English grammar and usage, with some errors that do not significantly impede communication.","The student demonstrates a strong understanding of standard English grammar and usage, with only occasional minor errors.","The student demonstrates a comprehensive and nuanced understanding of standard English grammar and usage, exhibiting virtually no errors in writing or speaking."],["The student demonstrates no ability to use upper- and lowercase letters correctly.","The student prints very few upper- and lowercase letters correctly.","The student prints some upper- and lowercase letters correctly, but with frequent errors.","The student prints most upper- and lowercase letters correctly, with occasional errors.","The student prints nearly all upper- and lowercase letters correctly.","The student consistently and accurately prints upper- and lowercase letters."],["The student does not use frequently occurring nouns and verbs.","The student uses very few frequently occurring nouns and verbs.","The student uses some frequently occurring nouns and verbs, but inappropriately or incorrectly.","The student uses frequently occurring nouns and verbs adequately, but with limited variety.","The student uses a good range of frequently occurring nouns and verbs correctly.","The student effectively and creatively uses a wide range of frequently occurring nouns and verbs."],["The student does not form regular plural nouns orally.","The student forms very few regular plural nouns correctly.","The student attempts to form regular plural nouns, but with frequent errors.","The student forms most regular plural nouns correctly.","The student consistently forms regular plural nouns correctly.","The student flawlessly forms regular plural nouns orally, even in complex sentences."],["The student does not understand or use question words (interrogatives).","The student demonstrates very limited understanding of question words.","The student uses question words incorrectly or inappropriately.","The student uses basic question words adequately.","The student uses a variety of question words correctly.","The student effectively and creatively uses a wide range of question words to elicit detailed information."],["The student does not use prepositions.","The student uses very few prepositions.","The student uses prepositions incorrectly or inappropriately.","The student uses common prepositions adequately.","The student uses a variety of prepositions correctly.","The student effectively and creatively uses a wide range of prepositions to convey precise meaning."],["The student is unable to produce complete sentences.","The student produces very few complete sentences.","The student produces incomplete or grammatically incorrect sentences.","The student produces basic complete sentences adequately.","The student produces a variety of complete sentences correctly.","The student effectively and creatively produces complex and varied complete sentences in shared language activities."]]}