{"criteria":["Capitalization","Punctuation","Spelling"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of capitalization rules; frequent errors throughout the writing.","Demonstrates limited understanding of capitalization rules; makes frequent errors, especially with proper nouns and the beginning of sentences.","Demonstrates some understanding of capitalization rules; makes occasional errors with proper nouns, the beginning of sentences, or the pronoun 'I'.","Demonstrates a general understanding of capitalization rules; makes few errors, mostly with less common proper nouns.","Demonstrates a strong understanding of capitalization rules; makes very few, if any, errors in capitalization.","Demonstrates a comprehensive understanding of capitalization rules; applies capitalization flawlessly and demonstrates an awareness of stylistic choices."],["Demonstrates no understanding of punctuation rules; frequent errors throughout the writing, hindering readability.","Demonstrates limited understanding of punctuation rules; misses most end punctuation and uses commas and other punctuation marks incorrectly.","Demonstrates some understanding of punctuation rules; uses end punctuation inconsistently and makes several errors with commas, apostrophes, and quotation marks.","Demonstrates a general understanding of punctuation rules; uses end punctuation correctly most of the time and makes occasional errors with internal punctuation.","Demonstrates a strong understanding of punctuation rules; uses punctuation accurately and effectively with only minor errors.","Demonstrates a comprehensive understanding of punctuation rules; uses punctuation flawlessly to enhance clarity and style."],["Demonstrates no understanding of spelling; numerous errors make the writing incomprehensible.","Demonstrates limited understanding of spelling; misspells many simple words and shows no awareness of common spelling patterns.","Demonstrates some understanding of spelling; misspells several common words and relies heavily on phonetic spelling.","Demonstrates a general understanding of spelling; misspells a few common words and shows an awareness of basic spelling rules.","Demonstrates a strong understanding of spelling; spells most words correctly and uses a variety of strategies to correct errors.","Demonstrates a comprehensive understanding of spelling; spells nearly all words correctly, including complex and less common words."]]}