{"criteria":["Categorization & Antonyms","Real-Life Connections","Shades of Meaning (Verbs)"],"points":[0,1,2,3,4,5],"descriptions":[["Student shows no understanding of word relationships or nuances in word meanings.","Student attempts to sort objects or identify antonyms but demonstrates significant difficulty, requiring constant adult support.","Student sorts a few common objects into categories with adult guidance. Student identifies a few antonyms with prompting.","Student independently sorts common objects into basic categories and identifies some frequently occurring antonyms.","Student sorts common objects into more complex categories and accurately identifies most frequently occurring antonyms.","Student independently and accurately sorts objects into nuanced categories, demonstrating a strong understanding of antonyms and their relationship to the original words."],["Student is unable to make any real-life connections between words and their uses.","Student struggles to connect words to real-life contexts, even with direct prompting and examples.","Student identifies one or two basic connections between words and their uses with significant adult assistance.","Student identifies several real-life connections between words and their uses with some prompting.","Student independently identifies numerous connections between words and their uses in various real-life contexts.","Student fluently connects words to real-life contexts, providing insightful examples and demonstrating a keen awareness of language in everyday life."],["Student does not participate in or understand the differences in meaning between similar verbs.","Student attempts to act out verbs but shows no differentiation between their meanings, even with support.","Student acts out the meanings of some verbs but struggles to differentiate between similar actions.","Student acts out the meanings of several verbs and begins to distinguish between similar actions with prompting.","Student effectively acts out the meanings of different verbs and can distinguish between shades of meaning among similar actions.","Student creatively and accurately acts out the meanings of verbs, demonstrating a nuanced understanding of subtle differences in meaning between similar actions."]]}