{"criteria":["Understanding Word Meanings and Context","Applying New Meanings to Familiar Words","Using Inflections and Affixes"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of how to determine the meaning of unknown words or phrases.","Student demonstrates a minimal understanding, struggling to identify new meanings or use inflections\/affixes.","Student shows some understanding, able to occasionally identify new meanings or use inflections\/affixes with prompting.","Student demonstrates a satisfactory understanding, generally able to identify new meanings and use common inflections\/affixes but with some errors.","Student demonstrates a strong understanding, able to accurately identify new meanings for familiar words and use inflections\/affixes to determine meaning effectively.","Student demonstrates an exceptional understanding, skillfully identifying new meanings for familiar words and adeptly using inflections\/affixes to decipher the meaning of complex words, showcasing mastery of the skill."],["Student cannot identify or apply new meanings to familiar words.","Student struggles to identify new meanings and requires significant assistance to apply them.","Student identifies some new meanings but has difficulty applying them accurately.","Student identifies new meanings and applies them with moderate accuracy, occasionally making errors.","Student consistently identifies new meanings and applies them accurately in most contexts.","Student masterfully identifies new meanings and applies them accurately and insightfully across a variety of contexts, demonstrating a nuanced understanding."],["Student does not recognize or use inflections and affixes to understand word meanings.","Student shows minimal awareness of inflections and affixes, unable to use them to determine meaning.","Student attempts to use inflections and affixes but struggles with accuracy and consistency.","Student uses common inflections and affixes to understand word meanings with reasonable accuracy.","Student effectively uses a variety of inflections and affixes to accurately determine the meaning of unknown words.","Student expertly uses a wide range of inflections and affixes to deduce the meanings of complex and unfamiliar words, displaying advanced comprehension."]]}