{"criteria":["Identification and Explanation of Literary Devices and Figurative Language","Use of Textual Evidence","Organization and Clarity"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of literary devices or figurative language.","The student identifies literary devices or figurative language with significant inaccuracies.","The student identifies some literary devices and figurative language but struggles to explain their effect.","The student identifies literary devices and figurative language and explains their effect with some limitations.","The student proficiently identifies literary devices and figurative language, explaining their effect on the text with clarity.","The student expertly identifies and analyzes literary devices and figurative language, providing insightful commentary on their impact on the text's meaning and tone."],["The student provides no relevant textual evidence.","The student provides textual evidence that is irrelevant or inaccurately cited.","The student provides some textual evidence, but it is weakly connected to their claims.","The student provides adequate textual evidence to support their claims, but analysis is superficial.","The student provides well-chosen textual evidence to support their claims with clear and relevant analysis.","The student provides compelling and insightful textual evidence, offering a nuanced and sophisticated analysis of its significance."],["The student's response lacks a clear organizational structure and is difficult to follow.","The student's response has minimal organization and contains frequent digressions.","The student's response has a discernible structure but lacks coherence in some areas.","The student's response is generally organized with a clear progression of ideas.","The student's response is well-organized and logically structured, enhancing the clarity of their analysis.","The student's response is exceptionally well-organized, demonstrating a sophisticated understanding of argumentation and rhetorical techniques to enhance their analysis."]]}