{
  "criteria": [
    "Response to Sensory Stimuli",
    "Exploration of Locomotor and Non-Locomotor Movements"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student shows no attempt to respond in movement to any sensory stimuli.",
      "Student demonstrates a minimal and unclear response to sensory stimuli; movement is hesitant and lacks connection to the stimulus.",
      "Student shows a basic response to at least one type of sensory stimuli, but the movement is somewhat disconnected or predictable.",
      "Student effectively responds to a variety of sensory stimuli with some creativity and connection evident in their movement choices.",
      "Student fluidly and creatively responds to a range of sensory stimuli, demonstrating a clear connection between the stimuli and their movement expressions.",
      "Student demonstrates an exceptional and innovative response to a wide variety of sensory stimuli; movement is highly expressive, nuanced, and fully integrated with the stimuli."
    ],
    [
      "Student shows no attempt to explore different ways of performing basic locomotor and non-locomotor movements.",
      "Student attempts to find different ways to perform movements, but the variations are minimal and lack creativity.",
      "Student finds one or two different ways to perform basic movements, but the changes are somewhat superficial.",
      "Student finds several different ways to perform basic locomotor and non-locomotor movements, demonstrating some understanding of movement principles.",
      "Student effectively explores and finds diverse ways to perform basic movements, showing a good understanding of movement principles and body awareness.",
      "Student demonstrates exceptional creativity and innovation in finding diverse ways to perform basic locomotor and non-locomotor movements; movement is highly refined, expressive, and demonstrates a deep understanding of movement principles."
    ]
  ]
}