{
  "criteria": [
    "Exploration of Stimuli and Movement Relationship",
    "Experimentation with Dance Elements and Personal Movement",
    "Analysis of Process"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No exploration of stimuli is evident; no connection between stimuli and movement.",
      "Minimal exploration of stimuli; a weak connection between stimuli and movement.",
      "Basic exploration of stimuli; a somewhat clear connection between stimuli and movement.",
      "Adequate exploration of stimuli; a clear and intentional connection between stimuli and movement is demonstrated.",
      "Thorough exploration of a variety of stimuli; the relationship between stimuli and movement is insightful and well-articulated.",
      "Extensive and creative exploration of diverse stimuli; the relationship between stimuli and movement is deeply insightful, transformative, and demonstrates a sophisticated understanding."
    ],
    [
      "No experimentation with dance elements; no awareness of personal movement preferences or strengths.",
      "Minimal experimentation with dance elements; limited awareness of personal movement preferences or strengths.",
      "Basic experimentation with dance elements; some awareness of personal movement preferences and strengths.",
      "Adequate experimentation with dance elements; clear awareness of personal movement preferences and strengths is demonstrated.",
      "Thoughtful and intentional experimentation with dance elements; movements challenge skills and build on strengths in a noticeable way.",
      "Sophisticated and innovative experimentation with dance elements; movements demonstrate significant challenge to skills, build substantially on strengths, and exhibit originality."
    ],
    [
      "No analysis of the choreographic process is evident.",
      "Minimal attempt to analyze the choreographic process.",
      "Basic description of the choreographic process with limited analysis.",
      "Clear analysis of the choreographic process, identifying key decisions and their impact.",
      "Thoughtful and insightful analysis of the choreographic process, demonstrating a strong understanding of choices made and their artistic consequences.",
      "Deep and reflective analysis of the choreographic process, revealing a sophisticated understanding of the creative journey and its impact on the final dance study."
    ]
  ]
}