{"criteria":["Spelling-Sound Correspondences for Consonant Digraphs","Decoding One-Syllable Words","Final -e and Vowel Team Conventions","Syllable Identification","Decoding Two-Syllable Words","Reading Inflectional Endings","Irregularly Spelled Words"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of spelling-sound correspondences for consonant digraphs.","Student demonstrates a limited understanding of spelling-sound correspondences for consonant digraphs, with frequent errors.","Student demonstrates a partial understanding of spelling-sound correspondences for consonant digraphs, with some errors.","Student demonstrates an adequate understanding of spelling-sound correspondences for consonant digraphs, with occasional errors.","Student demonstrates a strong understanding of spelling-sound correspondences for consonant digraphs, with few errors.","Student demonstrates a comprehensive understanding of spelling-sound correspondences for consonant digraphs, with no errors."],["Student is unable to decode regularly spelled one-syllable words.","Student decodes regularly spelled one-syllable words with significant difficulty and many errors.","Student decodes regularly spelled one-syllable words with some difficulty and frequent errors.","Student decodes regularly spelled one-syllable words with moderate accuracy and occasional errors.","Student decodes regularly spelled one-syllable words accurately with few errors.","Student consistently and accurately decodes regularly spelled one-syllable words."],["Student does not recognize or apply final -e and common vowel team conventions.","Student demonstrates minimal recognition and application of final -e and common vowel team conventions, with many errors.","Student demonstrates some recognition and application of final -e and common vowel team conventions, with frequent errors.","Student demonstrates adequate recognition and application of final -e and common vowel team conventions, with occasional errors.","Student demonstrates strong recognition and application of final -e and common vowel team conventions, with few errors.","Student consistently and accurately recognizes and applies final -e and common vowel team conventions."],["Student is unable to determine the number of syllables in a printed word.","Student attempts to determine syllables but is largely inaccurate.","Student can sometimes identify the number of syllables, but with frequent errors.","Student can usually identify the number of syllables, but with occasional errors.","Student accurately identifies the number of syllables in most words.","Student consistently and accurately determines the number of syllables in printed words."],["Student cannot decode two-syllable words.","Student attempts to decode two-syllable words but is largely unsuccessful.","Student decodes two-syllable words with significant difficulty and many errors.","Student decodes two-syllable words with moderate accuracy and occasional errors.","Student decodes two-syllable words accurately with few errors.","Student consistently and accurately decodes two-syllable words."],["Student struggles to read words with inflectional endings.","Student reads words with inflectional endings with significant difficulty and frequent errors.","Student reads words with inflectional endings with some difficulty and occasional errors.","Student reads words with inflectional endings with moderate accuracy.","Student reads words with inflectional endings accurately with few errors.","Student consistently and accurately reads words with inflectional endings."],["Student cannot recognize or read grade-appropriate irregularly spelled words.","Student demonstrates minimal recognition of irregularly spelled words, with frequent errors.","Student recognizes some irregularly spelled words, but with frequent errors.","Student recognizes and reads many irregularly spelled words with some accuracy.","Student recognizes and reads most grade-appropriate irregularly spelled words accurately.","Student consistently and accurately recognizes and reads grade-appropriate irregularly spelled words."]]}