{"criteria":["Distinguishing Long and Short Vowel Sounds","Blending Sounds to Produce Words","Isolating and Pronouncing Sounds","Segmenting Words into Sounds"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of vowel sounds.","Student can sometimes distinguish long from short vowel sounds in isolation.","Student can distinguish long from short vowel sounds in most spoken single-syllable words with prompting.","Student consistently distinguishes long from short vowel sounds in spoken single-syllable words.","Student accurately distinguishes and explains the difference between long and short vowel sounds in various contexts.","Student expertly distinguishes and applies knowledge of long and short vowel sounds, even in complex phonetic situations."],["Student is unable to blend sounds to produce words.","Student attempts to blend sounds but struggles significantly.","Student can blend some sounds to produce single-syllable words with assistance.","Student can orally produce single-syllable words by blending sounds (phonemes), including consonant blends with few mistakes.","Student fluently and accurately produces single-syllable words by blending sounds (phonemes), including complex consonant blends.","Student expertly blends sounds to create words and can explain the phonetic principles behind blending."],["Student cannot isolate or pronounce initial, medial, and final sounds.","Student can occasionally isolate or pronounce some sounds with significant difficulty.","Student can isolate and pronounce initial, medial vowel, or final sounds in simple words with help.","Student can isolate and pronounce initial, medial vowel, and final sounds in most spoken single-syllable words.","Student accurately isolates and pronounces initial, medial vowel, and final sounds in a variety of spoken single-syllable words.","Student expertly isolates and pronounces all sounds in spoken words and can articulate the rules governing phoneme pronunciation."],["Student is unable to segment words into individual sounds.","Student attempts to segment words but cannot identify all sounds.","Student can segment simple words into some of their individual sounds with assistance.","Student segments spoken single-syllable words into their complete sequence of individual sounds (phonemes) with few errors.","Student accurately segments spoken single-syllable words into their complete sequence of individual sounds (phonemes).","Student expertly segments words into individual sounds and can explain the concept of phonemic awareness."]]}