{"criteria":["Decoding one-syllable words with long and short vowels.","Knowledge of spelling-sound correspondences for common vowel teams.","Decoding two-syllable words with long vowels.","Decoding words with common prefixes and suffixes.","Identifying words with inconsistent but common spelling-sound correspondences.","Recognizing and reading grade-appropriate irregularly spelled words."],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no ability to decode one-syllable words with long and short vowels.","Student demonstrates limited ability to decode one-syllable words with long and short vowels, with frequent errors.","Student demonstrates some ability to decode one-syllable words with long and short vowels, but requires assistance.","Student can decode most one-syllable words with long and short vowels accurately, with occasional errors.","Student consistently decodes one-syllable words with long and short vowels accurately.","Student fluently and accurately decodes one-syllable words with long and short vowels and can explain the vowel patterns."],["Student demonstrates no knowledge of spelling-sound correspondences for common vowel teams.","Student demonstrates limited knowledge of spelling-sound correspondences for common vowel teams, with frequent errors.","Student demonstrates some knowledge of spelling-sound correspondences for common vowel teams, but requires assistance.","Student knows most spelling-sound correspondences for common vowel teams, with occasional errors.","Student consistently and accurately applies spelling-sound correspondences for common vowel teams.","Student fluently and accurately applies spelling-sound correspondences for common vowel teams and can identify less common vowel teams."],["Student demonstrates no ability to decode two-syllable words with long vowels.","Student demonstrates limited ability to decode two-syllable words with long vowels, with frequent errors.","Student demonstrates some ability to decode two-syllable words with long vowels, but requires assistance.","Student can decode most two-syllable words with long vowels accurately, with occasional errors.","Student consistently decodes two-syllable words with long vowels accurately.","Student fluently and accurately decodes two-syllable words with long vowels and explains the syllable division."],["Student demonstrates no ability to decode words with common prefixes and suffixes.","Student demonstrates limited ability to decode words with common prefixes and suffixes, with frequent errors.","Student demonstrates some ability to decode words with common prefixes and suffixes, but requires assistance.","Student can decode most words with common prefixes and suffixes accurately, with occasional errors.","Student consistently decodes words with common prefixes and suffixes accurately.","Student fluently and accurately decodes words with common prefixes and suffixes and can identify the meaning of the prefixes\/suffixes."],["Student does not identify words with inconsistent but common spelling-sound correspondences.","Student struggles to identify words with inconsistent but common spelling-sound correspondences, with frequent errors.","Student identifies some words with inconsistent but common spelling-sound correspondences, but requires assistance.","Student identifies most words with inconsistent but common spelling-sound correspondences accurately, with occasional errors.","Student consistently identifies words with inconsistent but common spelling-sound correspondences accurately.","Student fluently and accurately identifies words with inconsistent but common spelling-sound correspondences and can explain the inconsistencies."],["Student struggles to recognize and read grade-appropriate irregularly spelled words.","Student recognizes and reads few grade-appropriate irregularly spelled words, with frequent errors.","Student recognizes and reads some grade-appropriate irregularly spelled words, but requires assistance.","Student recognizes and reads most grade-appropriate irregularly spelled words accurately, with occasional errors.","Student consistently recognizes and reads grade-appropriate irregularly spelled words accurately.","Student fluently and accurately recognizes and reads grade-appropriate irregularly spelled words."]]}