{"criteria":["Accuracy and Fluency","Purpose and Understanding","Oral Reading: Rate and Expression","Contextual Understanding and Self-Correction"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no accuracy or fluency in reading the text. Frequent errors impede understanding.","The student demonstrates limited accuracy and fluency. Many errors are present, hindering comprehension.","The student demonstrates some accuracy and fluency. Several errors are present, occasionally affecting comprehension.","The student generally reads with accuracy and fluency. Minor errors do not significantly impede comprehension.","The student reads with strong accuracy and fluency, demonstrating a clear understanding of the text. Few errors are present.","The student reads with exceptional accuracy and fluency, demonstrating a comprehensive understanding of the text. Reading is smooth, effortless, and error-free."],["The student demonstrates no understanding of the purpose of the text.","The student demonstrates a limited understanding of the purpose of the text.","The student demonstrates a basic understanding of the purpose of the text, but struggles to articulate it.","The student understands the purpose of the text and can generally articulate it.","The student clearly understands the purpose of the text and articulates it effectively.","The student demonstrates a deep understanding of the text's purpose and can articulate it with clarity and insight."],["The student's oral reading lacks appropriate rate and expression, making it difficult to follow.","The student's oral reading demonstrates little variation in rate or expression. The reading is monotone and difficult to engage with.","The student's oral reading demonstrates some awareness of rate and expression, but it is inconsistent and not always appropriate.","The student's oral reading generally reflects appropriate rate and expression.","The student reads orally with appropriate rate and expression, enhancing the meaning of the text.","The student reads orally with exceptional rate and expression, captivating the audience and fully conveying the text's meaning."],["The student does not use context to understand words, and makes no attempts to self-correct.","The student rarely uses context to understand words, and rarely attempts to self-correct errors.","The student sometimes uses context to understand words, and occasionally attempts to self-correct errors.","The student generally uses context to understand words and usually attempts to self-correct errors.","The student effectively uses context to understand words and consistently self-corrects errors.","The student masterfully uses context to understand words and seamlessly self-corrects errors, demonstrating strong reading comprehension."]]}