{"criteria":["Prefix and Suffix Identification","Decoding Latin Suffixes","Multisyllable Word Decoding","Irregularly Spelled Word Recognition"],"points":[0,1,2,3,4,5],"descriptions":[["Student cannot identify or define common prefixes and suffixes.","Student identifies a few common prefixes and suffixes but struggles to define them accurately.","Student identifies most common prefixes and suffixes but has some difficulty with definitions.","Student accurately identifies and defines most common prefixes and suffixes.","Student accurately identifies and defines common prefixes and suffixes and can provide examples of their use in words.","Student demonstrates mastery in identifying and defining common prefixes and suffixes, and can explain their impact on word meaning with multiple examples."],["Student is unable to decode words with common Latin suffixes.","Student attempts to decode words with Latin suffixes but struggles with accuracy.","Student decodes some words with common Latin suffixes but makes frequent errors.","Student decodes most words with common Latin suffixes with reasonable accuracy.","Student accurately decodes words with common Latin suffixes and understands their impact on word meaning.","Student fluently and accurately decodes words with a wide range of common Latin suffixes, demonstrating a sophisticated understanding of their impact on word meaning."],["Student struggles to decode multisyllable words and cannot break them down into smaller parts.","Student attempts to decode multisyllable words but relies heavily on guessing and makes numerous errors.","Student decodes some multisyllable words but struggles with accuracy and fluency.","Student decodes most multisyllable words with reasonable accuracy, using strategies such as breaking words into syllables.","Student accurately decodes multisyllable words with fluency and demonstrates understanding of syllable patterns.","Student effortlessly and accurately decodes complex multisyllable words, demonstrating a strong command of decoding strategies and syllable patterns."],["Student cannot read grade-appropriate irregularly spelled words.","Student attempts to read irregularly spelled words but struggles significantly and makes frequent errors.","Student recognizes a few grade-appropriate irregularly spelled words but has difficulty with others.","Student reads most grade-appropriate irregularly spelled words with reasonable accuracy.","Student reads grade-appropriate irregularly spelled words accurately and with increasing fluency.","Student reads a wide range of grade-appropriate irregularly spelled words accurately and fluently, demonstrating mastery of sight word recognition."]]}