{"criteria":["Accuracy and Fluency","Purpose and Understanding","Oral Reading and Expression","Contextual Understanding and Self-Correction"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates frequent errors in word recognition and lacks fluency, significantly hindering comprehension.","Exhibits numerous inaccuracies in word recognition and reads haltingly, making comprehension difficult.","Shows some inaccuracies in word recognition and reads with limited fluency, occasionally impeding comprehension.","Reads with general accuracy and reasonable fluency, supporting basic comprehension.","Reads accurately and with good fluency, enhancing comprehension and engagement with the text.","Reads with exceptional accuracy, fluency, and prosody, demonstrating a deep understanding and appreciation of the text."],["Shows no understanding of the text's purpose or meaning.","Demonstrates minimal understanding of the text's purpose and struggles to extract meaning.","Grasps the text's basic purpose but has difficulty with deeper understanding.","Understands the text's purpose and extracts relevant meaning with some effort.","Comprehends the text's purpose and extracts meaning effectively.","Demonstrates a thorough understanding of the text's purpose, extracting nuanced meaning and making insightful connections."],["Unable to read the text aloud or does so with extreme difficulty, lacking any expression.","Reads aloud with great difficulty, displaying minimal accuracy, rate, or expression.","Reads aloud with limited accuracy, a slow rate, and little expression.","Reads aloud with reasonable accuracy, an appropriate rate, and some expression.","Reads aloud accurately, with a good rate, and appropriate expression.","Reads aloud with exceptional accuracy, an engaging rate, and expressive interpretation, captivating the audience."],["Does not use context to understand words and makes no attempt at self-correction.","Rarely uses context to understand words and seldom attempts self-correction.","Occasionally uses context to understand words but struggles with self-correction.","Uses context to understand words and attempts self-correction with mixed success.","Effectively uses context to understand words and consistently self-corrects errors.","Masterfully uses context to understand words, seamlessly self-corrects errors, and demonstrates a deep understanding of language nuances."]]}