{"criteria":["Accuracy in Decoding Multisyllabic Words","Application of Letter-Sound Correspondences","Use of Syllabication Patterns","Knowledge of Morphology (Roots and Affixes)"],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to decode multisyllabic words, even with assistance.","Student struggles to decode multisyllabic words and requires significant assistance; makes frequent errors in letter-sound correspondences and syllabication.","Student decodes some multisyllabic words with assistance, but still makes several errors in applying phonics and word analysis skills.","Student decodes most multisyllabic words accurately with occasional errors; demonstrates a basic understanding of letter-sound correspondences and syllabication.","Student consistently decodes multisyllabic words accurately in context, demonstrating a strong understanding of letter-sound correspondences, syllabication, and morphology.","Student effortlessly and accurately decodes complex multisyllabic words in and out of context; demonstrates mastery of letter-sound correspondences, syllabication, and morphology, and applies this knowledge to unfamiliar words with ease."],["Student does not demonstrate knowledge of letter-sound correspondences.","Student demonstrates limited knowledge of letter-sound correspondences, confusing common sounds and making frequent errors.","Student demonstrates a basic understanding of letter-sound correspondences, but struggles with less common sounds and complex patterns.","Student accurately applies letter-sound correspondences in most cases, but occasionally makes errors with less common sounds or complex patterns.","Student consistently and accurately applies letter-sound correspondences to decode words, including less common sounds and complex patterns.","Student demonstrates mastery of letter-sound correspondences, effortlessly applying this knowledge to decode even the most complex and unfamiliar words."],["Student does not demonstrate an understanding of syllabication patterns.","Student shows limited awareness of syllabication patterns and is unable to use them to decode words.","Student attempts to use syllabication patterns, but makes frequent errors and is largely unsuccessful in decoding words.","Student uses syllabication patterns with some accuracy, but still struggles to decode complex words.","Student effectively uses syllabication patterns to decode most words accurately, including complex multisyllabic words.","Student demonstrates a sophisticated understanding of syllabication patterns and uses them effortlessly to decode even the most challenging words with precision."],["Student does not demonstrate knowledge of morphology (roots and affixes).","Student shows limited awareness of common roots and affixes.","Student can identify a few common roots and affixes, but struggles to apply this knowledge to decode words.","Student uses knowledge of common roots and affixes to decode some words, but still makes occasional errors.","Student effectively uses knowledge of roots and affixes to decode most words accurately, demonstrating a solid understanding of morphology.","Student demonstrates a comprehensive understanding of morphology and effortlessly applies this knowledge to decode a wide range of words, including those with complex roots and affixes."]]}