{"criteria":["Accuracy and Fluency","Purpose and Understanding","Oral Reading Expression","Contextual Understanding and Self-Correction"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates frequent errors in word recognition and reads haltingly, significantly impeding comprehension.","Exhibits numerous inaccuracies in word recognition and lacks fluency, making comprehension difficult.","Shows some inaccuracies in word recognition and limited fluency, somewhat affecting comprehension.","Reads with general accuracy and reasonable fluency, with occasional hesitations that do not significantly impede comprehension.","Reads accurately and fluently, with only minor hesitations, demonstrating good comprehension.","Reads with exceptional accuracy, fluency, and natural rhythm, demonstrating thorough comprehension and command of the text."],["Unable to identify the purpose of the text or demonstrate any understanding of its content.","Struggles to identify the purpose of the text and demonstrates very limited understanding of its content.","Identifies the purpose of the text with difficulty and demonstrates a basic understanding of its content.","Identifies the purpose of the text and demonstrates a reasonable understanding of its content, with some gaps.","Clearly identifies the purpose of the text and demonstrates a strong understanding of its content, with few gaps.","Clearly and insightfully identifies the purpose of the text and demonstrates a comprehensive understanding of its content, including nuances and subtleties."],["Reads orally in a monotone voice with no expression, failing to convey any emotion or meaning.","Reads orally with minimal expression, making little attempt to convey emotion or meaning.","Reads orally with some expression, but the expression is inconsistent or does not always match the text.","Reads orally with appropriate expression that generally enhances the meaning of the text.","Reads orally with varied and engaging expression that effectively conveys the emotion and meaning of the text.","Reads orally with dynamic and nuanced expression that captivates the listener and fully conveys the emotion, tone, and meaning of the text."],["Unable to use context to understand unfamiliar words or correct misreadings, making no attempt to reread.","Rarely uses context to understand unfamiliar words or correct misreadings, seldom rereading for clarification.","Occasionally uses context to understand unfamiliar words or correct misreadings, but inconsistently and with limited success.","Generally uses context to understand unfamiliar words and correct misreadings, rereading when necessary to clarify meaning.","Consistently and effectively uses context to understand unfamiliar words and correct misreadings, rereading thoughtfully to enhance comprehension.","Masterfully uses context to understand unfamiliar words, anticipate meaning, and self-correct errors, rereading strategically to deepen understanding and appreciation of the text."]]}