{"criteria":["Letter-Sound Correspondence","Syllabication","Morphology (Roots and Affixes)","Accuracy in Context"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of letter-sound correspondences. Unable to decode even simple words.","Struggles with basic letter-sound correspondences. Can decode some simple words with significant effort and errors.","Shows partial understanding of letter-sound correspondences. Can decode some simple words with occasional errors.","Demonstrates adequate understanding of letter-sound correspondences. Accurately decodes most simple words but struggles with complex words.","Demonstrates strong understanding of letter-sound correspondences. Accurately decodes most simple and complex words with minimal errors.","Demonstrates complete understanding of letter-sound correspondences. Accurately and effortlessly decodes a wide range of words, including those with unusual spellings."],["Unable to identify syllables in words or use syllabication to decode.","Struggles to identify syllables in words. Attempts at syllabication are often inaccurate.","Identifies some syllables in words but struggles to use syllabication effectively for decoding.","Can usually divide words into syllables but sometimes misapplies syllabication rules, leading to decoding errors.","Consistently divides words into syllables correctly and uses this skill to decode unfamiliar words with accuracy.","Masterfully uses knowledge of syllabication to decode complex, multisyllabic words effortlessly and accurately, even when rules are not straightforward."],["Shows no understanding of roots or affixes and how they contribute to word meaning.","Struggles to identify common roots and affixes. Unable to use morphological knowledge to decode or understand word meaning.","Identifies a few common roots and affixes but struggles to apply this knowledge to decode or understand word meaning.","Recognizes and uses common roots and affixes to decode and understand the meaning of many words with some errors.","Demonstrates a strong understanding of roots and affixes. Accurately uses morphological knowledge to decode and understand the meaning of unfamiliar words.","Demonstrates sophisticated understanding of morphology. Masterfully uses knowledge of roots and affixes to decode and understand the nuances of complex words, including less common morphemes."],["Unable to accurately decode words within a text; frequent misreadings disrupt comprehension.","Struggles to decode words in context, leading to frequent errors that impede comprehension.","Decoding in context is slow and labored, with several errors that affect comprehension.","Generally accurate in decoding words in context, with occasional errors that do not significantly impede comprehension.","Accurately decodes words in context with minimal errors, demonstrating strong reading fluency and comprehension.","Effortlessly and accurately decodes words in context, demonstrating excellent reading fluency and comprehension. Self-corrects any minor errors."]]}