{"criteria":["Following directionality of the english language.","Connecting letter sequences to spoken words.","Understanding the use of spaces in print.","Identifying the letters of the alphabet."],"points":[0,1,2,3,4,5],"descriptions":[["Student does not demonstrate any understanding of the left-to-right, top-to-bottom progression of text.","Student shows minimal awareness, frequently losing their place or reading in the wrong direction.","Student generally follows the correct reading order but occasionally hesitates or needs prompting.","Student consistently reads from left to right and top to bottom with minimal errors.","Student reads smoothly and accurately, demonstrating a strong understanding of the organization of print.","Student effortlessly navigates text, displaying a comprehensive understanding of print directionality and assisting others in understanding the concept."],["Student is unable to connect spoken words to written letters.","Student struggles to identify letter sequences in relation to spoken words and often makes incorrect associations.","Student can sometimes match spoken words with letter sequences with significant prompting.","Student correctly identifies simple letter sequences in relation to spoken words but struggles with more complex words.","Student demonstrates a solid understanding of how spoken words are represented by sequences of letters in written language.","Student shows expertise in connecting spoken words to complex written sequences and can explain the relationship effectively."],["Student does not recognize spaces between words.","Student rarely identifies that words are separated by spaces in print and reads text as a continuous string.","Student occasionally recognizes spaces between words but frequently misses them, leading to misreading.","Student generally identifies spaces between words but sometimes hesitates or misinterprets them.","Student accurately recognizes that words are separated by spaces in print and consistently applies this knowledge while reading.","Student fluently recognizes and explains the function of spaces between words, aiding comprehension and reading fluency."],["Student cannot name any upper- or lowercase letters of the alphabet.","Student can name only a few letters correctly and struggles with both upper- and lowercase forms.","Student can name some letters but confuses many upper- and lowercase forms.","Student can name most letters but still hesitates or makes errors with some upper- and lowercase letters.","Student confidently recognizes and names nearly all upper- and lowercase letters of the alphabet.","Student effortlessly recognizes, names, and differentiates all upper- and lowercase letters of the alphabet, and can quickly identify them in various fonts and styles."]]}