{"criteria":["Letter-Sound Correspondence and Decoding Skills","Distinguishing Similarly Spelled Words","Vowel Sound Association"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of letter-sound correspondences or high-frequency words.","Student demonstrates minimal understanding of letter-sound correspondences and struggles to decode words, even with assistance.  Rarely recognizes high-frequency words by sight.","Student demonstrates some understanding of basic letter-sound correspondences but requires frequent prompting. Can decode some simple words and recognize a few high-frequency words.","Student demonstrates a developing understanding of letter-sound correspondences and can decode many simple words independently. Recognizes a moderate number of high-frequency words by sight.","Student demonstrates a strong understanding of letter-sound correspondences and decodes most words accurately.  Confidently recognizes most high-frequency words by sight.","Student demonstrates a comprehensive understanding of letter-sound correspondences and effortlessly decodes words in isolation and in text.  Recognizes nearly all high-frequency words by sight with automaticity."],["Student is unable to distinguish between similarly spelled words.","Student struggles to distinguish between similarly spelled words, even when provided with the sounds of the letters that differ.","Student can sometimes distinguish between similarly spelled words, but requires significant prompting and guidance.","Student can usually distinguish between similarly spelled words when the differing sounds are clearly pronounced.","Student can confidently distinguish between most similarly spelled words by identifying the sounds of the letters that differ.","Student demonstrates mastery in distinguishing between similarly spelled words, readily identifying the sounds of differing letters with accuracy and speed."],["Student shows no ability to associate long and short vowel sounds with common spellings.","Student shows a very limited ability to associate long and short vowel sounds with common spellings, even with direct instruction.","Student can identify some long and short vowel sounds but struggles to connect them to their common spellings.","Student can associate long and short vowel sounds with some common spellings but may make errors with less frequent patterns.","Student can accurately associate long and short vowel sounds with most common spellings.","Student demonstrates complete mastery in associating long and short vowel sounds with common spellings and applies this knowledge consistently and accurately."]]}