{"criteria":["Fluency and Accuracy","Understanding of Purpose","Contextual Connection"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to read the text, or the attempt is entirely disjointed and incomprehensible.","The student attempts to read the text, but struggles significantly with decoding and comprehension is minimal.","The student reads the text with considerable difficulty, requiring frequent pauses and assistance. Comprehension is limited to basic elements.","The student reads the text with some difficulty, occasionally stumbling over words or phrases. Comprehension is moderate, with some misunderstandings.","The student reads the text with reasonable fluency and accuracy. Comprehension is generally good, with only minor misunderstandings.","The student reads the text fluently, accurately, and with appropriate expression. Demonstrates a strong understanding of the text's meaning and purpose."],["The student demonstrates no understanding of the text's purpose or meaning.","The student shows minimal awareness of the text's purpose, struggling to identify even basic elements.","The student identifies the text's purpose vaguely, but demonstrates limited comprehension of its meaning.","The student identifies the text's purpose with some accuracy and demonstrates a moderate understanding of its meaning.","The student identifies the text's purpose clearly and demonstrates a good understanding of its meaning, including some nuances.","The student demonstrates a thorough and insightful understanding of the text's purpose and meaning, including its underlying themes and implications."],["The student is unable to connect the text to any context or personal experience.","The student struggles to make any connection between the text and their own knowledge or experience.","The student makes a superficial connection between the text and their own knowledge, but it lacks depth.","The student connects the text to their own knowledge or experience, providing a basic interpretation.","The student connects the text to their own knowledge, providing a thoughtful interpretation and considering different perspectives.","The student connects the text to their own knowledge and experience, providing an insightful, nuanced interpretation and demonstrating critical thinking."]]}