{"criteria":["Recognize and produce rhyming words.","Count, pronounce, blend, and segment syllables in spoken words.","Blend and segment onsets and rimes of single-syllable spoken words.","Isolate and pronounce phonemes in CVC words.","Add or substitute sounds in one-syllable words to make new words.","Blend two to three phonemes into recognizable words."],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of rhyming words and cannot produce any.","Student recognizes rhyming words occasionally but struggles to produce them independently.","Student recognizes and produces simple rhyming words with prompting.","Student consistently recognizes and produces rhyming words.","Student fluently recognizes and produces rhyming words and can explain the concept of rhyme.","Student demonstrates mastery in recognizing and producing complex rhyming words, including nuanced examples, and can teach the concept to others."],["Student is unable to count, pronounce, blend, or segment syllables in spoken words.","Student attempts to count, pronounce, blend, or segment syllables but struggles significantly, requiring extensive assistance.","Student can count, pronounce, blend, and segment syllables in simple spoken words with some errors.","Student accurately counts, pronounces, blends, and segments syllables in most spoken words.","Student fluently counts, pronounces, blends, and segments syllables in spoken words with precision and accuracy.","Student demonstrates mastery in counting, pronouncing, blending, and segmenting syllables in complex spoken words and can identify syllable patterns."],["Student is unable to blend and segment onsets and rimes in single-syllable words.","Student attempts to blend and segment onsets and rimes but struggles significantly.","Student can blend and segment onsets and rimes in simple single-syllable words with some errors.","Student accurately blends and segments onsets and rimes in most single-syllable words.","Student fluently blends and segments onsets and rimes in single-syllable words with precision.","Student demonstrates mastery in blending and segmenting onsets and rimes in complex single-syllable words and can explain the relationship between them."],["Student is unable to isolate and pronounce initial, medial vowel, and final sounds in CVC words.","Student attempts to isolate and pronounce sounds in CVC words but struggles significantly.","Student can isolate and pronounce some sounds in simple CVC words with several errors.","Student accurately isolates and pronounces initial, medial vowel, and final sounds in most CVC words.","Student fluently isolates and pronounces sounds in CVC words with precision.","Student demonstrates mastery in isolating and pronouncing sounds in CVC words and can identify phonetic patterns."],["Student is unable to add or substitute individual sounds in one-syllable words to make new words.","Student attempts to add or substitute sounds but struggles significantly.","Student can add or substitute sounds in simple one-syllable words with some errors.","Student accurately adds or substitutes individual sounds to create new words.","Student fluently adds or substitutes sounds to create new words with precision.","Student demonstrates mastery in manipulating sounds to create new words and understands phonetic principles behind the changes."],["Student is unable to blend two to three phonemes into recognizable words.","Student attempts to blend phonemes but struggles significantly.","Student can blend two to three phonemes into recognizable words with some errors.","Student accurately blends two to three phonemes into recognizable words.","Student fluently blends phonemes into recognizable words with precision.","Student demonstrates mastery in blending phonemes and can quickly recognize newly blended words, understanding the phonetics."]]}