{"criteria":["Accuracy of Definition","Use of Contextual Clues","Domain-Specific Vocabulary"],"points":[0,1,2,3,4,5],"descriptions":[["The student provides no definition or an entirely incorrect definition of the word\/phrase.","The student's definition is largely inaccurate and demonstrates a minimal understanding of the word\/phrase in context.","The student's definition is partially correct but lacks precision or demonstrates a limited understanding of the word\/phrase in context.","The student provides a generally accurate definition but may miss some nuances or subtleties in the meaning of the word\/phrase as used in the text.","The student provides an accurate and contextually appropriate definition of the word\/phrase, demonstrating a strong understanding of its meaning in the text.","The student provides an insightful and nuanced definition of the word\/phrase, demonstrating a comprehensive understanding of its meaning and implications in the text."],["The student makes no attempt to use contextual clues to determine the meaning of the word\/phrase.","The student attempts to use contextual clues, but does so ineffectively, leading to an inaccurate or irrelevant definition.","The student uses contextual clues with limited success, demonstrating some awareness of how context can inform meaning, but struggling to apply it effectively.","The student uses contextual clues to support their definition, demonstrating a moderate understanding of how context influences meaning.","The student skillfully uses contextual clues to support and refine their definition, demonstrating a strong awareness of how context enriches meaning.","The student expertly uses contextual clues, including subtle or implicit cues, to construct a comprehensive and insightful understanding of the word\/phrase's meaning in context."],["The student demonstrates no recognition of domain-specific vocabulary related to history\/social studies.","The student shows a limited awareness of domain-specific vocabulary, using it incorrectly or inappropriately.","The student attempts to use domain-specific vocabulary but struggles with its accurate application or relevance to the text.","The student uses domain-specific vocabulary correctly in some instances, demonstrating a general understanding of its relevance.","The student effectively uses domain-specific vocabulary to enhance their understanding and definition of the word\/phrase, demonstrating a strong grasp of relevant concepts.","The student expertly integrates domain-specific vocabulary into their analysis, demonstrating a nuanced understanding of its significance and implications within the historical\/social studies context."]]}