{"criteria":["Reading Comprehension: Demonstrates understanding of explicit and implicit meanings within the text.","Textual Evidence: Effectively uses textual evidence to support analysis and interpretations.","Vocabulary and Language: Demonstrates understanding and appropriate use of vocabulary relevant to the text.","Analysis and Interpretation: Analyzes the text critically and offers insightful interpretations."],"points":[0,1,2,3,4,5],"descriptions":[["Shows no understanding of the text; cannot identify any key details or main ideas.","Struggles to understand the text; identifies only the most basic details with significant prompting.","Demonstrates a limited understanding; identifies some main ideas and details but misses nuances and deeper meanings.","Demonstrates a satisfactory understanding; accurately identifies main ideas and details but may struggle with complex inferences.","Demonstrates a strong understanding; accurately interprets explicit and implicit meanings and draws reasonable inferences.","Demonstrates an exceptional understanding; thoroughly analyzes the text, interprets complex meanings, and draws insightful inferences with ease."],["Provides no textual evidence or relies on irrelevant information.","Attempts to use textual evidence but does so inaccurately or ineffectively.","Provides limited textual evidence that partially supports analysis but may be superficial or incomplete.","Supports analysis with relevant textual evidence, but connections may not always be clear or fully explained.","Effectively uses textual evidence to support analysis and interpretations, clearly explaining connections.","Masterfully integrates textual evidence to provide compelling support for insightful and nuanced analysis."],["Misunderstands key vocabulary and struggles to comprehend the language used in the text.","Shows limited understanding of vocabulary; struggles to use language effectively.","Understands some key vocabulary but may misinterpret or misuse terms; language use is basic.","Demonstrates adequate understanding of vocabulary and uses language appropriately in most contexts.","Demonstrates strong understanding of vocabulary and uses language effectively to communicate ideas with clarity.","Demonstrates sophisticated understanding of vocabulary and uses language skillfully to enhance analysis and interpretations."],["Provides no analysis or interpretation of the text.","Offers superficial or inaccurate interpretations with no critical analysis.","Attempts to analyze the text but provides limited or simplistic interpretations.","Provides a basic analysis of the text with some interpretation of its meaning and significance.","Analyzes the text critically and offers thoughtful interpretations supported by evidence.","Offers insightful and nuanced interpretations of the text, demonstrating a deep understanding of its complexities and implications."]]}