{"criteria":["Identification of Key Steps","Understanding of Process Context","Clarity and Accuracy of Description"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any key steps in the process described in the text.","The student identifies one step in the process, but it is not a key step or is inaccurately described.","The student identifies a few steps, but misses key components of the process. Descriptions may lack clarity.","The student identifies most key steps in the process, but there are some minor omissions or inaccuracies.","The student accurately identifies all key steps in the process with clear descriptions and demonstrates a strong understanding of their order and significance.","The student identifies all key steps accurately and provides insightful details about their interrelation and impact within the broader historical or social studies context."],["Demonstrates no understanding of the broader context of the process within history or social studies.","Shows minimal awareness of the process's connection to historical or social studies themes.","Demonstrates a basic understanding of the process within its context, but lacks depth.","Connects the process to its historical or social studies context effectively, showing good understanding.","Demonstrates a strong understanding of how the process fits into broader historical or social studies themes, providing relevant examples.","Offers a nuanced analysis of the process, contextualizing it with sophisticated insights into its historical or social studies implications."],["The description of the process is unclear, inaccurate, and difficult to follow.","The description lacks clarity and contains multiple inaccuracies or confusing elements.","The description is somewhat clear but contains some inaccuracies or ambiguities.","The description is generally clear and accurate, with only minor areas needing improvement.","The description is clear, concise, and accurate, presenting the process in an easily understandable manner.","The description is exceptionally clear, accurate, and insightful, demonstrating a mastery of the subject matter."]]}