{"criteria":["Accuracy in Identifying Facts","Accuracy in Identifying Opinions","Accuracy in Identifying Reasoned Judgments","Ability to Differentiate Between Information Types"],"points":[0,1,2,3,4,5],"descriptions":[["Student cannot distinguish facts from other types of information.","Student struggles to identify facts; demonstrates frequent inaccuracies.","Student identifies simple facts but has difficulty with more complex or subtle factual statements.","Student accurately identifies most facts but may occasionally confuse them with opinions or judgments.","Student consistently and accurately identifies facts within the text, demonstrating a clear understanding.","Student expertly identifies facts, even when presented indirectly or subtly, and explains their importance to the text."],["Student cannot distinguish opinions from other types of information.","Student struggles to identify opinions, often misinterpreting them as facts.","Student identifies obvious opinions but struggles with subjective language or bias.","Student accurately identifies most opinions, with occasional difficulty in nuanced cases.","Student consistently and accurately identifies opinions, demonstrating an understanding of subjective viewpoints.","Student expertly identifies opinions, analyzes their underlying assumptions, and evaluates their potential impact on the text."],["Student cannot distinguish reasoned judgments from other types of information.","Student struggles to identify reasoned judgments, often confusing them with simple opinions or facts.","Student identifies basic reasoned judgments but struggles with complex arguments or evidence-based conclusions.","Student accurately identifies most reasoned judgments, with occasional difficulty in evaluating the strength of the reasoning.","Student consistently and accurately identifies reasoned judgments, demonstrating an understanding of logical arguments and evidence.","Student expertly identifies reasoned judgments, analyzes the quality of the reasoning and evidence, and evaluates their validity and reliability."],["Student demonstrates no understanding of the differences between fact, opinion, and reasoned judgment.","Student demonstrates minimal understanding of the differences, frequently confusing the categories.","Student identifies some key differences but struggles to apply them consistently.","Student generally differentiates between the types but may occasionally misclassify information.","Student clearly differentiates between fact, opinion, and reasoned judgment, providing accurate explanations.","Student expertly differentiates between the types, providing insightful analysis of their relationships and potential biases."]]}