{"criteria":["Identification of Author's Point of View","Analysis of Loaded Language","Understanding of Factual Inclusion and Avoidance"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any aspects of the text that reveal the author's point of view or purpose.","The student attempts to identify aspects of the text but struggles to accurately pinpoint elements revealing the author's point of view or purpose.","The student identifies one or two basic aspects of the text that hint at the author's point of view or purpose, but the explanation is superficial.","The student identifies several aspects of the text that suggest the author's point of view or purpose and provides a reasonable explanation.","The student identifies multiple aspects of the text, including loaded language or specific facts, and effectively explains how these elements reveal the author's point of view or purpose.","The student thoroughly analyzes various aspects of the text, such as loaded language and specific factual inclusions or omissions, to provide a comprehensive understanding of the author's point of view or purpose, demonstrating a nuanced understanding."],["The student does not recognize or mention any instances of loaded language in the text.","The student vaguely refers to language that might be biased but cannot provide specific examples or explain their impact.","The student identifies one instance of potentially loaded language but does not fully explain its connotation or effect.","The student identifies a few examples of loaded language and offers a basic explanation of their intended emotional or persuasive impact.","The student accurately identifies multiple examples of loaded language and clearly explains how these terms are used to influence the reader.","The student skillfully dissects the loaded language used in the text, providing insightful analysis of its emotional and persuasive power, and its contribution to the author's overall agenda."],["The student does not comment on the use or omission of particular facts in the text.","The student notes that some facts are included or avoided but does not explain why this might be significant.","The student points out a specific fact that is included or avoided and makes a simple connection to the author's potential bias.","The student identifies several key facts that are either included or avoided and discusses their relevance to the author's purpose.","The student analyzes the strategic inclusion or avoidance of particular facts and convincingly argues how this shapes the reader's perception.","The student masterfully evaluates the selection of facts in the text, revealing a sophisticated understanding of how these choices construct a particular narrative and advance the author's aims."]]}