{"criteria":["Identification of Central Ideas\/Information","Accuracy of Summary","Distinction from Prior Knowledge\/Opinions"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any central ideas or information from the source.","The student identifies a central idea or piece of information, but it is vague or inaccurate.","The student identifies one or two central ideas\/pieces of information, but lacks depth or clarity.","The student identifies several central ideas\/pieces of information, demonstrating a basic understanding.","The student accurately identifies the key central ideas\/information, showing a strong understanding of the source's main points.","The student expertly identifies and explains the central ideas\/information, demonstrating a comprehensive understanding of the source."],["The student provides no summary or a summary that is entirely inaccurate.","The student's summary contains significant inaccuracies or misrepresentations of the source material.","The student's summary contains some inaccuracies or omits important details.","The student provides a mostly accurate summary with minor omissions or slight inaccuracies.","The student provides an accurate and concise summary of the source, capturing the key points effectively.","The student provides an exceptionally accurate, thorough, and insightful summary that demonstrates a deep understanding of the source."],["The student's response is based entirely on prior knowledge or opinions, with no reference to the source.","The student's response relies heavily on prior knowledge\/opinions, with minimal reference to the source.","The student struggles to separate their own knowledge\/opinions from the information presented in the source.","The student mostly distinguishes between prior knowledge\/opinions and the source material, but some blending occurs.","The student clearly distinguishes between prior knowledge\/opinions and the information presented in the source.","The student masterfully presents a summary devoid of personal bias, relying solely on evidence from the source."]]}