{"criteria":["Identification of Sources","Understanding of Source Content","Analysis of Relationships Between Sources","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify either the primary or secondary source.","Identifies only one source (either primary or secondary) with inaccuracies.","Identifies both sources but with significant inaccuracies or omissions.","Correctly identifies both primary and secondary sources with minor inaccuracies.","Accurately identifies both sources and provides basic contextual information.","Accurately identifies both sources, provides detailed contextual information, and demonstrates understanding of the nature of primary and secondary sources."],["Demonstrates no understanding of the content of either source.","Shows minimal understanding of one source, with significant misinterpretations.","Demonstrates a basic understanding of both sources, but with some misinterpretations or omissions.","Demonstrates a satisfactory understanding of both sources, accurately summarizing key points.","Demonstrates a strong understanding of both sources, accurately summarizing key points and identifying the author's main purpose or argument.","Demonstrates a comprehensive understanding of both sources, including nuances, underlying assumptions, and the author's purpose."],["Fails to identify any relationship between the primary and secondary sources.","Identifies a superficial relationship with no supporting evidence.","Identifies a basic relationship (e.g., both sources discuss the same event) but lacks depth or specific examples.","Analyzes the relationship between the sources, identifying points of agreement or disagreement with some supporting evidence.","Analyzes the relationship in detail, identifying points of agreement, disagreement, and\/or gaps in coverage with specific supporting evidence from both sources.","Provides a nuanced and insightful analysis of the relationship, synthesizing information from both sources to develop a comprehensive understanding of the topic.  Addresses potential biases or limitations in the sources."],["Response is unclear, disorganized, and difficult to understand.","Response lacks clarity and organization, making it difficult to follow the analysis.","Response is somewhat organized but contains unclear language or ideas.","Response is generally clear and organized, presenting the analysis in a logical manner.","Response is clear, well-organized, and uses precise language to effectively communicate the analysis.","Response is exceptionally clear, concise, and logically organized, demonstrating a mastery of communication skills."]]}