{"criteria":["Identification of the Text's Organizational Structure","Explanation of How Information is Presented","Clarity and Coherence of Description"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any organizational structure within the text.","The student attempts to identify the text's organizational structure but provides an inaccurate or irrelevant response.","The student identifies a basic organizational structure (e.g., chronological order) but struggles to provide specific examples from the text.","The student correctly identifies the text's organizational structure (e.g., sequential, comparative, causal) and provides a general example from the text.","The student accurately describes the text's organizational structure and provides relevant examples from the text to support their description.","The student expertly describes the text's organizational structure, providing insightful examples and explaining how the structure contributes to the overall meaning or purpose of the text."],["The student does not explain how the text presents information.","The student attempts to explain how the text presents information but provides an unclear or illogical response.","The student provides a vague explanation of how information is presented, lacking specific details or examples.","The student explains how information is presented in the text and provides a basic example.","The student clearly explains how information is presented and provides relevant examples from the text.","The student thoroughly explains how information is presented, analyzing the effectiveness of the chosen method and its impact on the reader."],["The student's description is unclear, incoherent, and difficult to understand.","The student's description lacks clarity and coherence, making it challenging to follow their reasoning.","The student's description is somewhat clear but lacks organization and logical flow.","The student's description is generally clear and coherent with some organization.","The student's description is clear, coherent, and well-organized, demonstrating a strong understanding of the text's structure.","The student's description is exceptionally clear, coherent, and insightful, demonstrating a sophisticated understanding of the text's structure and purpose."]]}