{"criteria":["Activating Prior Knowledge & Making Predictions","Connecting to Personal Experiences and Learning","Recalling and Integrating Information"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not activate any prior knowledge related to the text and makes no predictions.","Student attempts to activate prior knowledge or make predictions but struggles significantly and demonstrates minimal understanding.","Student activates some prior knowledge or makes predictions but lacks depth or accuracy, showing a limited connection to the text.","Student activates relevant prior knowledge and makes reasonable predictions about the text, demonstrating a basic understanding.","Student effectively activates prior knowledge and makes thoughtful predictions, showing a good understanding of the text and its potential direction.","Student skillfully activates prior knowledge and formulates insightful predictions that enhance understanding of the text, demonstrating excellent comprehension and anticipation."],["Student demonstrates no ability to connect personal experiences or previous learning to the text.","Student shows a limited ability to connect personal experiences or previous learning to the text, with minimal relevance.","Student makes a superficial connection between personal experiences or previous learning and the text, but lacks depth.","Student connects personal experiences or previous learning to the text in a relevant way, demonstrating a basic understanding of the material.","Student effectively integrates personal experiences and previous learning to enhance understanding of the text, displaying a solid grasp of the content.","Student expertly synthesizes personal experiences, previous learning, and textual information to create a deep and nuanced understanding of the material."],["Student is unable to recall or identify any relevant information from previous readings or experiences.","Student struggles to recall or identify relevant information, requiring significant prompting and guidance.","Student recalls or identifies some relevant information with prompting, but lacks clarity or accuracy.","Student recalls and identifies relevant information from previous readings or experiences with reasonable clarity and accuracy.","Student effectively recalls and integrates relevant information to support understanding of the text, demonstrating good retention.","Student seamlessly integrates relevant information from a variety of sources to provide a comprehensive and insightful understanding of the text."]]}