{"criteria":["Identification of the main topic","Retelling of key details","Connection between main topic and key details"],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to identify the main topic of the text.","Student struggles to identify the main topic, providing an inaccurate or irrelevant response.","Student identifies the main topic with some difficulty, but the explanation lacks clarity or depth.","Student identifies the main topic accurately but provides a somewhat superficial explanation.","Student clearly and accurately identifies the main topic, providing a solid explanation with supporting details.","Student expertly identifies the main topic, providing a comprehensive and insightful explanation with well-integrated supporting details."],["Student is unable to retell any key details from the text.","Student attempts to retell key details but provides inaccurate or irrelevant information.","Student retells a few key details, but the retelling lacks coherence and important information is missing.","Student retells some key details accurately, but the retelling is incomplete or lacks sufficient context.","Student retells most key details accurately and provides sufficient context, demonstrating a good understanding of the text.","Student retells all key details accurately and comprehensively, providing insightful context and demonstrating a deep understanding of the text."],["Student demonstrates no understanding of the relationship between the main topic and key details.","Student struggles to connect the main topic and key details, providing a vague or inaccurate explanation.","Student makes a basic attempt to connect the main topic and key details, but the explanation lacks clarity and depth.","Student connects the main topic and key details adequately, but the explanation is somewhat superficial.","Student clearly connects the main topic and key details, providing a solid explanation with supporting evidence.","Student expertly connects the main topic and key details, providing a comprehensive and insightful explanation with well-integrated evidence, demonstrating a sophisticated understanding of the text."]]}