{"criteria":["Question Formulation and Answering","Identification of Key Details","Relevance and Focus"],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to formulate or answer questions about the text.","The student struggles to formulate or answer questions about the text, even with assistance.","The student can formulate basic questions about the text, but struggles to answer questions about key details without assistance.","The student can formulate relevant questions and answer some questions about key details in the text with occasional prompting.","The student can effectively formulate questions and answer questions about key details in the text, demonstrating a good understanding.","The student expertly formulates insightful questions and provides comprehensive answers about key details in the text, demonstrating a deep understanding."],["The student does not identify any key details in the text.","The student struggles to identify key details, even when directly pointed out.","The student identifies few key details, and those identified are often inaccurate or irrelevant.","The student identifies some key details, but misses others that are important for understanding the text.","The student identifies most key details accurately and explains their significance to the text.","The student identifies all key details accurately, explains their significance, and connects them to broader themes in the text."],["The student’s questions and answers are not relevant to the text.","The student’s questions and answers are rarely relevant, showing a lack of comprehension.","The student’s questions and answers are sometimes relevant, but often stray from the main points of the text.","The student’s questions and answers are generally relevant, but may occasionally lack focus.","The student’s questions and answers are consistently relevant and focused on the key details of the text.","The student’s questions and answers are insightful, consistently relevant, and demonstrate a comprehensive understanding of the text."]]}