{"criteria":["Understanding of Word Meanings in Context","Identification and Clarification of Unfamiliar Words and Phrases","Engagement and Critical Thinking"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of word meanings within the text.","Student struggles to ask or answer basic questions about word meanings; demonstrates limited comprehension.","Student asks or answers simple questions about word meanings but demonstrates difficulty with more complex or nuanced language.","Student can generally ask and answer questions to clarify the meaning of words and phrases in the text, showing a moderate level of comprehension.","Student proficiently asks and answers questions to determine and clarify the meaning of most words and phrases, demonstrating strong comprehension.","Student expertly asks and answers insightful questions to fully determine and clarify the meaning of words and phrases, showing a comprehensive understanding of the text and its nuances."],["Student is unable to identify any unfamiliar words or phrases in the text.","Student identifies very few unfamiliar words or phrases and is unable to use context to infer meaning.","Student identifies some unfamiliar words but struggles to use context or reference materials to understand their meaning.","Student identifies most unfamiliar words and makes a reasonable attempt to understand their meaning using context clues and basic reference skills.","Student accurately identifies unfamiliar words and effectively uses context clues and reference materials to determine their meaning within the text.","Student expertly identifies unfamiliar words, skillfully uses context, and independently employs a variety of resources to determine precise meanings and nuances of language."],["Student does not engage with the text or attempt to explore the meaning of words and phrases.","Student makes minimal effort to engage with the text; questions lack relevance or depth.","Student engages with the text but asks questions that are superficial and do not significantly clarify meaning.","Student engages thoughtfully with the text, asking relevant questions that contribute to clarifying the meaning of words and phrases.","Student actively and thoughtfully engages with the text, asking probing questions that significantly enhance understanding of word meanings.","Student demonstrates exceptional engagement, critically analyzing the text and posing sophisticated questions that reveal a deep understanding of the subtle nuances in word meanings and usage."]]}