{"criteria":["Identification of Similarities and Differences","Reasoning and Explanation","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to identify any similarities or differences between the two texts.","Student identifies one similarity or difference with significant inaccuracies.","Student identifies one basic similarity or difference between the texts with minor inaccuracies or omissions.","Student identifies basic similarities or differences between the two texts with reasonable accuracy.","Student identifies multiple similarities and differences between the two texts with accuracy and provides some supporting details.","Student comprehensively identifies and explains multiple similarities and differences between the two texts, providing strong supporting details and insightful observations."],["Student provides no explanation or reasoning for identified similarities or differences.","Student attempts to explain the reasoning with significant flaws or irrelevant information.","Student provides a limited or unclear explanation of the reasoning for identified similarities or differences.","Student provides a clear explanation of the reasoning for identified similarities and differences.","Student provides a well-reasoned explanation of the similarities and differences, demonstrating a solid understanding of the texts.","Student provides a sophisticated, insightful explanation of the similarities and differences, demonstrating a deep understanding of the texts and their underlying themes."],["Student's response is unclear, disorganized, and lacks coherence.","Student's response is difficult to follow with significant issues in organization and clarity.","Student's response shows some organization but lacks clarity in certain areas.","Student's response is generally clear and organized.","Student's response is clear, well-organized, and coherent.","Student's response is exceptionally clear, well-organized, and coherent, demonstrating excellent communication skills."]]}