{"criteria":["Ability to identify and utilize text structures and features to locate information.","Understanding of Text Organization","Effective Use of Text Features"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of text structures or features.","The student identifies a text structure or feature but cannot explain its purpose or use it to locate information.","The student identifies and explains a text structure or feature with limited accuracy.","The student accurately identifies and explains common text structures and features and uses them to locate basic information in a text.","The student effectively uses various text structures and features to locate specific facts or information in a text with minimal guidance.","The student expertly uses a wide range of text structures and features to efficiently locate key facts or information in complex texts, demonstrating a comprehensive understanding."],["The student fails to recognize the organization of the text.","The student shows a minimal understanding of how the text is organized.","The student identifies the organizational structure of the text with some inaccuracies.","The student accurately identifies the organizational structure of the text (e.g., sequence, cause\/effect, compare\/contrast).","The student effectively uses the text's organization to navigate and extract relevant information.","The student analyzes the text's organization to understand the author's purpose and locate subtle or complex information."],["The student does not use any text features to aid in finding information.","The student attempts to use text features but does so ineffectively.","The student uses some text features (e.g., headings) with limited success.","The student uses common text features (e.g., headings, table of contents) to locate information.","The student skillfully uses a variety of text features (e.g., glossary, index, electronic menus) to find information.","The student strategically uses and evaluates different text features to efficiently locate key facts and enhance comprehension."]]}