{"criteria":["Accuracy and Relevance of Illustration and Detail Usage","Understanding of Key Ideas","Organization and Coherence of Description"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to use illustrations or details from the text to describe its key ideas.","The student attempts to use illustrations or details, but the attempt is unsuccessful or largely irrelevant to the key ideas.","The student uses some illustrations or details from the text, but the connection to the key ideas is weak or unclear.","The student adequately uses illustrations and details from the text to describe some key ideas, but the explanation lacks depth or clarity.","The student effectively uses illustrations and details from the text to describe most key ideas with reasonable clarity and depth.","The student skillfully uses illustrations and details from the text to comprehensively describe the key ideas, demonstrating a deep understanding of their relationship."],["The student shows no understanding of the key ideas in the text.","The student demonstrates a minimal understanding of the key ideas, with significant misconceptions or omissions.","The student's understanding of the key ideas is superficial or incomplete, lacking nuance or depth.","The student demonstrates an adequate understanding of the key ideas but may miss some of the more subtle or complex aspects.","The student shows a strong understanding of the key ideas, accurately representing their main points and implications.","The student demonstrates a comprehensive and nuanced understanding of the key ideas, grasping their complexities and interrelationships."],["The student's description is disorganized and lacks coherence.","The student's description is difficult to follow and lacks a clear structure.","The student's description has some organization, but the ideas are not clearly connected.","The student presents a reasonably organized description of the key ideas, but transitions could be smoother.","The student's description is well-organized and coherent, with clear transitions between ideas.","The student presents a highly organized and coherent description that effectively synthesizes illustrations, details, and key ideas into a unified explanation."]]}