{"criteria":["Understanding of vocabulary and phrases","Use of context clues","Explanation of meaning"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the meaning of words and phrases in the text.","Student demonstrates a limited understanding of the meaning of words and phrases in the text, requiring significant teacher assistance.","Student demonstrates a partial understanding of the meaning of simple words and phrases in the text but struggles with more complex vocabulary.","Student demonstrates a satisfactory understanding of the meaning of most words and phrases in the text with occasional need for clarification.","Student demonstrates a strong understanding of the meaning of words and phrases in the text, including the ability to infer meaning from context.","Student demonstrates a comprehensive understanding of the meaning of words and phrases in the text, including nuances and connotations, and can explain their impact on the text as a whole."],["Student is unable to identify any context clues to determine the meaning of words and phrases.","Student struggles to identify context clues and relies heavily on direct definitions without considering the surrounding text.","Student identifies some context clues but has difficulty using them effectively to determine the meaning of unfamiliar words and phrases.","Student generally uses context clues to understand the meaning of words and phrases, but may miss subtle or indirect clues.","Student effectively uses context clues to determine the meaning of unfamiliar words and phrases, showing an ability to analyze the surrounding text.","Student skillfully uses a variety of context clues, including subtle and indirect references, to determine the meaning of complex words and phrases, demonstrating a deep understanding of the text."],["Student's explanation is completely irrelevant or nonsensical.","Student attempts to explain the meaning of words and phrases, but the explanation is unclear, inaccurate, or incomplete.","Student provides a basic explanation of the meaning of words and phrases, but lacks depth and detail.","Student explains the meaning of words and phrases with reasonable clarity and accuracy, providing sufficient detail.","Student explains the meaning of words and phrases clearly, accurately, and thoroughly, demonstrating a solid understanding.","Student provides insightful and nuanced explanations of the meaning of words and phrases, demonstrating a sophisticated understanding and ability to connect them to the broader context of the text."]]}