{"criteria":["Ability to ask and answer questions about key details in the text.","Accuracy and relevance of answers.","Use of textual evidence to support answers."],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to ask or answer any questions about the text.","Student can ask or answer basic 'who' or 'what' questions with significant prompting.","Student can ask or answer simple 'who,' 'what,' or 'where' questions about the text with some prompting.","Student can ask and answer 'who,' 'what,' 'where,' and 'when' questions, demonstrating a basic understanding of key details.","Student can ask and answer 'who,' 'what,' 'where,' 'when,' and 'why' questions, demonstrating a solid understanding of key details.","Student can ask and answer 'who,' 'what,' 'where,' 'when,' 'why,' and 'how' questions, demonstrating a comprehensive understanding of key details and drawing logical inferences."],["Responses are completely irrelevant or indicate no understanding of the text.","Responses are vague, unclear, and do not accurately reflect the content of the text; requires substantial interpretation.","Responses are partially relevant but may contain inaccuracies or omissions that affect the overall understanding.","Responses are generally accurate and relevant, covering most of the key details with minor omissions or inaccuracies.","Responses are accurate, relevant, and thoroughly address the key details of the text with clear explanations.","Responses are insightful, comprehensive, and demonstrate a deep understanding of the text, including nuanced interpretations and connections between details."],["Student provides no details or evidence from the text to support their answers.","Student attempts to provide details but they are vague, inaccurate, or irrelevant to the question.","Student provides some details from the text, but they may be insufficient or not clearly linked to the question.","Student provides relevant details from the text to support their answers, demonstrating a connection to the text.","Student provides specific and relevant details from the text to effectively support their answers, enhancing their clarity and credibility.","Student skillfully integrates textual evidence to support their answers, providing insightful analysis and demonstrating a deep understanding of the text's nuances."]]}