{"criteria":["Comparison of Main Points","Use of Textual Evidence","Organization and Coherence"],"points":[0,1,2,3,4,5],"descriptions":[["The response demonstrates no understanding of the texts or the ability to compare and contrast them.","The response shows minimal understanding of the texts and an inability to effectively compare and contrast their main points. There is little to no identification of important points.","The response demonstrates a limited understanding of the texts. An attempt to compare and contrast is made, but it is superficial and misses key distinctions. Only basic points are identified.","The response demonstrates a satisfactory understanding of the texts. The comparison and contrast of main points are present, but may lack depth or clarity. Some important points may be overlooked or misinterpreted.","The response demonstrates a strong understanding of both texts. The comparison and contrast of the most important points are clear, accurate, and well-supported. Minor details may be missing.","The response demonstrates a comprehensive understanding of the texts. The comparison and contrast of the most important points are insightful, nuanced, and thoroughly supported with textual evidence. Demonstrates a clear synthesis of information."],["No textual evidence is used.","Minimal or irrelevant textual evidence is presented.","Some textual evidence is present, but it is weak or not clearly connected to the comparison.","Relevant textual evidence is used to support some points, but more evidence is needed to strengthen the analysis.","Strong and relevant textual evidence is used to support the comparison and contrast of the main points.","Abundant, compelling, and relevant textual evidence is seamlessly integrated to support an insightful and thorough comparison and contrast."],["The response lacks organization and coherence, making it difficult to follow the comparison.","The response is poorly organized and lacks a clear structure. The comparison is disjointed and confusing.","The response has some organization, but it is not always clear how the points relate to one another.","The response is generally organized with a discernible structure, but there may be some lapses in coherence.","The response is well-organized with a clear and logical structure that enhances the comparison.","The response is exceptionally well-organized and coherent, with a sophisticated structure that enhances the clarity and impact of the comparison."]]}