{"criteria":["Identification and Explanation of Text Features","Ability to Locate Key Information","Justification of Information Retrieval"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of text features or their purpose.","Student identifies a few text features but struggles to explain their use in locating information.","Student identifies some text features and provides a basic explanation of how they can be used to locate information.","Student identifies most text features and explains how they can be used to locate information with reasonable accuracy.","Student identifies nearly all text features and accurately explains how they are used to efficiently locate key information.","Student expertly identifies and explains the function of various text features in efficiently locating key facts or information, demonstrating a comprehensive understanding."],["Student is unable to locate key facts or information using text features.","Student struggles significantly to locate key facts or information, even with guidance.","Student locates some key facts or information using text features but requires assistance.","Student locates most key facts or information using text features with minimal difficulty.","Student independently and efficiently locates almost all key facts or information using text features.","Student expertly and efficiently uses text features to locate all key facts or information in a text, demonstrating mastery of the standard."],["Student does not attempt to use text features or provide any justification for information retrieval.","Student attempts to use text features but provides illogical or unclear justification.","Student uses text features and provides a basic justification that may contain inaccuracies.","Student provides reasonable justification for their information retrieval, connecting it to specific text features.","Student provides clear and accurate justification for information retrieval, effectively linking it to the use of text features.","Student provides insightful and comprehensive justification for their information retrieval, demonstrating a nuanced understanding of how text features facilitate efficient information access."]]}