{"criteria":["Identification and Explanation of Supporting Reasons","Use of Textual Evidence","Organization and Clarity"],"points":[0,1,2,3,4,5],"descriptions":[["The response provides no discernible understanding of the author's reasons or points.","The response identifies an author's point, but struggles to find any supporting reasons.","The response identifies at least one reason, but the connection to the author's point is vague or weakly explained.","The response adequately describes how one or more reasons support specific points the author makes, but may lack depth or detail.","The response clearly and accurately describes how reasons support specific points the author makes, providing solid evidence from the text.","The response insightfully and thoroughly describes how reasons support specific points the author makes, demonstrating a deep understanding of the text and author's purpose."],["There is no use of textual evidence.","Minimal or irrelevant textual evidence is provided.","Some textual evidence is provided, but it is weakly connected to the explanation.","Relevant textual evidence is provided to support the explanation of the author's reasons and points.","Strong and specific textual evidence is used to effectively support the explanation, enhancing the clarity of the analysis.","The response skillfully integrates textual evidence, demonstrating a nuanced understanding of its relevance and impact on the author's argument."],["The response lacks organization and coherence, making it difficult to follow the explanation.","The response is poorly organized, with ideas presented in a confusing or illogical manner.","The response shows some organization, but transitions are weak and the overall structure is unclear.","The response is organized with a clear progression of ideas, aiding in the understanding of the author's reasons and points.","The response is well-organized and coherent, with smooth transitions that enhance the clarity of the analysis.","The response is exceptionally well-organized and articulate, demonstrating sophisticated control of language and structure to convey complex ideas effectively."]]}