{"criteria":["Comprehension of Informational Texts (Grades 2-3 Complexity)","Identification of Central Idea and Purpose","Recall and Synthesis of Key Details"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no comprehension of informational texts within the grades 2-3 text complexity band.","Student demonstrates minimal comprehension of informational texts within the grades 2-3 text complexity band, even with significant scaffolding.","Student demonstrates some comprehension of informational texts within the grades 2-3 text complexity band, but requires consistent scaffolding.","Student demonstrates comprehension of informational texts within the grades 2-3 text complexity band with occasional scaffolding.","Student demonstrates proficient comprehension of informational texts within the grades 2-3 text complexity band, requiring minimal scaffolding at the high end of the range.","Student independently and proficiently comprehends informational texts within the grades 2-3 text complexity band, demonstrating a strong understanding of the material."],["Student is unable to identify the central idea or purpose of the informational text.","Student struggles to identify the central idea or purpose, even when explicitly stated.","Student can identify the central idea or purpose with prompting and guidance.","Student can generally identify the central idea and purpose of the informational text.","Student clearly identifies the central idea and purpose of the informational text, providing supporting details.","Student thoroughly identifies the central idea and purpose of the informational text, analyzing its significance and impact."],["Student is unable to recall any key details or information from the text.","Student recalls very few key details, and these details are often inaccurate or irrelevant.","Student recalls some key details with prompting, but struggles to connect them to the central idea.","Student recalls most key details and connects them to the central idea with some accuracy.","Student accurately recalls key details and effectively uses them to support their understanding of the central idea.","Student expertly recalls and synthesizes key details, using them to provide a comprehensive and insightful analysis of the text."]]}