{"criteria":["Identification and Explanation of Images","Understanding of Image Clarification","Connection to Overall Text Purpose"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any images in the text.","The student identifies images in the text but does not attempt to explain their contribution.","The student vaguely identifies images and makes a weak attempt to explain their contribution to the text.","The student identifies specific images but provides a limited explanation of how they contribute to understanding the text.","The student clearly identifies specific images and explains how they contribute to the clarification and understanding of the text, demonstrating a good grasp of the image's purpose.","The student expertly identifies specific images, thoroughly explains how they enhance and clarify the text, and analyzes the impact of these images on the overall message and reader's understanding, showing a sophisticated understanding."],["The student demonstrates no understanding of how images clarify the text.","The student shows minimal awareness of how images might relate to the text's clarity.","The student makes a superficial connection between images and the text, with limited understanding of clarification.","The student explains with some clarity how images contribute to understanding the text, but lacks depth.","The student effectively explains how images clarify complex information or processes within the text.","The student insightfully analyzes how specific images enhance comprehension, offering nuanced understanding of their clarifying role and impact on conveying the text’s message effectively."],["The student does not relate the images to the overall purpose or message of the text.","The student vaguely mentions the image in relation to the text, without connecting it to the overall message.","The student makes a basic attempt to link the images to the text’s purpose, but the connection is unclear.","The student connects the images to specific points in the text, showing some understanding of the author's purpose.","The student clearly articulates how the images support the text’s main ideas and contribute to achieving the author's purpose.","The student expertly synthesizes the role of images in fulfilling the author’s intent, demonstrating a deep understanding of visual rhetoric and its contribution to the text's effectiveness and comprehensive understanding."]]}