{"criteria":["Identification of the Main Purpose","Supporting Details and Explanation","Connection to the Text"],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to identify any purpose of the text or provides a completely irrelevant response.","The student attempts to identify the purpose but struggles to articulate it clearly or accurately. The response is vague and lacks supporting details.","The student identifies a purpose of the text, but the explanation is superficial and lacks depth. The connection to the author's intent is unclear.","The student identifies the main purpose of the text with reasonable accuracy and provides some explanation or supporting details. The author's intent is partially understood.","The student clearly identifies the main purpose of the text and provides a solid explanation, demonstrating a good understanding of the author's intent and how it is conveyed.","The student expertly identifies the nuanced main purpose of the text, providing a comprehensive and insightful explanation. They demonstrate a deep understanding of the author's intent, the strategies used, and the text's broader implications."],["The student provides no details or irrelevant information when asked to describe or explain the author's intention.","The student struggles to provide relevant details, or the information provided is inaccurate or loosely connected to the text.","The student mentions some details related to the author's intention but struggles to clearly explain how these details support the identified purpose.","The student provides relevant details and explanation that offer some support for the identified purpose, but the connection could be stronger.","The student effectively uses relevant details and explanation to support the identified purpose, demonstrating a clear understanding of the text.","The student skillfully selects and integrates compelling details and explanation to fully support the identified purpose, revealing a sophisticated understanding of the text's nuances and complexities."],["The student does not attempt to connect the purpose to the text or offers an illogical connection.","The connection between the identified purpose and the text is weak, unclear, or not explicitly stated.","The student makes a basic connection between the identified purpose and the text, but the reasoning is simplistic or underdeveloped.","The student logically connects the identified purpose to specific elements within the text, providing a reasonable explanation of how they align.","The student clearly and logically connects the identified purpose to specific elements within the text, providing a well-reasoned and insightful explanation.","The student demonstrates a nuanced ability to connect the identified purpose to the text, synthesizing multiple elements and providing a compelling, original interpretation."]]}