{"criteria":["Identification of Main Points: How effectively does the student identify the central arguments or main ideas in each of the two texts?","Selection of Key Details: How well does the student select and present specific details that support the main points?","Comparison of Points and Details: How effectively does the student compare the main points and key details of the two texts, noting similarities and differences?","Clarity and Organization: How clearly and logically does the student present the comparison in writing?"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify any main points from either text.","Struggles to identify main points; provides vague or inaccurate summaries.","Identifies at least one main point from each text, but summaries may lack depth or accuracy.","Identifies most of the main points from both texts, providing reasonably accurate summaries.","Clearly and accurately identifies all the main points from both texts, demonstrating a good understanding of the authors' central arguments.","Masterfully identifies and articulates the main points of both texts, showing insightful comprehension and nuanced understanding."],["Provides no relevant details from either text.","Selects details that are irrelevant or do not support the identified main points.","Selects some relevant details, but the connection to the main points is unclear or weak.","Selects relevant details that generally support the main points; may miss some important details.","Selects key details that strongly support the main points, demonstrating a clear understanding of their importance.","Expertly selects and integrates key details that powerfully support the main points, enriching the comparison with insightful evidence."],["Makes no attempt to compare the texts or incorrectly states that the texts have nothing in common.","Offers a superficial comparison with minimal detail or inaccurate statements.","Identifies some similarities or differences, but the comparison lacks depth or clarity.","Compares several main points and key details, but the analysis may be somewhat superficial or incomplete.","Compares the most important points and key details effectively, clearly articulating similarities and differences.","Provides a sophisticated and nuanced comparison, insightfully analyzing the similarities and differences in the texts' arguments and supporting evidence."],["Response is disorganized and incomprehensible.","Response lacks organization and is difficult to follow.","Response is somewhat organized but contains digressions or unclear statements.","Response is generally clear and organized, with a logical flow of ideas.","Response is clear, concise, and well-organized, facilitating a strong understanding of the comparison.","Response is exceptionally clear, coherent, and logically structured, enhancing the impact of the comparison with skillful prose."]]}