{"criteria":["Identification of Author's Point of View","Articulation of Own Point of View","Distinction Between Points of View","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not attempt to identify the author's point of view.","Student vaguely identifies the author's point of view with significant inaccuracies.","Student identifies the author's point of view with some inaccuracies and a lack of supporting evidence.","Student adequately identifies the author's point of view with minor inaccuracies.","Student clearly and accurately identifies the author's point of view, providing relevant supporting evidence.","Student insightfully and accurately identifies the author's point of view, providing compelling supporting evidence and demonstrating a nuanced understanding."],["Student does not articulate their own point of view.","Student vaguely articulates their own point of view with no connection to the author's perspective.","Student articulates their own point of view, but it is unclear or weakly connected to the author's perspective.","Student articulates their own point of view and makes a basic connection to the author's perspective.","Student clearly articulates their own point of view and demonstrates a thoughtful connection to the author's perspective.","Student articulates a well-reasoned and insightful point of view, demonstrating a sophisticated understanding of its relationship to the author's perspective."],["Student makes no attempt to distinguish between their own and the author's point of view.","Student attempts to distinguish between points of view, but the distinction is unclear or inaccurate.","Student identifies some differences between their own and the author's point of view, but the analysis is superficial.","Student adequately distinguishes between their own and the author's point of view with some supporting reasoning.","Student clearly and effectively distinguishes between their own and the author's point of view, providing relevant reasoning.","Student insightfully distinguishes between their own and the author's point of view, providing compelling reasoning and demonstrating a nuanced understanding of the complexities involved."],["Student provides no textual evidence.","Student provides irrelevant or inaccurate textual evidence.","Student provides limited textual evidence that is weakly connected to their analysis.","Student provides adequate textual evidence to support their analysis.","Student provides relevant and well-integrated textual evidence to support their analysis effectively.","Student provides insightful and compelling textual evidence, demonstrating a deep understanding of the text and its relevance to their analysis."]]}