{"criteria":["Identification of Events\/Ideas\/Steps","Description of Relationships","Use of Temporal and Causal Language"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any relevant events, ideas, or steps from the text.","The student identifies one event, idea, or step, but it is vague or inaccurate.","The student identifies a few events, ideas, or steps, but struggles to accurately describe them.","The student identifies and describes several events, ideas, or steps from the text with reasonable accuracy.","The student accurately identifies and describes most of the key events, ideas, or steps from the text.","The student comprehensively and accurately identifies and describes all key events, ideas, or steps from the text."],["The student does not attempt to describe any relationships between the identified elements.","The student attempts to describe a relationship, but it is unclear, inaccurate, or missing cause\/effect.","The student describes a basic relationship between some of the elements but lacks depth or specific details.","The student describes relationships between several elements, including sequence and cause\/effect, with some supporting details.","The student clearly describes the relationships between most of the elements, using language that pertains to time, sequence, and cause\/effect.","The student expertly describes the complex relationships between all key elements, using precise language that effectively communicates time, sequence, and cause\/effect."],["The student's response lacks any language indicating time, sequence, or cause\/effect.","The student uses minimal language related to time, sequence, or cause\/effect, and it is often used incorrectly.","The student uses some language related to time, sequence, or cause\/effect, but it is limited and sometimes inaccurate.","The student appropriately uses language related to time, sequence, and cause\/effect to connect some of the ideas or steps.","The student consistently and accurately uses language related to time, sequence, and cause\/effect throughout the response.","The student skillfully and precisely uses a wide range of language related to time, sequence, and cause\/effect to enhance the description of relationships."]]}