{"criteria":["Understanding of Academic Vocabulary","Understanding of Domain-Specific Vocabulary","Contextual Understanding"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of general academic vocabulary in the text.","Student shows minimal understanding of general academic vocabulary; struggles to define or use words in context.","Student shows some understanding of general academic vocabulary but needs prompting to define or use words correctly.","Student generally understands general academic vocabulary and can define most words in context with occasional errors.","Student demonstrates a strong understanding of general academic vocabulary and accurately defines and uses words in context.","Student demonstrates a sophisticated understanding of general academic vocabulary, using words precisely and effectively in context; shows awareness of nuances in meaning."],["Student demonstrates no understanding of domain-specific vocabulary in the text.","Student shows minimal understanding of domain-specific vocabulary; struggles to define or use words in context.","Student shows some understanding of domain-specific vocabulary but needs prompting to define or use words correctly.","Student generally understands domain-specific vocabulary and can define most words in context with occasional errors.","Student demonstrates a strong understanding of domain-specific vocabulary and accurately defines and uses words in context.","Student demonstrates a sophisticated understanding of domain-specific vocabulary, using words precisely and effectively in context; shows awareness of nuances in meaning."],["Student is unable to determine the meaning of words or phrases based on the context of the text.","Student struggles to use context clues to determine the meaning of unfamiliar words or phrases.","Student can sometimes use context clues to determine the meaning of words or phrases with assistance.","Student generally uses context clues to understand the meaning of words and phrases, but may occasionally misinterpret.","Student effectively uses context clues to accurately determine the meaning of words and phrases in the text.","Student skillfully uses context clues and demonstrates a nuanced understanding of how context affects the meaning of words and phrases."]]}