{"criteria":["Ability to accurately answer questions based on explicit textual evidence.","Quality and relevance of textual references to support answers.","Clarity and coherence of answers."],"points":[0,1,2,3,4,5],"descriptions":[["Student provides no answers or answers are completely irrelevant to the text.","Student attempts to answer questions but demonstrates little to no understanding of the text; answers are vague or inaccurate.","Student answers some questions correctly but struggles to provide explicit textual evidence; understanding of the text is superficial.","Student answers most questions correctly, providing some textual evidence, but may occasionally misinterpret the text or provide insufficient support.","Student accurately answers questions, consistently referring to the text for support; demonstrates a solid understanding of the text.","Student accurately and thoroughly answers questions, providing comprehensive textual evidence and demonstrating a deep understanding of the text; offers insightful interpretations."],["No textual references are provided.","Textual references are irrelevant or do not support the answers provided.","Textual references are minimal and weakly connected to the answers.","Textual references are generally relevant and support the answers, but may lack depth or specificity.","Textual references are relevant, specific, and effectively support the answers.","Textual references are skillfully integrated, demonstrating a nuanced understanding of the text and strengthening the answers."],["Answers are incomprehensible or completely lacking in coherence.","Answers are difficult to understand and lack clear connections to the questions.","Answers are somewhat understandable but may be disorganized or confusing.","Answers are generally clear and organized, but may contain minor inconsistencies or lack precision.","Answers are clear, concise, and well-organized, demonstrating a strong command of language.","Answers are exceptionally clear, articulate, and insightful, demonstrating a sophisticated understanding of the text and effective communication skills."]]}