{"criteria":["Identification of Connections","Explanation of the Connection's Purpose","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any logical connections between sentences or paragraphs.","The student identifies a connection, but it is inaccurate or irrelevant to the text.","The student identifies a basic connection (e.g., sequence) but struggles to explain its significance.","The student identifies a logical connection and provides a somewhat clear explanation with limited textual evidence.","The student accurately describes a logical connection (comparison, cause\/effect, sequence) with relevant textual examples.","The student clearly and thoroughly describes the logical connection with insightful textual evidence, demonstrating a deep understanding of its impact on the text's meaning."],["The student does not attempt to explain the purpose or effect of the identified connection.","The student's explanation of the connection's purpose is unclear or illogical.","The student offers a vague explanation of the connection's purpose, but it lacks depth or supporting details.","The student provides a somewhat clear explanation of the connection's purpose, linking it to the immediate context but not the broader text.","The student clearly explains how the logical connection contributes to the development of ideas or arguments within the text.","The student insightfully analyzes the purpose and effect of the logical connection, explaining how it shapes the reader's understanding of the text's central themes and arguments."],["The student provides no textual evidence to support their analysis of the connection.","The student attempts to provide textual evidence, but it is irrelevant or inaccurately cited.","The student provides minimal textual evidence that weakly supports their analysis.","The student includes some relevant textual evidence, but it is not fully integrated into their explanation.","The student effectively uses specific textual evidence to support their analysis of the logical connection.","The student skillfully integrates relevant and compelling textual evidence, enhancing their insightful analysis of the logical connection and its significance to the text as a whole."]]}