{"criteria":["Comprehension of Main Ideas and Details","Analysis and Interpretation","Vocabulary and Language Use","Textual Evidence and Support"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text's main ideas or supporting details.","Struggles to identify the text's main ideas and provides inaccurate or irrelevant details.","Identifies the main ideas with some difficulty and provides basic details, but may miss important information.","Comprehends the main ideas and provides relevant details, but may have minor gaps in understanding.","Demonstrates a strong understanding of the text's main ideas and provides accurate and well-explained details.","Exhibits a comprehensive understanding of the text, articulates main ideas clearly, and supports them with insightful and accurate details."],["Offers no analysis or interpretation of the text.","Provides superficial or inaccurate interpretations of the text's meaning.","Attempts to analyze the text but struggles to support interpretations with evidence.","Offers a basic analysis of the text and supports interpretations with some evidence from the text.","Analyzes the text effectively, providing insightful interpretations supported by relevant evidence.","Demonstrates sophisticated analytical skills, offering nuanced interpretations supported by compelling evidence and insightful reasoning."],["Demonstrates no understanding of key vocabulary or uses language inappropriately.","Struggles to understand key vocabulary and uses language that is unclear or inaccurate.","Understands some key vocabulary but may misuse terms or struggle with precise language.","Uses appropriate vocabulary and language to convey understanding, but may lack precision or clarity.","Demonstrates a strong command of vocabulary and uses language effectively to communicate ideas clearly and accurately.","Exhibits exceptional vocabulary and language skills, using precise and sophisticated language to convey complex ideas with clarity and nuance."],["Provides no evidence from the text to support claims or interpretations.","Attempts to use textual evidence but provides inaccurate or irrelevant examples.","Includes some textual evidence but struggles to connect it effectively to claims or interpretations.","Supports claims and interpretations with relevant textual evidence, but may lack consistency or depth.","Effectively uses textual evidence to support claims and interpretations, demonstrating a strong connection between evidence and analysis.","Masterfully integrates textual evidence to support insightful analysis and interpretations, demonstrating a deep understanding of the text's complexities."]]}