{"criteria":["Text Comprehension","Analysis and Interpretation","Use of Evidence","Complexity"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text. Unable to identify the main idea or supporting details.","Demonstrates minimal understanding of the text. Struggles to identify the main idea or supporting details, even with significant scaffolding.","Demonstrates partial understanding of the text. Can identify the main idea with prompting but struggles with supporting details.","Demonstrates adequate understanding of the text. Can identify the main idea and some supporting details with moderate scaffolding.","Demonstrates good understanding of the text. Can independently identify the main idea and most supporting details.","Demonstrates excellent understanding of the text. Can independently and accurately identify the main idea and all supporting details, demonstrating a comprehensive grasp of the material."],["Unable to analyze or interpret the text.","Struggles to analyze or interpret the text, even with significant guidance.","Attempts to analyze or interpret the text but demonstrates limited understanding and relies heavily on prompting.","Provides a basic analysis or interpretation of the text with some reliance on scaffolding.","Provides a clear and mostly independent analysis or interpretation of the text, demonstrating a good understanding of its meaning and purpose.","Provides a insightful and independent analysis or interpretation of the text, demonstrating a comprehensive understanding of its nuances and implications."],["Provides no evidence from the text to support claims or understanding.","Provides minimal or irrelevant evidence from the text.","Provides some evidence from the text, but it is weak or not clearly connected to the claims.","Provides adequate evidence from the text to support claims, but the connections may not always be clear or fully developed.","Provides strong and relevant evidence from the text to support claims, demonstrating a clear understanding of its importance.","Provides compelling and insightful evidence from the text to support claims, demonstrating a deep understanding of its significance and effectively strengthens the analysis."],["Unable to read and comprehend texts within the grades 4-5 text complexity band.","Struggles significantly to read and comprehend texts within the grades 4-5 text complexity band, even with extensive support.","Reads and comprehends simpler texts within the grades 4-5 text complexity band with some difficulty and relies heavily on scaffolding.","Reads and comprehends texts within the grades 4-5 text complexity band with moderate scaffolding.","Reads and comprehends texts within the grades 4-5 text complexity band with minimal scaffolding.","Reads and comprehends texts within the grades 4-5 text complexity band proficiently and independently."]]}