{"criteria":["Accuracy of Explanation","Clarity of Explanation","Use of Specific Information from the Text","Addressing 'What Happened' and 'Why'"],"points":[0,1,2,3,4,5],"descriptions":[["The explanation is completely inaccurate or missing.","The explanation contains significant inaccuracies and demonstrates a poor understanding of the text.","The explanation has some inaccuracies and shows a limited understanding of the text.","The explanation is mostly accurate and demonstrates a general understanding of the text.","The explanation is accurate and demonstrates a good understanding of the text.","The explanation is exceptionally accurate, insightful, and demonstrates a comprehensive understanding of the text."],["The explanation is unclear and difficult to understand.","The explanation is somewhat unclear and requires significant effort to understand.","The explanation is understandable with some effort.","The explanation is generally clear and easy to understand.","The explanation is clear, concise, and easy to understand.","The explanation is exceptionally clear, well-organized, and effectively communicates complex information."],["The explanation does not include any specific information from the text.","The explanation includes very little specific information from the text.","The explanation includes some specific information from the text, but it may be vague or not directly relevant.","The explanation includes relevant specific information from the text to support the explanation.","The explanation includes specific and relevant information from the text to effectively support the explanation.","The explanation masterfully integrates specific and relevant information from the text to provide compelling support and enhance the explanation."],["The explanation does not address either 'what happened' or 'why'.","The explanation addresses either 'what happened' or 'why', but not both, and lacks depth.","The explanation attempts to address both 'what happened' and 'why', but the connection is weak.","The explanation addresses both 'what happened' and 'why' with a reasonable connection.","The explanation clearly addresses both 'what happened' and 'why', providing a strong and logical connection.","The explanation thoroughly and insightfully addresses both 'what happened' and 'why', revealing a deep understanding of cause-and-effect relationships."]]}