{"criteria":["Identification of Main Idea","Explanation of Supporting Details","Quality of Summary"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to identify the main idea or provides an inaccurate and irrelevant idea.","The student attempts to identify the main idea but struggles to articulate it clearly. The identified idea may be too broad or too narrow.","The student identifies the main idea, but the explanation lacks depth and may include minor inaccuracies.","The student accurately identifies the main idea and provides a generally clear explanation.","The student precisely identifies the main idea and clearly explains it with supporting reasoning.","The student masterfully identifies the central main idea, articulating it with precision and insightful rationale, demonstrating a comprehensive understanding of the text's core message."],["The student does not identify or explain any key details that support the main idea.","The student identifies few key details, but the explanation of how they support the main idea is missing or unclear.","The student identifies some key details and attempts to explain how they support the main idea, but the connection is weak or superficial.","The student identifies and explains several key details that support the main idea, demonstrating a reasonable understanding of their relevance.","The student effectively identifies and explains multiple key details, clearly demonstrating how they strongly support the main idea.","The student expertly identifies and analyzes a comprehensive range of key details, elucidating their profound and nuanced support for the main idea with exceptional clarity and insight."],["The student does not attempt to summarize the text, or the attempt is completely incoherent and irrelevant.","The student attempts a summary, but it is extremely brief, disjointed, and fails to capture the essence of the text.","The student provides a summary that is somewhat incomplete or contains significant inaccuracies.","The student provides a reasonable summary of the text that captures the main points, but lacks depth.","The student provides a clear, concise, and accurate summary of the text, highlighting the most important information.","The student delivers an exceptionally comprehensive and articulate summary, masterfully distilling the essence of the text while retaining its richness and complexity, demonstrating a superior command of the material."]]}