{"criteria":["Selection of Relevant Information","Accuracy of Integrated Information","Organization and Clarity","Use of Language"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no attempt to select relevant information from either text.","The student selects minimal relevant information from one text, with no integration.","The student selects some relevant information from both texts, but struggles to connect them.","The student selects mostly relevant information from both texts and attempts to integrate it, but connections are superficial.","The student effectively selects relevant information from both texts and integrates it to support a clear understanding of the topic.","The student expertly selects and synthesizes relevant information from both texts, demonstrating a comprehensive and nuanced understanding of the topic."],["The integrated information presents inaccurate or distorted representations of the original texts.","The integrated information contains several inaccuracies or misinterpretations of the original texts.","The integrated information has some inaccuracies and demonstrates a limited understanding of the original texts.","The integrated information is generally accurate but may contain minor errors or oversimplifications.","The integrated information is accurate and reflects a strong understanding of the original texts.","The integrated information is exceptionally accurate, demonstrating a deep and insightful understanding of the original texts."],["The integrated information is presented in a disorganized manner and lacks clarity.","The integrated information is poorly organized and difficult to follow.","The integrated information shows some organization but lacks clear connections between ideas.","The integrated information is generally organized and clear, but could benefit from improved transitions or structure.","The integrated information is well-organized and clearly presented, with logical transitions and a coherent structure.","The integrated information is exceptionally well-organized, demonstrating a masterful command of structure, transitions and clarity."],["The language is imprecise and inappropriate for academic discourse.","The language is basic and contains frequent errors that impede understanding.","The language is adequate but lacks sophistication or precision.","The language is generally precise and appropriate for the task, with few errors.","The language is precise, varied, and appropriate for academic discourse, enhancing the clarity and impact of the message.","The language is exceptionally sophisticated, precise, and engaging, demonstrating a masterful command of vocabulary and sentence structure."]]}