{"criteria":["Understanding of Academic Vocabulary","Understanding of Domain-Specific Vocabulary","Application of Context Clues"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of general academic vocabulary within the text.","Student shows minimal understanding of general academic vocabulary; struggles to define even common terms.","Student demonstrates a basic understanding of some general academic vocabulary but needs prompting to define terms in context.","Student understands and can define most general academic vocabulary, using context clues with some accuracy.","Student demonstrates a strong understanding of general academic vocabulary and can accurately define terms using context clues.","Student exhibits an excellent command of general academic vocabulary, using context to infer nuanced meanings and demonstrating sophisticated understanding."],["Student demonstrates no understanding of domain-specific vocabulary within the text.","Student shows minimal understanding of domain-specific vocabulary; struggles to define even basic terms related to the topic.","Student demonstrates a basic understanding of some domain-specific vocabulary but needs prompting to define terms in context.","Student understands and can define most domain-specific vocabulary, using context clues with some accuracy.","Student demonstrates a strong understanding of domain-specific vocabulary and can accurately define terms using context clues.","Student exhibits an excellent command of domain-specific vocabulary, using context to infer nuanced meanings and demonstrating sophisticated understanding."],["Student does not attempt to use context clues to determine the meaning of unfamiliar words or phrases.","Student attempts to use context clues but is largely unsuccessful in determining the meaning of words or phrases.","Student inconsistently uses context clues to determine the meaning of words or phrases, with limited success.","Student generally uses context clues effectively to determine the meaning of words or phrases, with occasional errors.","Student consistently and effectively uses context clues to determine the meaning of words or phrases.","Student expertly uses context clues, including subtle hints and inferences, to determine the nuanced meaning of words and phrases, demonstrating mastery."]]}