{"criteria":["Identification of Visual\/Oral\/Quantitative Information","Explanation of Contribution to Text Understanding","Analysis of Information Type (Charts, Graphs, etc.)"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify any visual, oral, or quantitative information presented.","Identifies visual, oral, or quantitative information with significant inaccuracies.","Identifies some visual, oral, or quantitative information, but misses key elements or provides superficial understanding.","Identifies most visual, oral, or quantitative information accurately, demonstrating a basic understanding.","Accurately identifies visual, oral, and quantitative information, demonstrating a clear understanding of the data presented.","Accurately and comprehensively identifies visual, oral, and quantitative information, demonstrating insightful understanding."],["Unable to explain how the information contributes to understanding the text.","Offers an unclear or irrelevant explanation of the information's contribution.","Provides a limited explanation of how the information relates to the text, lacking depth or specific examples.","Explains how the information contributes to a general understanding of the text, with some supporting details.","Clearly explains how the information enhances understanding of specific aspects of the text, providing relevant details.","Insightfully explains how the information significantly contributes to a comprehensive understanding of the text, offering nuanced interpretations and relevant examples."],["Does not recognize or address the type of information presented.","Misidentifies the type of information or offers an irrelevant analysis.","Identifies the type of information but provides a superficial analysis of its features.","Analyzes the basic features of the information type and its relevance to the text.","Provides a detailed analysis of the information type, explaining how its specific features contribute to understanding the text.","Offers a sophisticated analysis of the information type, demonstrating a nuanced understanding of how its features shape and enhance the text's meaning."]]}