{"criteria":["Identification of Firsthand and Secondhand Accounts","Comparison of Focus in Accounts","Comparison of Information Provided","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not identify or inaccurately identifies firsthand and secondhand accounts.","Student identifies at least one type of account accurately.","Student identifies both firsthand and secondhand accounts, but with some inaccuracies.","Student correctly identifies firsthand and secondhand accounts.","Student correctly identifies firsthand and secondhand accounts and provides basic explanations of their differences.","Student correctly identifies firsthand and secondhand accounts and provides detailed explanations of their differences."],["Student does not attempt to compare the focus of the accounts.","Student makes a vague attempt to compare the focus, but lacks clarity.","Student identifies a similarity or difference in focus, but explanation is weak.","Student compares the focus of the accounts and provides a clear explanation.","Student effectively compares the focus of the accounts, explaining nuances and providing supporting details.","Student insightfully compares the focus of the accounts, demonstrating a deep understanding of perspective and purpose."],["Student does not attempt to compare the information provided in the accounts.","Student makes a vague attempt to compare the information, but lacks clarity.","Student identifies a similarity or difference in information, but explanation is weak.","Student compares the information provided in the accounts and provides a clear explanation.","Student effectively compares the information provided, explaining nuances and providing supporting details.","Student insightfully compares the information provided, demonstrating a deep understanding of bias, reliability and comprehensiveness."],["Response is unclear and disorganized, making it difficult to understand the comparison.","Response is somewhat unclear and disorganized, hindering understanding.","Response is generally clear and organized, but may have minor issues.","Response is clear, well-organized, and easy to follow.","Response is exceptionally clear, well-organized, and logically structured.","Response is exceptionally clear, well-organized, and logically structured, and is written with eloquence."]]}