{"criteria":["Identification of the Overall Structure","Description of Events, Ideas, Concepts, or Information","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any organizational structure within the text.","The student attempts to identify the text's organizational structure but is inaccurate or provides minimal detail.","The student identifies a possible organizational structure but does not fully explain it.","The student correctly identifies the text's primary organizational structure (e.g., chronology, comparison, cause\/effect, problem\/solution).","The student clearly and accurately describes the text's primary organizational structure with supporting examples from the text.","The student thoroughly and insightfully describes the text's organizational structure, including nuances and complexities, and provides compelling textual evidence."],["The student fails to describe events, ideas, concepts, or information presented in the text.","The student attempts to describe events, ideas, concepts, or information but is unclear or inaccurate.","The student describes some events, ideas, concepts, or information but lacks depth or detail.","The student accurately describes the key events, ideas, concepts, or information presented in the text.","The student provides a detailed and comprehensive description of events, ideas, concepts, or information, demonstrating a clear understanding.","The student offers an insightful and nuanced description of events, ideas, concepts, or information, demonstrating a deep comprehension and ability to connect them to broader themes."],["The student provides no textual evidence to support their description of the text's structure.","The student attempts to provide textual evidence but it is irrelevant or inaccurate.","The student provides some textual evidence, but it is limited or not well-integrated.","The student provides relevant textual evidence to support their description of the text's structure.","The student effectively uses textual evidence to enhance and support their explanation of the text's organizational structure.","The student skillfully integrates textual evidence to provide a compelling and insightful analysis of the text's organizational structure."]]}