{"criteria":["Identification of Explicit Details","Explanation of Explicit Meaning","Drawing Inferences from the Text","Use of Examples to Support Inferences"],"points":[0,1,2,3,4,5],"descriptions":[["No explicit details from the text are identified or mentioned.","Attempts to identify explicit details are vague and lack connection to the text.","Identifies a few explicit details, but the connection to the text is superficial.","Identifies several explicit details from the text, with a basic understanding of their relevance.","Clearly identifies and accurately presents explicit details, demonstrating a good understanding of their importance.","Masterfully identifies and explains explicit details, showing a comprehensive understanding of their significance within the text."],["Unable to explain what the text says explicitly.","Explanation of the text's explicit meaning is unclear and lacks supporting evidence.","Provides a limited explanation of the text's explicit meaning, but lacks depth and clarity.","Explains the text's explicit meaning with some clarity, referencing details from the text.","Clearly and accurately explains the text's explicit meaning, using relevant details to support the explanation.","Insightfully and comprehensively explains the text's explicit meaning, demonstrating a deep understanding of the author's message."],["No inferences are drawn from the text.","Attempts to draw inferences are illogical or unsupported by the text.","Draws simple inferences with limited connection to the text's details.","Draws reasonable inferences from the text, supported by some evidence.","Draws well-reasoned and logical inferences, providing clear evidence from the text to support them.","Draws insightful and nuanced inferences, demonstrating a sophisticated understanding of the text's subtext and implications."],["No examples are used to support inferences.","Examples provided are irrelevant or do not support the inferences made.","Uses examples that are loosely related to the inferences, but the connection is weak.","Provides examples from the text that generally support the inferences drawn.","Selects and uses relevant examples effectively to strengthen and clarify the inferences.","Masterfully uses examples to illuminate the inferences, demonstrating a deep and nuanced understanding of the text."]]}