{"criteria":["Identification of Author's Points","Explanation of Reasons","Explanation of Evidence","Clarity and Coherence of Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any points made by the author.","The student identifies a point made by the author but it is vague or inaccurate.","The student identifies a point made by the author, but it is not entirely clear or complete.","The student accurately identifies a point made by the author.","The student accurately identifies a point made by the author and provides some context.","The student accurately identifies a point made by the author and provides a clear and comprehensive understanding of its significance."],["The student does not explain how the author uses reasons.","The student attempts to explain the author's use of reasons, but the explanation is unclear or irrelevant.","The student identifies a reason used by the author, but the explanation of its purpose is superficial.","The student explains how the author uses reasons to support their point.","The student thoroughly explains how the author uses reasons to effectively support their point, demonstrating a solid understanding.","The student insightfully explains how the author strategically uses reasons to strengthen their point, showcasing a deep understanding of rhetorical techniques."],["The student does not explain how the author uses evidence.","The student attempts to explain the author's use of evidence, but the explanation is unclear or irrelevant.","The student identifies a piece of evidence used by the author, but the explanation of its connection to the point is weak.","The student explains how the author uses evidence to support their point.","The student thoroughly explains how the author uses specific evidence to convincingly support their point, showing a strong grasp of the text.","The student perceptively explains how the author skillfully uses evidence to build a compelling argument, revealing a nuanced understanding of the text's persuasive elements."],["The student's explanation is unclear and lacks coherence.","The student's explanation is difficult to follow and lacks logical organization.","The student's explanation is somewhat clear but may lack sufficient detail or organization.","The student's explanation is clear and coherent, effectively conveying their understanding.","The student's explanation is well-organized, uses precise language, and demonstrates a strong command of the material.","The student's explanation is exceptionally clear, insightful, and demonstrates a sophisticated understanding of the author's use of reasons and evidence."]]}