{"criteria":["Selection of Relevant Information: How well does the student choose information directly related to the topic from the provided texts?","Integration of Information: How effectively does the student combine information from multiple texts to present a cohesive understanding?","Knowledgeable Presentation: How thoroughly and accurately does the student present the information, demonstrating their understanding of the subject?","Clarity and Organization: How clear and logically organized is the student's presentation of the integrated information?"],"points":[0,1,2,3,4,5],"descriptions":[["No information selected from any text.","Information selected is minimal and largely irrelevant to the topic.","Some relevant information is selected, but significant portions are off-topic.","Most information selected is relevant, with only minor instances of irrelevant details.","Information selected is consistently relevant and supports a focused discussion of the topic.","Information selected is exceptionally relevant, demonstrating a keen understanding of the topic's nuances and directly contributing to insightful commentary."],["No attempt to integrate information from multiple sources.","Information is presented in isolated chunks with no clear connection between texts.","Attempts to integrate information are superficial, lacking depth and clear synthesis.","Information is generally integrated, but connections between texts could be stronger and more insightful.","Information is integrated effectively, creating a coherent and synthesized understanding of the topic.","Information is masterfully integrated, creating new insights and a comprehensive understanding that goes beyond the individual texts."],["Presentation demonstrates no understanding of the subject matter.","Presentation is confused and contains significant inaccuracies.","Presentation is partially accurate, but demonstrates a limited understanding of the subject.","Presentation is generally accurate and demonstrates a reasonable understanding of the subject.","Presentation is accurate, thorough, and demonstrates a strong understanding of the subject.","Presentation is exceptionally knowledgeable, insightful, and reflects a mastery of the subject matter."],["Presentation is disorganized and incomprehensible.","Presentation lacks a clear structure and is difficult to follow.","Presentation has some organization, but lacks clarity in places.","Presentation is generally clear and organized, but could benefit from better transitions or focus.","Presentation is clear, well-organized, and easy to follow, with logical flow and transitions.","Presentation is exceptionally clear, meticulously organized, and engaging, enhancing the audience's understanding of the subject."]]}