{"criteria":["Understanding of Academic Vocabulary","Understanding of Domain-Specific Vocabulary","Contextual Analysis Skills"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of general academic vocabulary within the text.","Struggles to identify or define general academic vocabulary; demonstrates limited understanding.","Identifies some general academic vocabulary but struggles to define it accurately or apply it to the text.","Generally understands and can define most general academic vocabulary within the text, but application may be basic.","Clearly understands, defines, and applies general academic vocabulary to interpret the text effectively.","Masterfully understands, defines, and applies general academic vocabulary, using nuance to enhance interpretation and analysis."],["Demonstrates no understanding of domain-specific vocabulary within the text.","Struggles to identify or define domain-specific vocabulary; demonstrates limited understanding.","Identifies some domain-specific vocabulary but struggles to define it accurately or apply it to the text.","Generally understands and can define most domain-specific vocabulary within the text, but application may be basic.","Clearly understands, defines, and applies domain-specific vocabulary to interpret the text effectively.","Masterfully understands, defines, and applies domain-specific vocabulary, using nuance to enhance interpretation and analysis."],["Unable to use context clues to infer the meaning of unknown words or phrases.","Attempts to use context clues, but struggles to derive accurate meanings.","Sometimes uses context clues effectively, but often relies on direct definitions without deeper understanding.","Usually able to use context clues to infer the meaning of unknown words and phrases, demonstrating a solid understanding.","Consistently and effectively uses context clues to determine the meaning of unfamiliar words and phrases, enhancing overall comprehension.","Expertly uses context clues to derive nuanced meanings of words and phrases, demonstrating a sophisticated understanding of the text."]]}