{"criteria":["Identification of Accounts","Analysis of Similarities","Analysis of Differences","Understanding of Point of View"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any accounts related to the event or topic.","The student identifies only one account or incorrectly identifies accounts.","The student identifies multiple accounts but struggles to provide basic information about them.","The student accurately identifies multiple accounts of the event or topic and provides a brief overview of each.","The student identifies multiple accounts, providing detailed descriptions of each, including their origins and contexts.","The student expertly identifies and describes multiple accounts, demonstrating a comprehensive understanding of their backgrounds."],["The student does not identify any similarities between the accounts.","The student attempts to identify similarities, but the analysis is superficial or incorrect.","The student identifies a few basic similarities but does not explore them in depth.","The student identifies several significant similarities between the accounts, providing some supporting details.","The student thoroughly analyzes the similarities, providing insightful explanations and supporting evidence from the accounts.","The student provides a nuanced and comprehensive analysis of the similarities, demonstrating a deep understanding of the event or topic."],["The student does not identify any differences between the accounts.","The student attempts to identify differences, but the analysis is superficial or incorrect.","The student identifies a few basic differences but does not explore them in depth.","The student identifies several significant differences between the accounts, providing some supporting details.","The student thoroughly analyzes the differences, providing insightful explanations and supporting evidence from the accounts.","The student provides a nuanced and comprehensive analysis of the differences, demonstrating a deep understanding of the event or topic."],["The student demonstrates no understanding of the concept of point of view.","The student attempts to address point of view, but the analysis is confused or irrelevant.","The student identifies point of view in a limited way, without clear connections to the accounts.","The student explains how point of view affects the content of the accounts, using relevant examples.","The student thoroughly analyzes how point of view shapes the accounts, providing detailed examples and clear explanations.","The student expertly analyzes the impact of point of view, demonstrating a sophisticated understanding of its influence on the accounts."]]}