{"criteria":["Accuracy of Comprehension: Demonstrates understanding of the central ideas and key details in informational texts.","Independence and Proficiency: Reads and comprehends informational texts independently and at a proficient level for the grade band.","Text Complexity: Comprehends informational texts within the grades 4-5 text complexity band.","Integration of Knowledge and Ideas: Connects prior knowledge to new information to deepen understanding."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text. Misinterprets information or provides irrelevant responses.","Demonstrates minimal understanding of the text. Struggles to identify central ideas or key details.","Demonstrates partial understanding of the text. Identifies some central ideas and key details, but with inaccuracies or omissions.","Demonstrates satisfactory understanding of the text. Identifies central ideas and key details with reasonable accuracy.","Demonstrates thorough understanding of the text. Accurately identifies central ideas and key details, and makes logical inferences.","Demonstrates comprehensive understanding of the text. Accurately identifies central ideas and key details, makes insightful inferences, and connects information to broader contexts."],["Requires significant support to read and understand the text. Unable to comprehend the text independently.","Requires considerable support to read and understand the text. Struggles to comprehend the text independently.","Requires some support to read and understand the text. Demonstrates limited independence in comprehension.","Reads and comprehends the text with minimal support. Demonstrates increasing independence in comprehension.","Reads and comprehends the text independently with proficiency. Demonstrates strong comprehension skills.","Reads and comprehends the text independently with exceptional proficiency. Demonstrates mastery of comprehension skills and can tackle complex texts with ease."],["Unable to comprehend texts within the grades 4-5 text complexity band. Struggles with basic vocabulary and sentence structure.","Struggles to comprehend texts within the grades 4-5 text complexity band. Requires assistance with vocabulary and sentence structure.","Demonstrates limited comprehension of texts within the grades 4-5 text complexity band. May struggle with more complex vocabulary or sentence structures.","Comprehends texts within the grades 4-5 text complexity band with reasonable proficiency. Demonstrates understanding of vocabulary and sentence structure.","Comprehends texts within the grades 4-5 text complexity band proficiently. Demonstrates strong understanding of vocabulary and sentence structure.","Comprehends texts within the grades 4-5 text complexity band with exceptional proficiency. Demonstrates mastery of vocabulary, sentence structure, and complex ideas."],["Unable to connect prior knowledge to new information. Demonstrates no ability to relate the text to personal experiences or other texts.","Struggles to connect prior knowledge to new information. Demonstrates limited ability to relate the text to personal experiences or other texts.","Makes superficial connections between prior knowledge and new information. Demonstrates some ability to relate the text to personal experiences or other texts.","Connects prior knowledge to new information with reasonable depth. Relates the text to personal experiences or other texts with some relevance.","Connects prior knowledge to new information effectively. Relates the text to personal experiences or other texts with clear relevance and insight.","Integrates prior knowledge and new information seamlessly to create a rich understanding. Relates the text to personal experiences or other texts with profound relevance and insight."]]}