{"criteria":["Identification of Author's Points","Explanation of Reasons and Evidence","Connection Between Reasons\/Evidence and Points"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any of the author's main points.","The student identifies one or two of the author's points with significant inaccuracies.","The student identifies some of the author's points, but with some inaccuracies or omissions.","The student identifies most of the author's key points accurately.","The student identifies all the author's key points accurately and comprehensively.","The student identifies all the author's key points accurately, comprehensively, and demonstrates a nuanced understanding of their significance."],["The student provides no explanation of the author's reasons or evidence.","The student attempts to explain the author's reasons or evidence, but the explanation is unclear, irrelevant, or inaccurate.","The student provides a basic explanation of the author's reasons or evidence, but lacks depth or clarity.","The student explains the author's reasons and evidence adequately, demonstrating a general understanding.","The student explains the author's reasons and evidence clearly and thoroughly, demonstrating a strong understanding.","The student explains the author's reasons and evidence with exceptional clarity, insight, and sophistication, demonstrating a deep and nuanced understanding."],["The student makes no attempt to connect the reasons\/evidence to the author's points.","The student attempts to connect the reasons\/evidence to the author's points, but the connection is unclear or inaccurate.","The student makes a weak connection between the reasons\/evidence and the author's points, with some inaccuracies or omissions.","The student connects the reasons\/evidence to the author's points effectively, demonstrating a general understanding of the relationship.","The student clearly and accurately connects the reasons\/evidence to the author's points, demonstrating a strong understanding of the relationship.","The student expertly connects the reasons\/evidence to the author's points, demonstrating a sophisticated and nuanced understanding of the relationship and its implications."]]}