{"criteria":["Accuracy of Cited Evidence","Quality of Analysis & Inferences","Clarity and Coherence"],"points":[0,1,2,3,4,5],"descriptions":[["No textual evidence is cited, or the cited evidence is completely irrelevant to the analysis.","Cited evidence is minimal and\/or contains significant inaccuracies, misrepresenting the text's meaning.","Cited evidence has some inaccuracies or is loosely related to the analysis; clarification is needed.","Cited evidence is generally accurate and relevant, but may lack depth or precision.","Cited evidence is accurate, relevant, and supports the analysis well with clear connections made.","Cited evidence is not only accurate and relevant but also strategically chosen to provide compelling support for a sophisticated analysis. Demonstrates deep understanding of the text."],["No analysis or inferences are present, or they are completely illogical.","Analysis and inferences are superficial, illogical, or contradict the text.","Analysis and inferences are simplistic, and\/or not clearly connected to the cited evidence.","Analysis and inferences are reasonable and connected to the cited evidence, but lack depth or originality.","Analysis and inferences are insightful, well-developed, and clearly supported by the cited evidence.","Analysis and inferences are exceptionally insightful, nuanced, and demonstrate a sophisticated understanding of the text's complexities. Offers original interpretations supported by compelling evidence."],["The response is incomprehensible and lacks any clear structure.","The response is poorly organized and difficult to understand, with frequent errors in grammar and mechanics.","The response is somewhat organized, but clarity is lacking; errors in grammar and mechanics impede understanding.","The response is generally clear and organized, with few errors in grammar and mechanics.","The response is clear, well-organized, and effectively communicates the analysis; minor errors may be present but do not impede understanding.","The response is exceptionally clear, coherent, and demonstrates masterful command of language. Ideas are presented logically and persuasively."]]}