{"criteria":["Identification of Key Individual, Event, or Idea","Analysis of Introduction","Analysis of Illustration and Elaboration","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify a key individual, event, or idea in the text.","Identifies a key individual, event, or idea, but the choice is not well-supported by the text.","Identifies a key individual, event, or idea, but lacks detail.","Identifies a key individual, event, or idea and provides a basic description.","Clearly identifies a key individual, event, or idea and provides a detailed description supported by textual evidence.","Insightfully identifies a key individual, event, or idea, providing a nuanced and thorough description with compelling textual support."],["Does not address how the individual, event, or idea is introduced in the text.","Mentions the introduction but offers no analysis.","Provides a superficial description of the introduction.","Analyzes how the individual, event, or idea is introduced, but lacks depth.","Provides a clear and detailed analysis of how the individual, event, or idea is introduced, using specific examples from the text.","Offers a perceptive and comprehensive analysis of the introduction, demonstrating a sophisticated understanding of the author's choices and their impact."],["Does not address how the individual, event, or idea is illustrated and elaborated in the text.","Mentions illustration and elaboration but offers no analysis.","Provides a superficial description of the illustration and elaboration.","Analyzes how the individual, event, or idea is illustrated and elaborated, but lacks specific examples.","Provides a clear analysis of how the individual, event, or idea is illustrated and elaborated through examples and anecdotes.","Offers an insightful and comprehensive analysis of the illustration and elaboration, demonstrating a sophisticated understanding of the author's techniques and their effect on the reader."],["Provides no textual evidence to support claims.","Provides minimal and\/or irrelevant textual evidence.","Provides some textual evidence, but it is not always relevant or well-explained.","Provides relevant textual evidence to support most claims.","Consistently provides well-explained and relevant textual evidence to support all claims.","Skillfully integrates textual evidence to provide insightful and compelling support for all claims, demonstrating a deep understanding of the text."]]}