{"criteria":["Understanding the Role of Sentences and Paragraphs","Analysis of Text Features in Popular Media","Integration and Synthesis"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of how sentences and paragraphs contribute to the overall structure or development of ideas.","Student shows minimal understanding of how sentences and paragraphs contribute to the overall structure or development of ideas. Explanation is unclear or inaccurate.","Student identifies that sentences and paragraphs contribute to the overall structure or development of ideas, but struggles to explain how.","Student generally understands how sentences and paragraphs contribute to the overall structure and development of ideas, with some minor inaccuracies.","Student clearly explains how specific sentences and paragraphs contribute to the overall structure and development of ideas, with accurate supporting details.","Student demonstrates a sophisticated understanding of how sentences and paragraphs contribute to the overall structure and development of ideas, providing insightful analysis and relevant examples."],["Student fails to identify or analyze any text features (e.g., graphics, headers, captions) in popular media.","Student identifies text features but demonstrates no understanding of their purpose or effect.","Student identifies some text features and attempts to explain their purpose, but analysis is superficial or incomplete.","Student identifies and describes the purpose of text features in popular media, but analysis lacks depth.","Student analyzes the use of text features in popular media, explaining their purpose and impact on the audience with specific examples.","Student provides a comprehensive and insightful analysis of the use of text features in popular media, demonstrating a nuanced understanding of their rhetorical effect and strategic purpose."],["Student is unable to connect individual elements to the overall purpose and structure of the text.","Student attempts to connect individual elements, but connections are vague and unsubstantiated.","Student makes basic connections between individual elements and the overall text, but analysis is limited.","Student integrates several elements to explain their impact on the overall text, showing a good understanding of their relationship.","Student effectively synthesizes different elements to provide a cohesive analysis of how the text functions as a whole.","Student masterfully integrates and synthesizes diverse elements, offering a profound and comprehensive understanding of the text's structure and purpose."]]}