{"criteria":["Text Comprehension and Understanding","Analysis and Interpretation","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the text; struggles to identify the main idea or key details.","Student demonstrates minimal understanding of the text; has difficulty identifying the main idea and struggles with key details even with significant scaffolding.","Student demonstrates partial understanding of the text; can identify the main idea with prompting and some key details with support.","Student demonstrates adequate understanding of the text; can identify the main idea and most key details with minimal scaffolding.","Student demonstrates strong understanding of the text; can clearly identify the main idea and key details with minimal errors.","Student demonstrates excellent understanding of the text; accurately identifies the main idea, key details, and nuances within the text."],["Student provides no analysis or interpretation of the text.","Student attempts to analyze the text but provides superficial or irrelevant interpretations with significant guidance.","Student offers limited analysis and interpretation of the text, with some reliance on provided support.","Student provides a basic analysis and interpretation of the text, demonstrating a general understanding of its meaning.","Student offers a detailed analysis and interpretation of the text, showing insight and drawing logical conclusions.","Student provides a comprehensive and insightful analysis and interpretation of the text, demonstrating critical thinking and a deep understanding of its complexities."],["Student provides no textual evidence to support their comprehension or analysis.","Student attempts to use textual evidence but does so inaccurately or irrelevantly, with significant support.","Student uses textual evidence sporadically and with limited effectiveness; struggles to connect evidence to claims.","Student uses textual evidence to support their comprehension and analysis, but may lack precision or consistency.","Student effectively uses textual evidence to support their comprehension and analysis, demonstrating a clear connection between evidence and claims.","Student skillfully and consistently uses relevant textual evidence to support their comprehension and analysis, enhancing the depth and credibility of their interpretations."]]}