{"criteria":["Understanding of Figurative Language","Understanding of Connotative Language","Understanding of Technical Meanings"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of figurative language used in the text.","Student identifies figurative language but struggles to explain its meaning or purpose.","Student identifies some instances of figurative language and attempts to explain their meaning, but with limited success.","Student correctly identifies and explains the meaning of basic figurative language (e.g., simile, metaphor) in the text.","Student demonstrates a strong understanding of figurative language, explaining its nuances and effects on the text.","Student demonstrates a sophisticated understanding of figurative language, including less common devices, and analyzes their impact on the text's meaning and tone."],["Student shows no awareness of connotative meanings in the text.","Student recognizes that words can have connotations but cannot identify specific examples.","Student identifies some connotative meanings but struggles to explain their significance in the context of the text.","Student correctly identifies and explains the connotations of several key words or phrases in the text.","Student demonstrates a strong understanding of connotative language and its effect on the text's meaning and emotional impact.","Student analyzes the subtle nuances of connotative language and its contribution to the overall tone and message of the text."],["Student does not recognize or understand technical terms used in the text.","Student identifies some technical terms but cannot explain their meanings.","Student attempts to explain technical terms but demonstrates a limited understanding of their precise meanings.","Student accurately defines most of the technical terms used in the text, showing an understanding of their specific applications.","Student demonstrates a strong command of technical terminology, explaining its significance within the context of the text.","Student expertly analyzes the use of technical language and its impact on the text's clarity and precision."]]}