{"criteria":["Identifying Claims","Evaluating Evidence and Reasoning","Distinguishing Supported vs. Unsupported Claims","Tracing the Argument"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify any claims within the text.","Identifies claims, but struggles to distinguish between main and supporting claims.","Identifies some main and supporting claims but misses key components.","Accurately identifies most main and supporting claims within the text.","Identifies and accurately describes all main and supporting claims within the text.","Masterfully identifies and explains all claims, including nuanced or implied claims."],["Unable to determine if claims are supported by evidence or reasoning.","Attempts to evaluate evidence, but confuses reasoning and evidence.","Can identify if a claim has evidence, but cannot evaluate the strength of evidence.","Evaluates the evidence and can determine if evidence is strong or weak and if reasoning is relevant, but misses nuances.","Accurately evaluates evidence and reasoning, explaining their relevance to the claim.","Critically evaluates the quality and relevance of evidence and reasoning, and how it contribute to an argument."],["Cannot distinguish between claims supported by evidence\/reasoning and unsupported claims.","Attempts to differentiate, but struggles to provide justification.","Differentiates between supported and unsupported claims, but misses some distinctions.","Distinguishes claims, and provides basic justification for supported\/unsupported claims.","Clearly distinguishes between supported and unsupported claims with clear explanations.","Clearly distinguishes between supported and unsupported claims and provides examples."],["Unable to follow the argument presented in the text.","Struggles to follow the argument and cannot explain connections.","Can follow the main argument but misses supporting evidence.","Can trace the argument and supporting claims but is unable to evaluate.","Clearly traces the argument and supporting claims.","Critically traces the argument and supporting claims."]]}