{"criteria":["Identification of Authors' Presentations","Comparison of Presentation","Contrast of Presentation","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify the presentations of events by both authors.","The student identifies one author's presentation but struggles with the other, or the identifications are vague and lack specific details.","The student identifies both authors' presentations, but the descriptions are basic and lack depth.","The student accurately identifies the presentations of events by both authors, providing some specific details.","The student clearly and accurately identifies the presentations of events by both authors, providing well-chosen details and demonstrating a solid understanding.","The student insightfully and comprehensively identifies the presentations of events by both authors, offering nuanced details and demonstrating a sophisticated understanding."],["The student demonstrates no understanding of how to compare the author's presentations.","The student struggles to compare the authors' presentations or only identifies superficial similarities or differences.","The student makes a basic comparison of the authors' presentations, but the analysis is limited and lacks supporting evidence.","The student compares and contrasts the authors' presentations, providing some supporting evidence from the texts.","The student effectively compares and contrasts the authors' presentations, providing relevant supporting evidence and demonstrating analytical skills.","The student skillfully compares and contrasts the authors' presentations, offering insightful analysis and compelling evidence to support their claims."],["The student demonstrates no understanding of how to contrast the author's presentations.","The student struggles to contrast the authors' presentations or only identifies superficial similarities or differences.","The student makes a basic contrast of the authors' presentations, but the analysis is limited and lacks supporting evidence.","The student contrasts the authors' presentations, providing some supporting evidence from the texts.","The student effectively contrasts the authors' presentations, providing relevant supporting evidence and demonstrating analytical skills.","The student skillfully contrasts the authors' presentations, offering insightful analysis and compelling evidence to support their claims."],["The student provides no textual evidence to support their comparison and contrast.","The student provides minimal or irrelevant textual evidence.","The student provides some textual evidence, but it is not always relevant or effectively used.","The student provides relevant textual evidence to support their comparison and contrast, but the connection could be stronger.","The student effectively uses textual evidence to support their comparison and contrast, clearly explaining the connection between the evidence and their claims.","The student skillfully integrates textual evidence to support their comparison and contrast, offering insightful explanations of the evidence's significance."]]}