{"criteria":["Accuracy of Integrated Information: How accurately does the student integrate information from different sources (visual, quantitative, textual) to represent the topic or issue?","Coherence of Understanding: How well does the integrated information contribute to a coherent understanding of the topic or issue?","Effective Use of Media\/Formats: How effectively does the student use different media or formats (visual, quantitative, textual) to enhance understanding?"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no attempt to integrate information from different sources or demonstrates a complete misunderstanding of the information.","The student attempts to integrate information from different sources, but the integration contains significant inaccuracies or misunderstandings.","The student integrates information from different sources, but there are some inaccuracies or gaps in understanding.","The student accurately integrates information from different sources, showing a general understanding of the topic or issue.","The student accurately integrates information from different sources, demonstrating a clear and comprehensive understanding of the topic or issue.","The student expertly integrates information from different sources, demonstrating a sophisticated and insightful understanding of the topic or issue, making meaningful connections between the information presented in different formats."],["The integrated information does not contribute to a coherent understanding of the topic or issue. The presentation is disjointed and confusing.","The integrated information contributes minimally to a coherent understanding. The presentation lacks clear connections and may be somewhat confusing.","The integrated information contributes somewhat to a coherent understanding, but some aspects remain unclear or disconnected.","The integrated information largely contributes to a coherent understanding of the topic or issue. The presentation is generally clear and organized.","The integrated information clearly contributes to a coherent and well-developed understanding of the topic or issue. The presentation is organized and logical.","The integrated information seamlessly contributes to a sophisticated and nuanced understanding of the topic or issue. The presentation is exceptionally clear, insightful, and logically structured, enhancing overall comprehension."],["The student does not use different media or formats effectively, or the use of media detracts from understanding.","The student attempts to use different media or formats, but the attempt is not effective, or the media is poorly chosen.","The student uses different media or formats with some effectiveness, but there is room for improvement in selection or integration.","The student effectively uses different media or formats to enhance understanding of the topic or issue.","The student skillfully uses different media or formats to significantly enhance understanding, demonstrating a thoughtful selection of resources.","The student masterfully uses different media or formats to create a rich, multi-faceted understanding of the topic or issue, demonstrating exceptional creativity and insight in their selections."]]}