{"criteria":["Identification of Author's Point of View or Purpose","Explanation of How the Point of View or Purpose is Conveyed","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify the author's point of view or purpose.","The student struggles to identify the author's point of view or purpose, offering a guess with no textual support.","The student identifies the author's point of view or purpose, but the explanation is vague and lacks clear connection to the text.","The student identifies the author's point of view or purpose and provides a somewhat clear explanation, referencing the text.","The student accurately identifies the author's point of view or purpose and clearly explains it with specific references to the text.","The student insightfully identifies the author's point of view or purpose, providing a nuanced explanation supported by compelling textual evidence."],["The student does not explain how the author conveys their point of view or purpose.","The student attempts to explain how the author conveys their point of view or purpose, but the explanation is unclear and lacks textual evidence.","The student vaguely explains how the author conveys their point of view or purpose, with minimal reference to specific textual elements.","The student explains how the author conveys their point of view or purpose, providing some relevant examples from the text.","The student clearly explains how the author conveys their point of view or purpose, using specific textual elements such as tone, language, and structure to support their analysis.","The student demonstrates a sophisticated understanding of how the author conveys their point of view or purpose, offering insightful analysis of various textual elements and their combined effect."],["The response includes no textual evidence.","The response includes irrelevant or inaccurate textual evidence.","The response includes limited textual evidence that is weakly connected to the claim.","The response includes relevant textual evidence that supports the claim.","The response includes well-chosen textual evidence that strongly supports the claim.","The response includes ample, well-analyzed textual evidence that provides insightful support for the claim."]]}