{"criteria":["Identification of Central Idea","Explanation of How Details Convey Central Idea","Summary Distinct from Personal Opinions\/Judgments"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify a central idea or presents an inaccurate idea unrelated to the text.","The student attempts to identify a central idea, but the attempt is vague, general, or partially inaccurate.","The student identifies a central idea, but it is somewhat simplistic or not fully supported by textual details.","The student identifies a central idea of the text that is generally accurate and supported by some textual details.","The student accurately identifies a central idea of the text and supports it with relevant textual details, demonstrating a good understanding.","The student skillfully identifies a nuanced and accurate central idea of the text, supporting it with well-chosen and insightful textual details, demonstrating a comprehensive understanding."],["The student does not attempt to explain how details convey the central idea, or the explanation is completely irrelevant.","The student attempts to explain how details convey the central idea, but the attempt is unclear or illogical.","The student provides a superficial explanation of how some details convey the central idea, but lacks depth or specific connections.","The student explains how particular details convey the central idea, making some connections but missing more subtle or complex relationships.","The student clearly explains how particular details effectively convey the central idea, demonstrating a solid understanding of the relationship between them.","The student insightfully and thoroughly explains how particular details intricately convey the central idea, demonstrating a sophisticated understanding of the text's construction and purpose."],["The student provides no summary or the summary is entirely based on personal opinions\/judgments.","The student attempts to provide a summary, but it is heavily influenced by personal opinions\/judgments.","The student provides a summary that includes some personal opinions\/judgments, blurring the line between objective summary and subjective response.","The student provides a generally accurate summary with minimal personal opinions\/judgments, but some subjective elements may be present.","The student provides a clear and accurate summary that is mostly distinct from personal opinions\/judgments, with a clear attempt at objectivity.","The student provides a concise, accurate, and objective summary that is completely distinct from personal opinions\/judgments, demonstrating a strong command of summarizing techniques."]]}