{"criteria":["Questioning and Answering about Key Details","Recall of Textual Details","Engagement with Text"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not ask or answer questions about the text.","Student attempts to ask or answer questions, but the responses are unrelated to the text or key details.","Student asks or answers simple questions about the text with significant prompting and support, but struggles to identify key details.","Student asks and answers questions about the text with some prompting and support, identifying some key details but missing others.","Student asks and answers relevant questions about the text with minimal prompting, accurately identifying most key details.","Student independently asks and answers insightful questions about key details in the text, demonstrating a thorough understanding."],["Student does not demonstrate any understanding of the text even with support.","With extensive prompting, the student shows a vague recognition of the text's subject, but cannot specify any details.","The student recalls one or two details from the text with considerable assistance.","The student recalls some details from the text with moderate assistance, enough to answer basic questions.","The student recalls several details from the text with minimal assistance and answers questions accurately.","The student easily recalls key details from the text and answers questions accurately and thoroughly, demonstrating a strong grasp of the material."],["Student is unable to engage with the text even when provided with significant assistance.","The student shows minimal engagement, requiring constant encouragement to participate.","The student occasionally engages with the text when directly prompted, but struggles to maintain focus.","The student engages with the text with some prompting and support, demonstrating a willingness to participate.","The student is actively engaged with the text, requiring minimal prompting and demonstrating a genuine interest.","The student is highly engaged with the text, initiating discussions and asking thoughtful questions independently."]]}