{"criteria":["Identification of Author's Reasons","Use of Textual Evidence","Understanding of Author's Purpose"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to identify any reasons the author provides.","The student attempts to identify reasons but demonstrates significant misunderstanding or provides irrelevant information.","The student identifies a reason, but it is vague, unsupported by textual evidence, or demonstrates a limited understanding of the author's purpose.","The student identifies a reason the author gives to support a point in the text, but the explanation is superficial or partially accurate.","The student clearly identifies a reason the author gives to support a point in the text and provides a relevant explanation of how the reason supports the author's point.","The student thoroughly and accurately identifies a reason the author gives to support a point in the text, providing insightful analysis of how the reason effectively supports the author's point, demonstrating strong comprehension."],["The student provides no textual evidence or attempts to provide evidence that is completely unrelated to the identified reason.","The student attempts to provide textual evidence, but it is inaccurate, irrelevant, or missing.","The student provides a piece of textual evidence that is weakly related to the identified reason or is presented without context.","The student provides relevant textual evidence to support the identified reason, but the connection is not clearly explained or is somewhat superficial.","The student provides well-chosen textual evidence that clearly supports the identified reason and explains the connection effectively.","The student provides compelling and specific textual evidence that strongly supports the identified reason, offering insightful analysis of how the evidence bolsters the author's argument."],["The student does not demonstrate any understanding of how the author's reasons contribute to the overall argument or purpose of the text.","The student's understanding of the author's purpose is unclear, and the explanation is confusing or inaccurate.","The student demonstrates a basic or superficial understanding of how the author's reasons relate to the overall purpose of the text.","The student explains how the author's reasons contribute to the overall argument or purpose of the text, but the explanation lacks depth or insight.","The student demonstrates a clear understanding of how the author's reasons effectively support the overall argument or purpose of the text.","The student provides a sophisticated and nuanced analysis of how the author's reasons contribute to the overall argument or purpose of the text, demonstrating a comprehensive understanding of the text's rhetorical strategies."]]}