{"criteria":["Connection Identification and Explanation","Understanding of Text and Connection"],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to identify any connections between individuals, events, ideas, or pieces of information within the text, even with significant prompting.","The student attempts to identify a connection but is unsuccessful, providing irrelevant or inaccurate information.","With considerable prompting, the student identifies a vague or superficial connection between elements in the text. The explanation is unclear or incomplete.","With some prompting and support, the student identifies a connection between individuals, events, ideas, or pieces of information. The explanation is partially developed and may contain minor inaccuracies.","The student identifies a clear connection between two elements in the text and provides a mostly accurate explanation of their relationship. Minor details may be missing or unclear.","The student effectively describes a clear and insightful connection between two individuals, events, ideas, or pieces of information in the text. The explanation is thorough, accurate, and demonstrates a solid understanding of the material."],["The student's response demonstrates no understanding of the text or the concept of connections between its elements.","The student shows a minimal understanding of the text, with no clear grasp of the connections between elements.","The student's understanding of the text is limited, and their attempt to explain connections is confusing or based on misinterpretations.","The student demonstrates a basic understanding of the text and can identify a connection with some prompting, but their explanation lacks depth.","The student shows a good understanding of the text and the connection, providing a clear explanation with supporting details.","The student demonstrates a comprehensive understanding of the text and the connection, providing a nuanced and insightful explanation with strong supporting evidence."]]}