{
  "criteria": [
    "Analysis of Setting's Impact",
    "Evaluation of Action Ordering",
    "Assessment of Character\/Archetype Development"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student does not identify the setting or its impact is not discussed.",
      "The student identifies the setting, but the analysis of its impact on the story or drama is minimal or superficial.",
      "The student identifies the setting and provides a basic analysis of its impact, but lacks depth or specific examples.",
      "The student analyzes how the setting influences mood, character, or plot, providing relevant examples from the text.",
      "The student insightfully analyzes how the setting contributes to the story's themes, conflicts, or character development, using well-chosen examples.",
      "The student offers a comprehensive and nuanced analysis of the setting's multifaceted impact, demonstrating a sophisticated understanding of its role in shaping the narrative and its themes."
    ],
    [
      "The student does not address the order of actions or events in the story or drama.",
      "The student mentions the sequence of events but does not analyze its effect.",
      "The student identifies the order of actions and offers a simple explanation of its impact, but lacks detailed support.",
      "The student analyzes how the order of events affects suspense, pacing, or character understanding, providing specific examples.",
      "The student insightfully evaluates how the manipulation of time (e.g., flashbacks, foreshadowing) enhances thematic elements or character arcs.",
      "The student offers a compelling and original analysis of the action's arrangement, demonstrating a deep understanding of narrative structure and its effects on the audience or reader."
    ],
    [
      "The student fails to identify characters or archetypes, or their development is not discussed.",
      "The student identifies characters but does not analyze how they are introduced or developed.",
      "The student describes character introductions and development but provides a superficial analysis.",
      "The student analyzes how specific choices in character introduction or development affect the plot or themes.",
      "The student insightfully evaluates how characters\/archetypes embody or challenge thematic ideas, with detailed textual evidence.",
      "The student offers a nuanced and insightful critique of character development, exploring its complexities and its impact on the work as a whole."
    ]
  ]
}