{"criteria":["Identification of Narrator and Point of View","Analysis of Shifts in Point of View","Understanding the Impact of Perspective"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of point of view or the narrator's role in the text.","The student struggles to identify the narrator and point of view, providing inaccurate or irrelevant information.","The student can identify the narrator with prompting but struggles to explain how the narrator's perspective influences the story.","The student can accurately identify the narrator and point of view in a straightforward text but may struggle with more complex narratives or shifts in perspective.","The student can identify the narrator and point of view in various texts, explaining how the narrator's perspective shapes the story and influences the reader's understanding.","The student demonstrates a sophisticated understanding of point of view, analyzing how the narrator's perspective impacts the narrative, influences the reader, and contributes to the overall meaning of the text, even in complex or subtle narratives."],["The student is unable to identify any instances where the point of view shifts within the text.","The student attempts to identify shifts in point of view but is often incorrect or unable to provide supporting evidence.","The student can identify obvious shifts in point of view with guidance but struggles to explain the purpose or effect of these shifts.","The student can identify most shifts in point of view within the text and provide a basic explanation of their impact on the narrative.","The student accurately identifies shifts in point of view and analyzes their impact on the plot, character development, and overall theme of the text.","The student demonstrates a nuanced understanding of how shifts in point of view contribute to the complexity and richness of the text, offering insightful analysis of their artistic and thematic significance."],["The student does not recognize any connections between the narrator's perspective and the events or characters in the story.","The student attempts to connect the narrator's perspective to the story but struggles to provide relevant or accurate examples.","The student can identify simple connections between the narrator's perspective and specific events or characters in the story but lacks depth in analysis.","The student effectively connects the narrator's perspective to key events and characters, explaining how this perspective shapes the reader's understanding of the story.","The student demonstrates a strong understanding of how the narrator's perspective influences the interpretation of events, motivations of characters, and overall themes of the text.","The student offers a comprehensive and insightful analysis of how the narrator's perspective intricately shapes the entire narrative, providing a deep understanding of the text's meaning and impact."]]}