{"criteria":["Identification and Explanation of Sensory Language","Analysis of Effects","Understanding of Emotional Impact"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any words or phrases that suggest feelings or appeal to the senses.","The student identifies very few words or phrases that suggest feelings or appeal to the senses, and the selections are largely inaccurate or irrelevant.","The student identifies some words or phrases that suggest feelings or appeal to the senses, but the selections are limited and\/or not fully explained.","The student identifies several words and phrases that suggest feelings or appeal to the senses, with some explanation of their impact.","The student effectively identifies multiple words and phrases that suggest feelings or appeal to the senses, providing clear explanations of their impact on the reader.","The student skillfully identifies a wide range of words and phrases that suggest feelings or appeal to the senses, offering insightful and nuanced explanations of their effects and contributing to a deeper understanding of the text."],["The student provides no analysis of how the identified words\/phrases create specific effects.","The student attempts to analyze the effects of the words\/phrases but demonstrates a minimal understanding of their impact.","The student offers a basic analysis of how the words\/phrases create certain effects, but lacks depth and insight.","The student analyzes how the identified words\/phrases contribute to the mood and tone of the story or poem.","The student provides a comprehensive analysis of how the identified words\/phrases contribute to the overall tone, mood, and meaning of the story or poem, demonstrating strong comprehension.","The student provides an incisive and sophisticated analysis of how the identified words\/phrases contribute to the overall tone, mood, and meaning of the story or poem, offering original insights and interpretations."],["The student demonstrates no understanding of the connection between sensory language and the emotional impact of the text.","The student shows a limited ability to connect sensory language to the emotional impact of the text.","The student makes some connections between sensory language and the emotional impact of the text, but the connections are superficial.","The student effectively connects sensory language to the emotional impact of the text, demonstrating a solid understanding of how these elements work together.","The student demonstrates a deep understanding of the intricate relationship between sensory language and the emotional impact of the text.","The student demonstrates an exceptional ability to articulate the nuanced connections between sensory language and the emotional impact of the text, offering insightful and original observations."]]}