{
  "criteria": [
    "Identification of Figurative and Connotative Meanings",
    "Analysis of Impact of Word Choices on Meaning and Tone",
    "Understanding of Words with Multiple Meanings and Fresh Language"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify any figurative or connotative meanings in the text.",
      "Student identifies few figurative or connotative meanings, but explanations are superficial or incorrect.",
      "Student identifies some figurative and connotative meanings but struggles to explain their significance.",
      "Student identifies most figurative and connotative meanings and provides adequate explanations.",
      "Student accurately identifies and explains most figurative and connotative meanings with insightful analysis.",
      "Student expertly identifies and explains figurative and connotative meanings, demonstrating a deep understanding of their impact."
    ],
    [
      "Student provides no analysis of how word choices affect meaning and tone.",
      "Student attempts to analyze word choices but offers vague or unsubstantiated claims.",
      "Student identifies some connections between word choices and meaning\/tone but analysis is limited.",
      "Student provides a reasonable analysis of how specific word choices influence the text's meaning and tone.",
      "Student offers a detailed and well-supported analysis of the impact of word choices on meaning and tone, including multiple examples.",
      "Student demonstrates a sophisticated understanding of how word choices shape meaning and tone, with nuanced and insightful analysis."
    ],
    [
      "Student shows no understanding of words with multiple meanings or the impact of fresh\/engaging language.",
      "Student demonstrates minimal awareness of words with multiple meanings or fresh language.",
      "Student recognizes words with multiple meanings and fresh language but struggles to analyze their effects.",
      "Student analyzes the impact of words with multiple meanings and fresh language with some success.",
      "Student effectively analyzes the impact of words with multiple meanings and fresh language, providing clear examples.",
      "Student demonstrates a nuanced understanding of the effects of words with multiple meanings and fresh language, offering insightful commentary."
    ]
  ]
}