{"criteria":["Comparison of Adventures\/Experiences","Development of Adventures\/Experiences","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to compare or contrast the characters' adventures or experiences.","The student identifies characters' adventures or experiences in one story, but does not attempt any comparison.","The student superficially compares or contrasts characters' adventures or experiences with major inaccuracies.","The student identifies some similarities and differences between characters' adventures or experiences, but the analysis is incomplete or contains minor inaccuracies.","The student effectively compares and contrasts characters' adventures and experiences, providing relevant details and demonstrating a clear understanding of the text, but may miss nuances.","The student insightfully compares and contrasts characters' adventures and experiences, providing detailed textual evidence and demonstrating a comprehensive understanding, including nuances."],["The student shows no understanding of how the characters' adventures or experiences are developed in the stories.","The student attempts to describe how the characters' adventures or experiences are developed, but is unsuccessful.","The student vaguely describes how the characters' adventures or experiences are developed, with little or no supporting evidence.","The student adequately describes how the characters' adventures or experiences are developed, providing some supporting evidence.","The student clearly describes how the characters' adventures or experiences are developed, providing relevant and specific supporting evidence.","The student insightfully describes how the characters' adventures or experiences are developed, providing compelling and detailed textual evidence, and demonstrating a deep understanding of the author's choices."],["The student fails to provide any textual evidence to support their comparisons.","The student attempts to provide textual evidence, but it is irrelevant or inaccurate.","The student provides limited textual evidence, but it is not well-integrated or explained.","The student provides adequate textual evidence to support their comparisons and contrasts.","The student provides strong and relevant textual evidence to support their comparisons and contrasts, with clear explanations.","The student provides compelling and insightful textual evidence to support their comparisons and contrasts, demonstrating a sophisticated understanding of the text."]]}