{"criteria":["Understanding of Differences","Range of Text Types","Clarity of Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the differences between narrative and informational texts.","Student demonstrates a minimal understanding of the differences, but cannot articulate them clearly.","Student identifies a few differences between narrative and informational texts with limited examples.","Student explains some differences between narrative and informational texts, providing basic examples from texts.","Student clearly explains major differences between narrative and informational texts, drawing on examples from a range of texts.","Student expertly explains major differences between narrative and informational texts, drawing on a wide reading of diverse text types and offering insightful analysis."],["Student provides no examples of different text types.","Student provides only one example of either a narrative or informational text.","Student provides a couple of examples of narrative and informational texts, but struggles to differentiate them.","Student provides examples of narrative and informational texts and identifies some of their characteristics.","Student provides a variety of examples of narrative and informational texts, clearly differentiating their characteristics.","Student provides a wide range of examples of narrative and informational texts, expertly differentiating their characteristics and purposes."],["Student's explanation is unclear and disorganized.","Student's explanation is difficult to follow and lacks coherence.","Student's explanation is somewhat organized but lacks clarity in some areas.","Student's explanation is generally clear and organized with minor lapses in coherence.","Student's explanation is clear, well-organized, and coherent throughout.","Student's explanation is exceptionally clear, insightful, and coherently structured, demonstrating a deep understanding of the concepts."]]}