{"criteria":["Understanding the Purpose and Perspective of Informational Texts","Analyzing Argumentation and Reasoning","Evaluating the Credibility and Accuracy of Sources"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the author's purpose or perspective. Unable to identify any specific elements that support a particular viewpoint.","Shows a limited understanding of the author's purpose or perspective. Struggles to identify relevant elements or provides inaccurate interpretations.","Identifies the author's purpose or perspective with some inaccuracies. Mentions a few relevant elements but lacks depth in analysis.","Demonstrates a clear understanding of the author's purpose and perspective. Identifies several relevant elements and provides a basic analysis.","Exhibits a strong understanding of the author's purpose and perspective. Provides a thorough analysis of relevant elements and their impact on the text.","Demonstrates a sophisticated understanding of the author's purpose and perspective. Offers insightful analysis, connecting the author's viewpoint to broader contexts and implications."],["Unable to identify any arguments or reasoning used by the author. Shows no understanding of how the author attempts to persuade the reader.","Struggles to identify arguments or reasoning. Provides vague or inaccurate interpretations of the author's persuasive techniques.","Identifies a few arguments or reasoning strategies with some inaccuracies. Offers a superficial analysis of their effectiveness.","Demonstrates a clear understanding of the arguments and reasoning employed by the author. Provides a basic analysis of their effectiveness.","Exhibits a strong understanding of the argumentation and reasoning. Offers a detailed analysis of their effectiveness and potential weaknesses.","Demonstrates a sophisticated understanding of the argumentation and reasoning. Provides insightful analysis, considering the rhetorical context and potential biases."],["Shows no awareness of the need to evaluate the credibility or accuracy of sources. Accepts information at face value without questioning its validity.","Demonstrates a limited understanding of source evaluation. Struggles to identify relevant criteria for assessing credibility and accuracy.","Identifies a few criteria for evaluating sources with some inaccuracies. Offers a superficial assessment of the credibility and accuracy of the information.","Demonstrates a clear understanding of the criteria for evaluating sources. Provides a basic assessment of the credibility and accuracy of the information.","Exhibits a strong understanding of source evaluation. Offers a detailed assessment, considering multiple factors and potential biases.","Demonstrates a sophisticated understanding of source evaluation. Provides insightful analysis, considering the historical and cultural context of the sources."]]}