{"criteria":["Identification of Stories","Comparison of Story Elements","Contrast of Story Elements","Analysis of Authorial\/Cultural Influence","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify any versions of the story.","Identifies only one version of the story.","Identifies two versions of the story but struggles with titles or authors.","Accurately identifies two versions of the story by title and author\/culture.","Accurately identifies two or more versions of the story and provides basic context.","Accurately identifies multiple versions of the story with comprehensive contextual information."],["Provides no comparison of story elements.","Attempts to compare but the comparison is vague or inaccurate.","Compares one or two story elements (e.g., characters, setting) superficially.","Compares several story elements with some detail and accuracy.","Provides a detailed comparison of multiple story elements, noting similarities and differences.","Offers insightful and nuanced comparisons of various story elements, demonstrating a deep understanding of the texts."],["Provides no contrast of story elements.","Attempts to contrast but the contrast is vague or inaccurate.","Contrasts one or two story elements (e.g., characters, setting) superficially.","Contrasts several story elements with some detail and accuracy.","Provides a detailed contrast of multiple story elements, noting key differences.","Offers insightful and nuanced contrasts of various story elements, analyzing the impact of these differences."],["Shows no awareness of authorial or cultural influence.","Mentions authorial or cultural influence without providing specific examples.","Identifies a potential authorial or cultural influence but does not explain it well.","Connects specific differences in the stories to potential authorial or cultural perspectives.","Analyzes how authorial or cultural context shapes the story and its message.","Provides a sophisticated analysis of how authorial or cultural perspectives significantly impact the narrative and themes of each version."],["Response is unclear, disorganized, and difficult to understand.","Response lacks clarity and organization; key points are difficult to follow.","Response is somewhat clear but lacks a logical structure.","Response is generally clear and organized with a discernible structure.","Response is clear, well-organized, and easy to follow with logical transitions.","Response is exceptionally clear, coherent, and logically organized, enhancing the overall effectiveness of the analysis."]]}