{"criteria":["Ability to ask and answer questions about key details (who, what, where, when)","Demonstrates understanding of key details in a text"],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to ask or answer questions about the text or provides irrelevant responses.","Student attempts to ask or answer questions but demonstrates minimal understanding of the text's key details. Responses are vague or incomplete.","Student asks and answers basic 'who,' 'what,' or 'where' questions with some accuracy, but struggles with 'when,' 'why,' or 'how' questions. Understanding of key details is superficial.","Student asks and answers 'who,' 'what,' 'where,' and 'when' questions accurately, demonstrating a moderate understanding of key details. 'Why' and 'how' questions are attempted but may lack depth.","Student proficiently asks and answers 'who,' 'what,' 'where,' 'when,' 'why,' and 'how' questions, showing a strong understanding of the text's key details. Responses are clear and mostly insightful.","Student skillfully asks and answers a comprehensive range of questions ('who,' 'what,' 'where,' 'when,' 'why,' and 'how'), demonstrating a deep and nuanced understanding of the text's key details. Responses are insightful, well-supported, and show critical thinking."],["Student demonstrates no understanding of the text's key details.","Student demonstrates a minimal understanding of the text's key details, with significant inaccuracies or omissions.","Student demonstrates a partial understanding of the text's key details, but struggles to connect them or explain their significance.","Student demonstrates a satisfactory understanding of the text's key details, accurately identifying and explaining most important points.","Student demonstrates a strong understanding of the text's key details, providing clear and insightful explanations with supporting evidence.","Student demonstrates a comprehensive and nuanced understanding of the text's key details, synthesizing information and drawing insightful conclusions."]]}