{"criteria":["Character Response to Events","Use of Textual Evidence","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of how characters respond to major events and challenges in the story.","The student struggles to identify characters and major events or challenges.","The student identifies characters and major events but provides a superficial description of their responses.","The student describes how characters respond to major events and challenges, but the explanation lacks depth or specific examples.","The student clearly describes how characters respond to major events and challenges, providing relevant examples from the text.","The student insightfully analyzes how characters respond to major events and challenges, demonstrating a deep understanding of their motivations and the impact of their responses on the story. Student supports answers with multiple, varied examples."],["The student provides no evidence or examples from the text to support their claims.","The student attempts to provide evidence, but it is irrelevant or inaccurate.","The student provides limited evidence from the text, but it is not always clearly connected to their explanations.","The student provides relevant evidence from the text to support their explanations of character responses.","The student effectively uses evidence from the text to support their analysis of character responses, explaining the connection between the evidence and their claims.","The student skillfully integrates evidence from the text to develop a nuanced and insightful analysis of character responses, demonstrating a comprehensive understanding of the material."],["The student's response is unclear, disorganized, and difficult to understand.","The student's response lacks organization and clarity, making it difficult to follow their reasoning.","The student's response is somewhat organized, but there are areas where clarity could be improved.","The student's response is generally clear and organized, with a logical flow of ideas.","The student's response is well-organized and clearly articulated, making it easy to understand their analysis.","The student's response is exceptionally clear, concise, and well-organized, demonstrating sophisticated communication skills."]]}