{"criteria":["Understanding of the roles of a story's beginning and ending.","Ability to identify and explain structural elements.","Use of story details to support explanations."],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of story structure or the roles of the beginning and ending.","The student shows minimal understanding of story structure and struggles to identify the beginning and ending.","The student identifies the beginning and ending of a story but does not accurately describe their functions.","The student generally describes the function of a story's beginning (introduction) and ending (conclusion) but with some inaccuracies or omissions.","The student accurately describes the role of the beginning in introducing the story and the ending in concluding the action, providing relevant examples.","The student thoroughly and insightfully describes the roles of the beginning and ending in shaping the story's overall structure, offering detailed examples and demonstrating a strong understanding of narrative techniques."],["The student is unable to identify any structural elements within the story.","The student vaguely identifies one or two structural elements with no clear explanation.","The student identifies a few structural elements but struggles to explain how they contribute to the overall story.","The student identifies and describes several structural elements, explaining their basic contributions to the story.","The student clearly identifies and explains multiple structural elements, analyzing how they contribute to the story's development and meaning.","The student comprehensively analyzes the story's structural elements, demonstrating a sophisticated understanding of their interrelation and impact on the narrative's effectiveness."],["The student's response lacks any relevant details from the story.","The student mentions the story but provides no specific details to support their statements.","The student includes a few details, but they are superficial and do not significantly support their explanation.","The student provides relevant details from the story to support their explanation of the structure.","The student effectively uses specific and relevant details from the story to illustrate their understanding of the structural elements and their functions.","The student masterfully integrates detailed and insightful examples from the story to provide a compelling and nuanced analysis of the narrative structure."]]}