{"criteria":["Differentiation of Character Viewpoints and Voices","Comprehension of Text and Context","Expressiveness and Engagement"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not attempt to differentiate between character viewpoints or voices.","The student shows minimal awareness of differing character viewpoints and makes little to no attempt to vary their voice when reading dialogue.","The student identifies that characters may have different points of view but struggles to articulate or demonstrate these differences through vocal expression.","The student acknowledges differing viewpoints of characters and makes some attempts to vary their voice, but the differentiation is subtle or inconsistent.","The student effectively recognizes and articulates the differing viewpoints of characters and consistently varies their voice to reflect these differences while reading dialogue.","The student expertly embodies different characters' viewpoints through distinct vocal choices, demonstrating a nuanced understanding of each character's perspective and enhancing the dramatic impact of the dialogue."],["The student does not demonstrate comprehension of the text.","The student shows limited understanding of the context and meaning of the dialogue.","The student comprehends the basic context of the dialogue but misses nuances in character motivations or relationships.","The student demonstrates a solid understanding of the dialogue's context, character motivations, and relationships.","The student exhibits a strong comprehension of the text, including subtle cues about character viewpoints.","The student displays an exceptional grasp of the text, revealing a deep understanding of character viewpoints and enhancing the overall interpretation through their vocal choices."],["The student's reading lacks expression and engagement.","The student's reading is monotone with little attempt to engage the audience.","The student shows some expression in their reading, but it does not consistently align with the character's viewpoints.","The student reads with appropriate expression that generally reflects the character's viewpoints.","The student's expressive reading enhances the audience's understanding of the characters' differing viewpoints.","The student's expressive reading is captivating, fully immersing the audience in the dialogue and showcasing a sophisticated understanding of each character's perspective."]]}