{"criteria":["Recounting the story accurately","Identifying the central message, lesson, or moral","Explaining how key details convey the message"],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to recount the story or recounts it with significant inaccuracies.","The student recounts the story with some inaccuracies and omissions.","The student recounts the story with minor inaccuracies or omissions.","The student accurately recounts the main events of the story.","The student accurately recounts the story with good detail.","The student accurately and comprehensively recounts the story, demonstrating a strong understanding of the plot and characters."],["The student is unable to identify the central message, lesson, or moral of the story.","The student attempts to identify the central message, lesson, or moral but is incorrect or unclear.","The student identifies a possible central message, lesson, or moral, but it is not well-supported by the text.","The student identifies the central message, lesson, or moral of the story.","The student clearly identifies the central message, lesson, or moral of the story and provides some supporting details.","The student clearly and insightfully identifies the central message, lesson, or moral of the story and provides strong supporting details from the text."],["The student is unable to explain how key details in the text convey the central message, lesson, or moral.","The student attempts to explain how key details convey the message but is unclear or incorrect.","The student identifies some key details but does not clearly explain how they convey the message.","The student explains how some key details in the text convey the central message, lesson, or moral.","The student effectively explains how several key details in the text convey the central message, lesson, or moral.","The student thoroughly and insightfully explains how key details in the text work together to convey the central message, lesson, or moral, demonstrating a deep understanding of the text."]]}