{"criteria":["Understanding of Literal Language","Interpretation of Nonliteral Language","Distinguishing Literal from Nonliteral"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of literal language in the text.","The student shows minimal understanding of literal language, with significant misinterpretations.","The student demonstrates a basic understanding of literal language but struggles with nuanced details.","The student generally understands literal language but may miss subtle implications.","The student demonstrates a strong understanding of literal language, accurately interpreting most details.","The student demonstrates a comprehensive and nuanced understanding of literal language in the text."],["The student does not recognize or attempt to interpret nonliteral language.","The student identifies nonliteral language but offers inaccurate or irrelevant interpretations.","The student attempts to interpret nonliteral language with limited success, showing confusion or misinterpretation.","The student demonstrates a fair understanding of nonliteral language, but may struggle with more complex examples.","The student successfully interprets most instances of nonliteral language, providing reasonable explanations.","The student demonstrates a sophisticated understanding of nonliteral language, offering insightful and well-supported interpretations."],["The student makes no distinction between literal and nonliteral language.","The student struggles to differentiate between literal and nonliteral language, often confusing the two.","The student can sometimes identify the difference between literal and nonliteral language, but not consistently.","The student generally distinguishes between literal and nonliteral language, but may make occasional errors.","The student consistently distinguishes between literal and nonliteral language, providing accurate examples.","The student expertly distinguishes between literal and nonliteral language, explaining the nuances and impact of each."]]}