{"criteria":["Accuracy of Answers: How accurately and thoroughly the student answers questions about the text.","Textual Evidence: How effectively the student refers to the text to support their answers.","Questioning Skills: How effectively the student asks questions to deepen understanding of the text."],"points":[0,1,2,3,4,5],"descriptions":[["Provides no answers or answers are completely irrelevant to the text.","Answers are vague, incomplete, or demonstrate a lack of understanding of the text. Minimal reference to the text.","Answers are partially accurate but may miss key details or demonstrate some misunderstanding. Limited reference to the text.","Answers are generally accurate and demonstrate a basic understanding of the text. Some direct references to the text are included.","Answers are accurate, well-supported, and demonstrate a strong understanding of the text. Clear and relevant references to the text.","Answers are insightful, comprehensive, and demonstrate a deep understanding of the text. Explicit and effective use of textual evidence to support answers."],["No attempt to refer to the text.","Attempts to refer to the text are unclear, inaccurate, or irrelevant.","Refers to the text but the connection to the answer is weak or not clearly explained.","Provides some textual evidence to support answers, but explanation or connection could be stronger.","Provides relevant and clear textual evidence to support answers, with a reasonable explanation.","Skillfully integrates textual evidence to support answers, providing insightful explanations of the evidence's significance."],["Asks no questions or questions are completely irrelevant to the text.","Questions are superficial and do not contribute to understanding the text.","Questions are somewhat relevant but do not significantly deepen understanding.","Questions are relevant and show an attempt to clarify or expand understanding of the text.","Questions are thoughtful and insightful, leading to a deeper understanding of the text.","Questions are probing and demonstrate a sophisticated understanding of the text, opening new avenues for interpretation."]]}