{"criteria":["Identification of Perspectives","Analysis of Differences","Supporting Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student cannot identify any point of view present in the text.","The student vaguely identifies points of view but struggles to differentiate between them.","The student identifies the narrator's point of view, but struggles to differentiate their view from the character's.","The student identifies and differentiates the narrator's point of view from one of the characters, but not all characters.","The student identifies and differentiates between their own, the narrator's, and the characters' points of view, with minor inaccuracies.","The student clearly and accurately distinguishes their own point of view from that of the narrator and all of the characters, providing insightful analysis."],["The student does not attempt to analyze the differences between points of view.","The student superficially acknowledges differences without providing supporting details.","The student identifies some differences but fails to fully explain the nuances.","The student explains the differences between points of view with some supporting details from the text.","The student analyzes the differences between points of view with clear, specific examples and reasoning.","The student provides a comprehensive analysis of the differences between points of view, demonstrating a nuanced understanding with well-supported evidence and insightful commentary."],["The student provides no evidence from the text.","The student provides irrelevant or inaccurate evidence.","The student provides limited evidence that weakly supports their distinctions.","The student provides relevant evidence to support their distinctions, but the connection is not always clear.","The student effectively uses evidence from the text to support their distinctions between points of view.","The student skillfully integrates textual evidence to offer a compelling and thoroughly supported analysis of different points of view."]]}