{"criteria":["Identification of Specific Illustrations","Explanation of Contribution to Meaning","Connection to Mood, Character, or Setting"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any specific illustrations from the text.","The student identifies one or more illustrations but without accuracy or relevance.","The student identifies one or more illustrations and are somewhat relevant, but does not fully explain them.","The student identifies one or more relevant illustrations from the text and provides basic descriptions.","The student identifies multiple relevant illustrations and describes them with reasonable detail.","The student identifies multiple relevant illustrations and describes them comprehensively, demonstrating a clear understanding of their visual elements."],["The student does not attempt to explain how the illustrations contribute to the text's meaning.","The student attempts to explain the contribution but explanation does not make sense or is completely inaccurate.","The student offers a superficial or generic explanation of how the illustrations might relate to the text.","The student explains how the illustrations contribute to the text's meaning (mood, character or setting), but explanations are not always convincing.","The student clearly explains how specific aspects of the illustrations contribute to the text's meaning, providing some evidence and examples.","The student insightfully explains how specific aspects of the illustrations contribute to the text's meaning, providing strong evidence and examples and demonstrating perceptive analysis."],["The student does not connect the illustrations to the mood, character, or setting of the story.","The student makes a vague or illogical connection between the illustrations and the mood, character, or setting of the story.","The student's connections between the illustrations and the mood, character, or setting are superficial and lack depth.","The student adequately connects the illustrations to the mood, character, or setting, though the reasoning may be simplistic.","The student effectively connects the illustrations to the mood, character, or setting, providing clear examples and reasons for their connections.","The student masterfully connects the illustrations to the mood, character, or setting, offering nuanced insights and demonstrating a sophisticated understanding of their interrelation."]]}