{"criteria":["Comparison of Themes","Comparison of Settings","Comparison of Plots","Analysis of Character Similarities\/Differences"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify or compare the themes in the stories.","The student identifies themes but does not attempt to compare them.","The student makes a weak attempt to compare themes, with limited detail.","The student adequately compares the themes but lacks depth in analysis.","The student thoroughly compares the themes, providing insightful analysis.","The student expertly compares and contrasts the themes, offering original insights and comprehensive understanding."],["The student fails to identify or compare the settings in the stories.","The student identifies settings but does not attempt to compare them.","The student makes a weak attempt to compare settings, with limited detail.","The student adequately compares the settings but lacks depth in analysis.","The student thoroughly compares the settings, providing insightful analysis.","The student expertly compares and contrasts the settings, offering original insights and comprehensive understanding."],["The student fails to identify or compare the plots in the stories.","The student identifies plots but does not attempt to compare them.","The student makes a weak attempt to compare plots, with limited detail.","The student adequately compares the plots but lacks depth in analysis.","The student thoroughly compares the plots, providing insightful analysis.","The student expertly compares and contrasts the plots, offering original insights and comprehensive understanding."],["The student does not identify similarities or differences in characters.","The student identifies characters but makes no attempt to compare them.","The student offers a superficial comparison of characters.","The student compares the characters with adequate supporting details.","The student provides a well-supported and insightful comparison of characters.","The student provides an exceptionally detailed and perceptive comparison of characters, demonstrating a deep understanding of their roles and development."]]}