{"criteria":["Reading Comprehension and Understanding","Independent Reading Ability","Proficiency in Literary Elements"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; unable to answer basic comprehension questions.","Struggles to understand the text; can answer very basic comprehension questions with significant prompting.","Demonstrates limited understanding of the text; can answer some basic comprehension questions with prompting.","Demonstrates a general understanding of the text; can answer basic comprehension questions and identify the main idea with some accuracy.","Demonstrates a good understanding of the text; can answer comprehension questions accurately and identify the main idea effectively.","Demonstrates a comprehensive understanding of the text; can answer complex comprehension questions, identify the main idea, and infer the author's purpose."],["Unable to read the text independently; requires constant assistance.","Can attempt to read the text independently but struggles with most words and sentences; requires frequent assistance.","Can read some of the text independently but still struggles with unfamiliar words and complex sentences; requires some assistance.","Can read the text independently with occasional difficulty; able to decode unfamiliar words and understand most sentences.","Reads the text independently with good fluency and accuracy; demonstrates strong decoding skills and comprehension.","Reads the text independently with excellent fluency, accuracy, and expression; demonstrates mastery of decoding skills and comprehension."],["Demonstrates no understanding of literary elements (e.g., plot, character, setting).","Struggles to identify and understand basic literary elements with significant prompting.","Can identify some basic literary elements with prompting but struggles to explain their significance.","Can identify and explain basic literary elements with some accuracy.","Demonstrates a good understanding of literary elements and can explain their significance in the text.","Demonstrates a deep understanding of literary elements and can analyze their impact on the text as a whole."]]}