{"criteria":["Identifying Explicit Details","Drawing Inferences","Use of Examples","Clarity and Precision"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify any explicit details from the text.","Identifies minimal explicit details, but struggles to connect them to the text's meaning.","Identifies some explicit details, but explanation lacks depth and accuracy.","Identifies several explicit details and provides a basic explanation of their relevance to the text.","Identifies key explicit details and clearly explains their significance to the text's meaning.","Masterfully identifies and explains the significance of explicit details, demonstrating a comprehensive understanding of the text."],["Unable to draw any inferences from the text.","Attempts to draw inferences, but they are illogical or unsupported by the text.","Draws simple inferences with some support from the text, but explanations are superficial.","Draws reasonable inferences and provides a basic explanation of how they are supported by the text.","Draws insightful inferences and clearly explains how the text supports those inferences.","Consistently draws well-supported, insightful inferences that demonstrate a deep understanding of the text's underlying meaning and implications."],["Provides no examples from the text to support claims.","Attempts to provide examples, but they are irrelevant or inaccurately cited.","Provides some examples, but they are weakly connected to the claims being made.","Provides relevant examples from the text to support claims, but explanation of their relevance is limited.","Provides well-chosen examples from the text and clearly explains how they support the claims being made.","Selects compelling examples from the text and provides nuanced explanations of how they contribute to a comprehensive understanding of the text."],["Explanation is unclear, disorganized, and difficult to understand.","Explanation is vague and lacks precision; difficult to follow the reasoning.","Explanation is somewhat clear, but lacks detail and precision in language.","Explanation is generally clear and organized, with mostly precise language.","Explanation is clear, well-organized, and uses precise language to convey meaning effectively.","Explanation is exceptionally clear, concise, and insightful, demonstrating a mastery of language and analytical skills."]]}