{"criteria":["Identification of Themes and Topics","Comparison of Theme Treatment","Analysis of Patterns of Events","Cultural Context"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any themes or topics present in the texts.","The student identifies themes or topics but struggles to provide accurate or relevant examples from the texts.","The student identifies a few themes or topics but the explanation lacks depth and clarity.","The student identifies themes and topics with reasonable accuracy and provides some supporting details.","The student clearly identifies key themes and topics in both texts, providing relevant supporting details.","The student expertly identifies and explains significant themes and topics, demonstrating a comprehensive understanding of their presence in the texts."],["The student does not attempt to compare how the themes are treated in different cultures.","The student attempts to compare theme treatment but the comparison is vague and unsupported.","The student makes a basic comparison of theme treatment but lacks depth and specific examples.","The student compares how the themes are treated, providing some details, but the analysis could be more thorough.","The student effectively compares the treatment of themes in both texts, using relevant details to support their analysis.","The student skillfully compares and contrasts the nuances in theme treatment, providing insightful analysis and strong textual evidence."],["The student does not identify any patterns of events (e.g., the quest).","The student identifies patterns of events with limited accuracy or relevance.","The student identifies some patterns of events, but the explanation lacks specific evidence.","The student provides a reasonable analysis of patterns of events, connecting them to the texts.","The student thoroughly analyzes patterns of events, demonstrating how they are used in both texts.","The student offers a sophisticated analysis of patterns of events, revealing how cultural context influences their use and meaning."],["The student fails to consider the cultural context of the texts.","The student mentions cultural context but does not explain its influence on the themes or patterns.","The student identifies elements of cultural context but struggles to connect them to the themes or patterns.","The student explores how cultural context affects the treatment of themes and patterns, providing some supporting details.","The student clearly analyzes how cultural context shapes the themes and patterns in both texts, using detailed examples.","The student provides a nuanced and insightful analysis of how cultural context profoundly influences the themes, patterns, and overall meaning of the texts."]]}