{"criteria":["Understanding of Differences Between Genres","Use of Structural Elements in Analysis","Clarity and Precision in Communication"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the differences between poems, drama, and prose.","Student shows minimal understanding of the differences between poems, drama, and prose with significant misconceptions.","Student identifies some differences between poems, drama, and prose, but explanations are superficial or incomplete.","Student explains basic differences between poems, drama, and prose with some accuracy.","Student clearly explains several key differences between poems, drama, and prose, providing relevant examples.","Student comprehensively explains the major differences between poems, drama, and prose, demonstrating a strong understanding of genre conventions."],["Student does not refer to any structural elements of poems or drama in their analysis.","Student mentions structural elements of poems or drama, but inaccurately or irrelevantly.","Student identifies some structural elements (e.g., verse, dialogue) but struggles to connect them to the meaning or effect of the text.","Student refers to relevant structural elements of poems and drama in their analysis, such as verse, rhythm, or dialogue.","Student effectively uses structural elements (e.g., meter, stage directions) to support their analysis of poems and drama.","Student skillfully incorporates structural elements into their analysis, demonstrating a sophisticated understanding of how these elements contribute to the overall meaning and impact of the text."],["Student's explanation is unclear, disorganized, and difficult to understand.","Student's explanation lacks clarity and contains significant errors in grammar or mechanics.","Student's explanation is somewhat clear but lacks precision and may contain some errors.","Student communicates their understanding of genre differences and structural elements with reasonable clarity and accuracy.","Student communicates their ideas clearly and precisely, using appropriate language and terminology.","Student communicates their understanding with exceptional clarity, precision, and eloquence, demonstrating mastery of language and concepts."]]}