{"criteria":["Accuracy and Depth of Character Description","Use of Textual Evidence","Clarity and Organization of Description"],"points":[0,1,2,3,4,5],"descriptions":[["The description of the character, setting, or event is missing or completely inaccurate.","The description is superficial and lacks specific details from the text. There are significant inaccuracies.","The description includes some details from the text, but lacks depth and contains inaccuracies or generalizations.","The description is generally accurate and includes some specific details from the text, but could benefit from greater depth and analysis.","The description is accurate, detailed, and draws on specific textual evidence. Analysis demonstrates a good understanding of the character, setting, or event.","The description is insightful, comprehensive, and thoroughly supported by specific details from the text. Analysis demonstrates a deep and nuanced understanding of the character, setting, or event, including its complexity and motivations."],["No textual evidence is provided.","Minimal textual evidence is used, and it is not relevant or accurately cited.","Some textual evidence is provided, but it is limited or not clearly connected to the description.","Textual evidence is used to support the description, but the connection could be stronger or more explicit.","Relevant and specific textual evidence is effectively used to support the description and analysis.","Abundant, relevant, and compelling textual evidence is seamlessly integrated to support a sophisticated and insightful description and analysis."],["The description is unclear, disorganized, and difficult to follow.","The description lacks clarity and organization, making it challenging to understand the character, setting, or event.","The description is somewhat clear and organized, but there are areas where clarity and coherence could be improved.","The description is generally clear and organized, presenting a coherent picture of the character, setting, or event.","The description is clear, well-organized, and easy to follow, effectively conveying the key aspects of the character, setting, or event.","The description is exceptionally clear, logically organized, and artfully crafted, demonstrating a mastery of language and expression."]]}