{"criteria":["Identification of Narrator and Point of View","Comparison of Narrative Perspectives","Analysis of Impact of Point of View"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify the narrator or point of view in either story.","The student incorrectly identifies the narrator or point of view in one or both stories.","The student identifies the narrator and point of view in one story but struggles with the other.","The student correctly identifies the narrator and point of view in both stories but provides limited explanation.","The student accurately identifies the narrator and point of view in both stories, providing clear explanations and examples from the text.","The student skillfully identifies the narrator and point of view in both stories, providing insightful explanations, examples, and demonstrates a nuanced understanding of how the narrator shapes the narrative."],["The student does not attempt to compare the narrative perspectives of the two stories.","The student offers a vague or inaccurate comparison of the narrative perspectives.","The student identifies a similarity or difference between the narrative perspectives but does not elaborate.","The student identifies several similarities and differences between the narrative perspectives but lacks depth in analysis.","The student provides a thorough comparison of the narrative perspectives, citing specific textual evidence to support their claims.","The student offers a sophisticated and insightful comparison of the narrative perspectives, exploring the nuances and complexities of each and demonstrating a comprehensive understanding of their impact on the stories."],["The student does not address how the point of view impacts the story in either case.","The student makes unsubstantiated claims about the impact of the point of view.","The student briefly mentions the impact of point of view but provides no specific examples.","The student explains how the point of view impacts the story in general terms, using some textual evidence.","The student effectively analyzes how the point of view shapes the reader's understanding of the characters, events, and themes in both stories.","The student demonstrates a deep and nuanced understanding of how point of view influences the narrative, offering compelling insights and supporting their analysis with well-chosen textual examples and sophisticated reasoning."]]}