{"criteria":["Reading Comprehension of Literary Texts","Analysis of Literary Devices and Techniques","Interpretation and Inference","Textual Evidence and Support"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; unable to identify key themes or elements.","Struggles to comprehend the text; identifies only superficial details with significant prompting.","Demonstrates basic comprehension, identifying main ideas and some literary devices with some prompting.","Comprehends the text with moderate understanding, identifying main ideas, most literary devices, and making connections with minimal prompting.","Demonstrates a strong understanding of the text, accurately identifying main ideas, literary devices, and making insightful connections independently.","Exhibits a deep and insightful understanding of the text, thoroughly analyzing main ideas, literary devices, and making sophisticated connections and interpretations independently."],["Unable to identify or discuss any literary devices or techniques used in the text.","Identifies literary devices incorrectly or only with direct instruction.","Identifies a few literary devices with limited understanding of their purpose or effect.","Identifies several literary devices and explains their basic effect on the text with some prompting.","Identifies and analyzes literary devices effectively, explaining their impact on the text with minimal prompting.","Demonstrates a sophisticated understanding of literary devices, analyzing their nuanced effects on the text and how they contribute to the overall meaning independently."],["Unable to make any inferences or interpret the text beyond the literal meaning.","Makes illogical inferences or relies heavily on surface-level interpretations with prompting.","Makes simple inferences with limited justification from the text with some prompting.","Makes reasonable inferences and interpretations supported by textual evidence with minimal prompting.","Draws insightful inferences and interpretations, effectively supporting them with textual evidence independently.","Demonstrates exceptional interpretive skills, drawing nuanced inferences and supporting them with compelling textual evidence to develop original insights independently."],["Provides no textual evidence to support claims or interpretations.","Provides irrelevant or inaccurate textual evidence with significant prompting.","Provides some textual evidence, but it is weak, general, or loosely connected to the analysis with some prompting.","Provides relevant textual evidence to support claims, but the connection is not always clear with minimal prompting.","Effectively uses specific and relevant textual evidence to support claims and interpretations independently.","Skillfully integrates textual evidence to provide strong and insightful support for claims, demonstrating a thorough understanding of the text independently."]]}