{"criteria":["Identification of Genre and Themes","Comparison of Approaches to Themes","Comparison of Approaches to Topics","Use of Textual Evidence","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify the genre of the stories or relevant themes.","Identifies the genre of the stories but struggles to pinpoint common themes.","Identifies the genre and lists themes, but lacks depth in understanding.","Accurately identifies the genre and key themes present in both stories.","Identifies genre and themes effectively, providing insightful observations.","Masterfully identifies the genre and themes, revealing nuanced understandings."],["No attempt to compare how themes are approached in the stories.","Offers a superficial comparison of thematic approaches with little supporting detail.","Compares the approaches to themes but lacks clarity and specific examples.","Clearly compares how each story approaches similar themes, using relevant examples.","Provides a detailed comparison of thematic approaches, highlighting significant differences and similarities.","Offers an exceptionally insightful comparison of the nuances in each story’s thematic approach."],["No attempt to compare how topics are approached in the stories.","Offers a superficial comparison of topical approaches with little supporting detail.","Compares the approaches to topics but lacks clarity and specific examples.","Clearly compares how each story approaches similar topics, using relevant examples.","Provides a detailed comparison of topical approaches, highlighting significant differences and similarities.","Offers an exceptionally insightful comparison of the nuances in each story’s topical approach."],["No textual evidence is provided to support claims.","Minimal textual evidence; relevance is questionable.","Some textual evidence is used, but connection to claims is weak.","Relevant textual evidence is provided to support comparisons.","Strong textual evidence effectively bolsters the analysis and comparison.","Evidence is used masterfully, enhancing the depth and validity of the comparative analysis."],["Response is unclear and disorganized, making it difficult to understand the comparison.","Ideas are somewhat organized, but lack clarity.","The comparison is understandable but could benefit from clearer organization.","Presents a clear and organized comparison of the stories.","The response is well-organized and clearly articulates the comparison.","Presents an exceptionally clear, concise, and well-organized comparative analysis."]]}