{"criteria":["Identification of Structural Elements","Explanation of the Relationship Between Parts","Understanding of Overall Structure"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any structural elements (chapters, scenes, stanzas).","The student identifies a structural element but does not explain its function or relevance to the text as a whole.","The student identifies basic structural elements but struggles to explain how they contribute to the overall structure.","The student identifies several structural elements and provides a somewhat clear explanation of their function within the text.","The student accurately identifies key structural elements and provides a clear explanation of how they contribute to the overall structure.","The student expertly identifies structural elements, clearly explains how they interact to shape the narrative, and demonstrates a sophisticated understanding of the text's architecture."],["The student does not attempt to explain how the structural elements relate to each other.","The student offers a vague or inaccurate explanation of how the parts of the text relate.","The student attempts to explain the relationship between parts but lacks clarity or precision.","The student demonstrates a basic understanding of how the parts of the text connect to each other.","The student clearly explains how different sections of the text build upon each other to create the overall structure.","The student offers insightful analysis of how the different sections of the text interact, revealing nuanced connections and a comprehensive grasp of the text's construction."],["The student demonstrates no understanding of how the elements create an overall structure.","The student shows minimal understanding of how structural elements contribute to the text's overall form.","The student demonstrates a limited understanding of how the structural elements contribute to the whole.","The student demonstrates a reasonable understanding of how structural elements shape the text, but the analysis could be more detailed.","The student demonstrates a strong understanding of how the parts create a complete narrative or argument.","The student offers a complete and insightful analysis of how all structural elements combine to create a unified, purposeful, and artful whole."]]}