{"criteria":["Accuracy of Comprehension","Complexity of Text Selection","Independence and Proficiency"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; unable to answer basic comprehension questions.","Demonstrates very limited understanding; struggles to answer basic comprehension questions, often incorrectly.","Demonstrates some understanding of the text; answers basic comprehension questions with some inaccuracies or gaps.","Demonstrates a generally accurate understanding of the text; answers basic comprehension questions correctly and can identify main ideas.","Demonstrates a strong understanding of the text; answers comprehension questions accurately, identifies main ideas, and makes some inferences.","Demonstrates a comprehensive and insightful understanding of the text; answers complex comprehension questions accurately, identifies main ideas, makes insightful inferences, and supports them with evidence."],["Does not engage with texts within the appropriate complexity band.","Attempts to engage with texts, but selects materials far below the target complexity band.","Selects texts that are slightly below the target complexity band, demonstrating limited challenge.","Selects texts within the appropriate complexity band, showing a satisfactory level of challenge.","Selects texts at the high end of the grade 4-5 complexity band, demonstrating a willingness to engage with challenging material.","Consistently selects texts at the high end of the complexity band or beyond, demonstrating a proactive approach to challenging reading material."],["Requires significant assistance to read and understand texts; cannot read independently.","Requires frequent assistance and struggles to read independently; reads slowly and with many errors.","Reads with some independence but still requires occasional assistance; reads with some errors or hesitations.","Reads independently with reasonable fluency and accuracy; demonstrates proficiency in most aspects of reading.","Reads independently and proficiently; demonstrates fluency, accuracy, and strong comprehension skills.","Reads independently, fluently, and proficiently; demonstrates exceptional comprehension, critical thinking, and a love of reading."]]}