{"criteria":["Accuracy of Argument Reconstruction: How accurately does the student reconstruct the arguments presented in the source texts?","Identification of Reasoning: How well does the student identify the reasoning (e.g., analogies, cause\/effect relationships) used in the arguments?","Evaluation of Evidence: How effectively does the student evaluate the evidence presented in support of the arguments?"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of the source texts' arguments or presents a completely inaccurate reconstruction.","The student's reconstruction of the arguments contains significant inaccuracies or omissions, indicating a poor understanding of the source texts.","The student's reconstruction of the arguments contains some inaccuracies or omissions, demonstrating a partial understanding of the source texts.","The student mostly accurately reconstructs the arguments, with only minor inaccuracies or omissions.","The student accurately reconstructs the arguments presented in the source texts, demonstrating a strong understanding.","The student expertly and comprehensively reconstructs the arguments, demonstrating a thorough and nuanced understanding of the source texts."],["The student fails to identify any reasoning used in the arguments.","The student identifies reasoning inaccurately or identifies only superficial elements.","The student identifies some reasoning but misses key components or demonstrates a limited understanding of their function.","The student identifies most of the reasoning used in the arguments and demonstrates a general understanding of their function.","The student accurately identifies the reasoning used in the arguments and explains their function effectively.","The student skillfully identifies and analyzes the reasoning used in the arguments, demonstrating a deep understanding of their rhetorical effect."],["The student does not evaluate the evidence or provides irrelevant or nonsensical commentary.","The student's evaluation of the evidence is superficial, inaccurate, or lacking in supporting details.","The student's evaluation of the evidence is partially developed, but contains weaknesses in analysis or justification.","The student provides a generally sound evaluation of the evidence, with minor areas for improvement.","The student provides a well-reasoned and supported evaluation of the evidence, demonstrating critical thinking skills.","The student provides an insightful and nuanced evaluation of the evidence, demonstrating exceptional critical thinking and analytical skills."]]}