{"criteria":["Identification of Theme","Analysis of Character Responses\/Speaker Reflection","Quality of Summary"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify a theme or provides an inaccurate theme unrelated to the text.","The student attempts to identify a theme but struggles to connect it to the text's details.","The student identifies a possible theme, but the connection to the text is weak or superficial.","The student identifies a relevant theme with some supporting details from the text.","The student accurately identifies a significant theme and supports it with clear details from the text, demonstrating understanding of the text's central message.","The student skillfully identifies a nuanced and insightful theme, providing compelling evidence from the text and demonstrating a deep understanding of its underlying message."],["The student does not address character responses or speaker reflections, or provides irrelevant information.","The student mentions character responses or speaker reflections but fails to connect them to the development of the theme.","The student vaguely describes character responses or speaker reflections with a limited understanding of their impact on the theme.","The student explains how character responses or speaker reflections contribute to the theme, providing some relevant examples from the text.","The student analyzes character responses or speaker reflections to explain how they develop the theme, using specific textual evidence to support their analysis.","The student provides a sophisticated analysis of how character responses or speaker reflections intricately shape and reveal the theme, demonstrating a comprehensive grasp of literary devices."],["The student does not provide a summary, or the summary is completely inaccurate and lacks key details.","The student attempts a summary, but it is incomplete, disorganized, and contains significant inaccuracies.","The student provides a basic summary that captures some of the main points but misses important details or lacks clarity.","The student presents a clear and concise summary that includes the main events or ideas, demonstrating a good understanding of the text.","The student delivers a comprehensive and well-organized summary, capturing the essence of the text with accurate and relevant details.","The student crafts a masterful summary that not only captures the text's essence but also highlights its nuances, demonstrating exceptional comprehension and synthesis skills."]]}