{"criteria":["Identification of Narrator\/Speaker and Point of View","Explanation of Influence on Event Description","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify the narrator or speaker and their point of view is not mentioned.","Identifies the narrator or speaker, but struggles to identify the point of view.","Identifies the narrator or speaker and makes a basic attempt to identify their point of view. Understanding is superficial.","Identifies the narrator or speaker and identifies their point of view. Demonstrates a satisfactory understanding.","Clearly and accurately identifies the narrator or speaker and their point of view. Provides solid evidence from the text.","Masterfully identifies the narrator or speaker and their point of view. Provides insightful and well-supported evidence from the text, demonstrating a deep understanding."],["Does not explain how the narrator's\/speaker's point of view influences the description of events.","Attempts to explain the influence, but the explanation is unclear or irrelevant.","Provides a vague or simplistic explanation of how the point of view influences the description of events.","Explains how the narrator's\/speaker's point of view influences the description of events with some supporting details.","Clearly explains how the narrator's\/speaker's point of view shapes the description of events, providing relevant examples from the text.","Demonstrates a sophisticated understanding of how the narrator's\/speaker's point of view intricately shapes the description of events. Offers compelling textual evidence and nuanced analysis."],["Provides no textual evidence.","Provides minimal and\/or irrelevant textual evidence.","Provides some textual evidence, but it is weakly connected to the explanation.","Provides relevant textual evidence to support the explanation.","Provides strong and well-chosen textual evidence to support the explanation effectively.","Provides abundant, compelling, and skillfully integrated textual evidence to fully support and enhance the explanation."]]}