{"criteria":["Identification of Characters, Settings, or Events","Comparison and Contrast","Use of Textual Details","Analysis of Interactions"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify any characters, settings, or events.","Identifies only one character, setting, or event with no detail.","Identifies two characters, settings, or events with minimal detail.","Identifies two or more characters, settings, or events with some detail but lacks clarity.","Clearly identifies two or more characters, settings, or events with relevant details.","Thoroughly and accurately identifies two or more characters, settings, or events with rich, specific details."],["Makes no attempt to compare or contrast.","Attempts to compare or contrast, but the effort is unclear or illogical.","Presents a superficial comparison or contrast with limited connections.","Compares and contrasts with some relevant connections, but lacks depth.","Clearly compares and contrasts, drawing logical connections between elements.","Insightfully compares and contrasts, revealing nuanced and sophisticated connections between elements."],["Provides no textual details to support claims.","Provides few, irrelevant textual details.","Provides some textual details, but they are weakly connected to the comparison.","Supports comparison with relevant textual details, but analysis is superficial.","Effectively uses textual details to support and enhance the comparison and contrast.","Masterfully integrates textual details to provide compelling support and insightful analysis."],["Does not analyze interactions between characters, settings, or events.","Attempts to analyze interactions, but the analysis is unclear or illogical.","Presents a basic analysis of interactions with limited connections.","Analyzes interactions with some relevant connections, but lacks depth.","Clearly analyzes interactions, drawing logical connections between elements.","Insightfully analyzes interactions, revealing nuanced and sophisticated connections between elements."]]}