{"criteria":["Identification of Figurative Language","Understanding Meaning and Effect","Application to Overall Text"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any instances of figurative language in the text.","The student identifies figurative language but struggles to provide accurate examples.","The student identifies some instances of figurative language, but the explanation is superficial or incorrect.","The student correctly identifies most instances of figurative language with adequate explanations.","The student accurately identifies almost all instances of figurative language and demonstrates a good understanding of their meanings and effects.","The student expertly identifies all instances of figurative language, providing insightful and nuanced explanations of their meanings and effects in the text."],["The student cannot explain the meaning or effect of any figurative language identified.","The student attempts to explain the meaning or effect of figurative language, but the explanation is unclear or incorrect.","The student provides a basic explanation of the meaning or effect of some figurative language, but lacks depth or insight.","The student demonstrates a satisfactory understanding of the meaning and effect of most figurative language identified.","The student shows a strong understanding of the meaning and effect of almost all figurative language, providing clear and thoughtful explanations.","The student demonstrates a sophisticated and comprehensive understanding of the meaning and effect of all figurative language, offering insightful interpretations and analysis."],["The student does not connect the use of figurative language to the overall meaning or theme of the text.","The student attempts to connect figurative language to the text's meaning, but the connection is vague or unsupported.","The student makes a superficial connection between some figurative language and the text's meaning.","The student adequately connects the use of figurative language to the overall meaning or theme of the text.","The student effectively connects the use of figurative language to the overall meaning or theme of the text, providing supporting evidence.","The student masterfully connects the use of figurative language to the overall meaning and themes of the text, offering profound insights and demonstrating a deep understanding of the author's craft."]]}