{"criteria":["Identification of Theme or Central Idea","Conveyance of Theme Through Details","Summary of Text","Objectivity and Avoidance of Personal Opinion"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify a theme or central idea of the text.","The student attempts to identify a theme or central idea, but the response is vague or inaccurate.","The student identifies a theme or central idea, but the connection to the text is weak.","The student identifies a plausible theme or central idea of the text.","The student clearly identifies a relevant theme or central idea of the text with supporting details.","The student insightfully identifies a central idea or theme, demonstrating a comprehensive understanding of the text's underlying message."],["The student does not address how the theme or central idea is conveyed through particular details.","The student mentions details but does not connect them to the theme or central idea.","The student attempts to explain how details convey the theme, but the explanation is superficial or unclear.","The student explains how some details contribute to the development of the theme or central idea.","The student clearly explains how specific details throughout the text convey the theme or central idea.","The student expertly analyzes how carefully selected details contribute to the nuanced conveyance of the central idea or theme, demonstrating sophisticated comprehension."],["The student does not provide a summary of the text.","The student provides a very brief and incomplete summary of the text.","The student provides a summary that includes irrelevant information or omits key details.","The student provides a basic summary of the text that includes the main events or ideas.","The student provides a clear and concise summary of the text, accurately representing the main points.","The student delivers a succinct, comprehensive summary, capturing the text's essence without injecting personal opinions or judgements."],["The student's response is dominated by personal opinions or judgments, with no attempt to summarize the text objectively.","The student includes personal opinions or judgments in the summary, but attempts to present some objective information.","The student's summary is somewhat influenced by personal opinions or judgments.","The student mostly avoids personal opinions or judgments in the summary, but there may be some minor instances.","The student provides a summary that is free of personal opinions or judgments.","The student rigorously maintains objectivity, presenting a summary devoid of personal opinions, interpretations, or judgments."]]}