{"criteria":["Identification of Figurative Language","Analysis of Connotative Meaning","Impact of Word Choice on Meaning and Tone"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any instances of figurative language.","The student identifies one instance of figurative language, but the explanation is missing or inaccurate.","The student identifies one instance of figurative language and provides a somewhat accurate explanation.","The student identifies two instances of figurative language and provides accurate explanations.","The student identifies three instances of figurative language and provides accurate explanations, demonstrating a good understanding.","The student identifies multiple instances of figurative language and provides insightful and accurate explanations, demonstrating a strong understanding."],["The student does not address connotative meanings.","The student attempts to address connotative meaning but does so vaguely or inaccurately.","The student identifies a connotative meaning but struggles to explain its significance.","The student accurately identifies and explains the connotative meaning of a word or phrase.","The student analyzes the connotative meanings of multiple words\/phrases and explains their impact on the text.","The student demonstrates a nuanced understanding of connotative meanings and their effect on the overall meaning and tone of the text."],["The student does not analyze the impact of word choice.","The student makes a vague attempt to discuss the impact of word choice, but the analysis is superficial.","The student identifies how one specific word choice impacts either the meaning or the tone, but not both.","The student analyzes how a specific word choice impacts both the meaning and tone of the text.","The student analyzes how several specific word choices impact the meaning and tone of the text, providing supporting evidence.","The student provides a comprehensive analysis of how specific word choices shape the meaning and tone of the text, demonstrating a sophisticated understanding."]]}