{"criteria":["Identification of Themes and Topics: How well does the student identify the central themes and topics present in the texts being compared?","Comparison of Approaches: How effectively does the student compare the approaches used in different genres or forms to address similar themes?","Understanding of Genre\/Form Influence: How well does the student demonstrate an understanding of how genre or form affects the presentation of themes and topics?","Clarity and Organization: How clearly and logically does the student present their comparison and analysis?"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify any relevant themes or topics in either text.","The student identifies themes or topics in only one text, or the identifications are inaccurate.","The student identifies basic themes and topics in both texts, but lacks depth or clarity.","The student accurately identifies several key themes and topics in both texts, demonstrating a good understanding.","The student thoroughly identifies and explains major themes and topics in both texts, showing strong insight.","The student provides a nuanced and comprehensive identification of themes and topics, including subtleties and complexities within both texts."],["The student does not attempt to compare the approaches or incorrectly states them.","The student makes a superficial attempt at comparison, with significant inaccuracies or omissions.","The student presents a basic comparison of approaches but lacks detail and specific examples.","The student offers a clear comparison of how the texts approach similar themes, with relevant details.","The student provides a detailed and insightful comparison, exploring the nuances in each text's approach.","The student demonstrates an exceptional ability to compare and contrast the texts' approaches, offering original insights and sophisticated analysis."],["The student shows no awareness of how genre or form influences the texts.","The student mentions genre or form but does not connect it to the presentation of themes and topics.","The student vaguely connects genre or form to the presentation of themes and topics, with limited explanation.","The student clearly explains how genre or form shapes the presentation of themes and topics, providing specific examples.","The student insightfully analyzes how genre or form intricately affects the themes and topics, showcasing a deep understanding.","The student masterfully illustrates how genre or form profoundly shapes the themes and topics, offering innovative perspectives and critical analysis."],["The response is unclear, disorganized, and difficult to understand.","The response lacks clarity and organization, making it hard to follow the student’s reasoning.","The response is somewhat organized but contains unclear statements and lacks logical flow.","The response is generally clear and organized, with a logical progression of ideas.","The response is clear, well-organized, and presents a coherent analysis with strong transitions.","The response is exceptionally clear, logically structured, and presents a sophisticated and compelling analysis that enhances understanding."]]}