{"criteria":["Accuracy of Explicit Information","Quality of Inferences","Relevance of Evidence to Inferences"],"points":[0,1,2,3,4,5],"descriptions":[["No textual evidence is cited, or cited evidence is entirely irrelevant and inaccurate.","Cited textual evidence is minimal, largely inaccurate, or demonstrates a misunderstanding of the explicit content.","Cites some textual evidence that is relevant to the explicit content, but accuracy is questionable or incomplete.","Cites generally accurate and relevant textual evidence to support understanding of explicit content.","Cites accurate and relevant textual evidence that clearly supports understanding of explicit content; minor details may be overlooked.","Cites accurate, thorough, and relevant textual evidence that strongly supports a comprehensive understanding of explicit content."],["No inferences are drawn, or inferences are illogical and completely unsupported by the text.","Inferences are attempted, but are illogical, contradictory to the text, or based on significant misinterpretations.","Draws weak or questionable inferences with little textual support or based on superficial readings.","Draws reasonable inferences with some textual support, but may contain logical gaps or oversimplifications.","Draws well-supported and logical inferences based on a solid understanding of the text.","Draws insightful, nuanced, and thoroughly supported inferences that reveal a deep understanding of the text's complexities."],["Cited evidence is completely unrelated to the inferences made, or no evidence is cited at all.","Attempts to connect evidence to inferences are vague, tenuous, or based on misinterpretations of the text.","Evidence is loosely connected to inferences, but the relationship is unclear or requires significant leaps in logic.","Evidence is relevant to the inferences drawn, but the connection could be stronger or more clearly explained.","Evidence clearly supports the inferences, and the relationship is explained with reasonable clarity.","Evidence powerfully and directly supports the inferences, with a clear, concise, and insightful explanation of the relationship."]]}