{"criteria":["Identification of Narrator\/Speaker and Point of View","Explanation of How the Author Develops Point of View","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify the narrator or speaker and fails to recognize any point of view.","Incorrectly identifies the narrator\/speaker or point of view, showing a misunderstanding of basic narrative elements.","Identifies the narrator\/speaker and point of view, but lacks clarity or provides a superficial understanding.","Correctly identifies the narrator\/speaker and point of view, providing a clear and accurate understanding.","Identifies the narrator\/speaker and point of view with insightful accuracy, demonstrating a comprehensive grasp of narrative perspective.","Masterfully identifies the narrator\/speaker and point of view, offering a nuanced and perceptive understanding of the narrative voice."],["Provides no explanation of how the author develops the point of view.","Offers a vague or incomplete explanation, lacking specific details or examples from the text.","Explains some methods the author uses to develop point of view, but the explanation lacks depth or connection to specific textual evidence.","Clearly explains how the author develops the point of view, providing relevant examples and textual evidence.","Provides a detailed and insightful explanation of the author's techniques, using well-chosen examples to support the analysis.","Offers an exceptionally insightful and comprehensive explanation, demonstrating a sophisticated understanding of the author's craft and its effect on the narrative."],["No textual evidence is used to support claims.","Minimal or irrelevant textual evidence is provided.","Some textual evidence is used, but it is not always relevant or effectively explained.","Uses relevant textual evidence to support the explanation, enhancing the analysis.","Effectively integrates textual evidence, providing strong support for the analysis and demonstrating a clear understanding of the text.","Skillfully incorporates textual evidence, offering compelling support for the analysis and demonstrating a profound understanding of the text's nuances."]]}