{"criteria":["Comprehension of Literary Texts","Analysis and Interpretation","Use of Evidence and Support","Clarity and Coherence of Response"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; struggles to identify basic plot elements or themes.","Shows minimal understanding; identifies some plot elements but struggles with themes and deeper meanings.","Demonstrates basic understanding; identifies main plot elements and themes but lacks detailed analysis.","Demonstrates solid understanding; analyzes plot, identifies themes, and shows some insight into character development.","Demonstrates strong understanding; provides detailed analysis of plot, themes, and character development with clear insights.","Demonstrates exceptional understanding; provides insightful and comprehensive analysis of all aspects of the text, including nuanced interpretations and connections."],["Unable to analyze or interpret literary devices, figurative language, or author's purpose.","Attempts to analyze but struggles to identify literary devices or author's purpose.","Identifies some literary devices and makes basic interpretations, but lacks depth.","Analyzes literary devices and interprets author's purpose with reasonable insight.","Provides detailed analysis of literary devices and interprets author's purpose with strong insights and supporting evidence.","Offers sophisticated and nuanced analysis of literary devices, figurative language, and author's purpose, demonstrating a deep understanding of their impact on the text."],["Provides no evidence from the text to support claims or interpretations.","Provides minimal or irrelevant evidence from the text.","Provides some evidence, but it is weak or not clearly connected to the analysis.","Supports analysis with relevant evidence from the text; explanations are adequate.","Effectively uses textual evidence to support analysis and interpretations; explanations are clear and well-reasoned.","Skillfully integrates textual evidence to provide compelling support for insightful analysis and interpretations; explanations are sophisticated and nuanced."],["Response is unclear, disorganized, and difficult to understand.","Response lacks clarity and coherence; ideas are poorly organized.","Response is somewhat clear but lacks strong organization and transitions.","Response is generally clear and organized with logical progression of ideas.","Response is clear, well-organized, and demonstrates a logical flow of ideas with effective transitions.","Response is exceptionally clear, coherent, and demonstrates a sophisticated and nuanced understanding through skillful organization and expression of ideas."]]}