{"criteria":["Reading Comprehension: Understanding explicit and implicit meanings in informational texts.","Analysis and Interpretation: Examining the author's purpose, perspective, and use of rhetoric.","Evidence and Support: Citing relevant textual evidence to support claims and interpretations.","Organization and Clarity: Presenting ideas in a clear, logical, and coherent manner."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; struggles to identify basic information.","Shows limited understanding; identifies some explicit information but misses implicit meanings.","Demonstrates partial understanding; identifies most explicit information and some implicit meanings with prompting.","Shows adequate understanding; identifies explicit information and infers some implicit meanings independently.","Demonstrates strong understanding; accurately identifies explicit information and infers complex implicit meanings.","Demonstrates comprehensive understanding; skillfully identifies explicit information, infers nuanced implicit meanings, and connects them to broader contexts."],["Unable to identify the author's purpose or perspective; no recognition of rhetorical devices.","Struggles to identify the author's purpose or perspective; limited recognition of rhetorical devices.","Identifies the author's purpose and perspective with prompting; recognizes some basic rhetorical devices.","Identifies the author's purpose and perspective independently; recognizes and explains the effect of several rhetorical devices.","Analyzes the author's purpose and perspective with insight; explains the effect of rhetorical devices on the text.","Critically analyzes the author's purpose and perspective; evaluates the effectiveness of rhetorical devices in achieving the author's intent."],["Provides no textual evidence to support claims; interpretations are unsubstantiated.","Provides limited or irrelevant textual evidence; struggles to connect evidence to claims.","Provides some textual evidence, but the connection to claims is weak or unclear.","Provides relevant textual evidence to support claims; explanation of evidence is adequate.","Provides strong and relevant textual evidence to support claims; explanation of evidence is clear and insightful.","Provides compelling and well-analyzed textual evidence to support nuanced claims; demonstrates a deep understanding of the text."],["Ideas are disorganized and difficult to follow; writing lacks clarity and coherence.","Ideas are somewhat disorganized; writing lacks clarity and coherence in places.","Ideas are generally organized; writing is mostly clear with some lapses in coherence.","Ideas are logically organized; writing is clear and coherent.","Ideas are logically and effectively organized; writing is clear, coherent, and engaging.","Ideas are presented in a sophisticated and compelling manner; writing is exceptionally clear, coherent, and demonstrates a mastery of language."]]}