{"criteria":["Identification of the Structural Element","Analysis of Contribution to Theme","Analysis of Contribution to Setting","Analysis of Contribution to Plot","Clarity and Coherence of Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["The student fails to identify the specific sentence, chapter, scene, or stanza.","The student identifies a structural element, but it is inaccurate or vaguely related to the text.","The student correctly identifies a sentence, chapter, scene, or stanza but does not explain its relevance.","The student identifies a structural element and provides a basic explanation of its role within the text.","The student identifies a structural element and clearly explains its role in the overall structure.","The student precisely identifies a structural element and insightfully explains its function in the broader context of the text."],["The student does not attempt to analyze the element's contribution to the theme.","The student mentions the theme but does not connect it to the identified element.","The student makes a superficial connection between the element and the theme.","The student provides a reasonable analysis of how the element contributes to the development of the theme.","The student provides a detailed analysis of how the element significantly shapes the theme.","The student offers a nuanced and insightful analysis of the element's profound impact on the theme, demonstrating deep comprehension."],["The student does not address how the element contributes to the setting.","The student mentions the setting but does not relate it to the identified element.","The student vaguely connects the element to the setting.","The student explains how the element helps to establish or develop the setting.","The student thoroughly analyzes the element's role in creating a vivid and impactful setting.","The student masterfully dissects the element's intricate relationship with the setting, revealing subtle nuances and artistic intention."],["The student does not address how the element contributes to the plot.","The student mentions the plot but fails to connect it to the identified element.","The student offers a weak connection between the element and the plot.","The student analyzes how the element influences the unfolding of the plot.","The student comprehensively evaluates the element's integral role in driving the plot forward.","The student brilliantly elucidates the element's pivotal function in the narrative arc, highlighting its influence on plot progression."],["The student’s explanation is unclear, disorganized, and difficult to understand.","The student's explanation lacks clarity and contains significant organizational issues.","The student’s explanation is somewhat understandable but lacks coherence in certain areas.","The student provides a clear and reasonably coherent explanation.","The student delivers a well-organized, clear, and coherent explanation.","The student presents an exceptionally articulate, cogent, and compelling explanation that demonstrates mastery of analytical skills."]]}