{"criteria":["Identification of Plot Episodes","Description of Plot Unfolding","Character Response and Change","Understanding of Resolution"],"points":[0,1,2,3,4,5],"descriptions":[["Does not identify any plot episodes or demonstrates no understanding of the story's plot.","Identifies only one plot episode with minimal accuracy.","Identifies a few plot episodes, but with some inaccuracies or omissions.","Identifies most plot episodes accurately but may miss subtle nuances.","Identifies all major plot episodes accurately and demonstrates a good understanding of their sequence.","Identifies all plot episodes with precision, including subtle or implicit ones, demonstrating a comprehensive understanding of the plot's structure."],["Offers no description of how the plot unfolds or the relationships between episodes.","Offers a vague or incomplete description of how the plot unfolds.","Describes how the plot unfolds in a limited way, missing key connections between episodes.","Describes the unfolding of the plot with reasonable clarity, linking most episodes effectively.","Clearly and effectively describes how the plot unfolds, demonstrating a strong understanding of cause-and-effect relationships between episodes.","Masterfully describes the nuanced unfolding of the plot, revealing a sophisticated understanding of the interconnections and dependencies between episodes."],["Does not describe how characters respond or change as the plot progresses.","Offers a superficial or inaccurate account of character responses and changes.","Describes some character responses and changes, but lacks depth or insight.","Describes character responses and changes with reasonable accuracy and connection to the plot.","Effectively describes how characters respond and change, demonstrating a clear understanding of their motivations and development.","Provides an insightful and nuanced analysis of character responses and changes, revealing a deep understanding of their psychological complexity and how they drive the plot."],["Demonstrates no understanding of the resolution or its connection to the plot.","Offers a minimal or incorrect interpretation of the resolution.","Identifies the resolution but does not adequately explain its connection to the plot.","Explains the resolution and its connection to the plot with reasonable clarity.","Clearly explains the resolution and its logical connection to the preceding plot events.","Provides a comprehensive and insightful analysis of the resolution, revealing its thematic significance and its impact on the characters and the story as a whole."]]}