{
  "criteria": [
    "Understanding of Figurative Language",
    "Analysis of Word Choice and Impact",
    "Application of Language Standards"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student demonstrates no understanding of figurative language, connotative meanings, or sound devices in the text.",
      "Student shows minimal understanding of figurative language, connotative meanings, or sound devices; interpretation is largely inaccurate.",
      "Student identifies some instances of figurative language, connotative meanings, or sound devices but struggles to explain their impact.",
      "Student identifies and explains most instances of figurative language, connotative meanings, or sound devices, but the analysis may lack depth or accuracy.",
      "Student accurately identifies and analyzes the impact of figurative language, connotative meanings, and sound devices on the text, demonstrating a strong understanding.",
      "Student expertly identifies and analyzes the nuanced impact of figurative language, connotative meanings, and sound devices, offering insightful interpretations and demonstrating a comprehensive understanding."
    ],
    [
      "Student does not address the impact of word choice, rhymes, or repetitions of sounds in the text.",
      "Student attempts to address word choice and sound devices but provides superficial or inaccurate observations.",
      "Student identifies the effect of word choice, rhyme, and sound repetition but struggles to articulate a clear analysis of the impact on the text.",
      "Student analyzes the impact of word choice, rhyme, and sound repetition on the text, demonstrating a satisfactory level of comprehension.",
      "Student provides a detailed analysis of how word choice, rhyme, and sound repetition contribute to the meaning and tone of the text, demonstrating a strong understanding.",
      "Student offers a sophisticated and insightful analysis of how word choice, rhyme, and sound repetition create layers of meaning and enhance the artistic impact of the text."
    ],
    [
      "Student does not apply any concepts from Grade 7 Language standards 4-6.",
      "Student attempts to apply Grade 7 Language standards but shows confusion or misapplication of the concepts.",
      "Student demonstrates a limited understanding of Grade 7 Language standards and provides some connections to the text, but analysis is superficial.",
      "Student applies Grade 7 Language standards to enhance their analysis of the text, demonstrating a reasonable understanding of relevant concepts.",
      "Student effectively uses Grade 7 Language standards to provide a nuanced and insightful analysis of the text, showing a strong connection between prior learning and current analysis.",
      "Student skillfully and seamlessly integrates Grade 7 Language standards into their comprehensive analysis, revealing a sophisticated and critical understanding of the text's linguistic devices and their impact."
    ]
  ]
}