{
  "criteria": [
    "Understanding of Story Elements in Different Media",
    "Analysis of Medium-Specific Techniques",
    "Clarity and Organization of Comparison"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of how story elements (plot, character, setting) are presented in written and multimedia versions.",
      "Struggles to identify story elements in both written and multimedia versions. Shows minimal comparison between the two.",
      "Identifies some story elements in written and multimedia versions but comparisons are superficial and lack depth.",
      "Identifies most story elements in written and multimedia versions. Begins to compare and contrast how these elements are portrayed.",
      "Clearly identifies story elements in both versions and provides a solid comparison of their presentation, noting some differences in technique.",
      "Demonstrates a comprehensive understanding of story elements and provides a nuanced comparison of their presentation, highlighting the unique techniques of each medium."
    ],
    [
      "Unable to identify any techniques unique to each medium (e.g., lighting, sound, camera angles).",
      "Identifies very few techniques, and struggles to explain their effect on the story.",
      "Identifies some techniques but provides a limited analysis of their effect.",
      "Identifies several techniques and provides a basic analysis of their effect on the story and audience.",
      "Identifies and analyzes several techniques, explaining how they contribute to the overall impact and interpretation of the story.",
      "Provides a sophisticated analysis of a wide range of techniques, demonstrating a deep understanding of their artistic and narrative impact on the story."
    ],
    [
      "Comparison is unclear, disorganized, and difficult to follow.",
      "Comparison lacks focus and organization, making it hard to understand the connections between the two versions.",
      "Comparison is somewhat organized but may lack specific examples or clear connections.",
      "Comparison is generally clear and organized, with relevant examples to support claims.",
      "Comparison is clear, well-organized, and effectively uses specific examples to illustrate the analysis.",
      "Comparison is exceptionally clear, insightful, and presented in a logical and compelling manner."
    ]
  ]
}