{
  "criteria": [
    "Identification of Explicit Textual Evidence",
    "Inference and Interpretation",
    "Strength of Analysis"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No textual evidence is cited or the evidence is completely irrelevant to the analysis.",
      "Minimal attempt to cite textual evidence; evidence is vague or loosely related to the analysis.",
      "Some textual evidence is cited, but it is not the most relevant or compelling to support the analysis. The connection may be weak.",
      "Relevant textual evidence is cited to support the analysis, but there may be missed opportunities for stronger evidence.",
      "Strong textual evidence is consistently cited to support the analysis of what the text says explicitly. Clear connection between evidence and claim is demonstrated.",
      "The most compelling and relevant textual evidence is expertly selected and integrated to provide an insightful analysis of the text's explicit meaning. Evidence strongly supports the claims."
    ],
    [
      "No inferences are made, or inferences are illogical and unsupported by the text.",
      "Inferences are attempted but are superficial, unclear, or weakly connected to the text.",
      "Some inferences are made, but they are not fully developed or convincingly supported by the cited evidence.",
      "Reasonable inferences are drawn from the text and supported with textual evidence, but the analysis could be more thorough.",
      "Well-reasoned inferences are drawn from the text, demonstrating a strong understanding of implicit meanings. Inferences are clearly supported by textual evidence.",
      "Sophisticated and insightful inferences are drawn from the text, revealing a deep understanding of subtext and nuances. Inferences are powerfully supported by carefully selected textual evidence."
    ],
    [
      "Analysis is missing or demonstrates a complete misunderstanding of the text.",
      "Analysis is attempted but is superficial, lacking depth and insight.",
      "Analysis is present but remains basic and does not fully explore the complexities of the text.",
      "Analysis demonstrates a good understanding of the text but could benefit from greater depth and exploration of nuances.",
      "Analysis is thorough and insightful, demonstrating a strong understanding of the text's explicit and implicit meanings.",
      "Analysis is exceptionally insightful, original, and demonstrates a comprehensive understanding of the text, revealing subtle complexities and nuanced interpretations."
    ]
  ]
}