{
  "criteria": [
    "Identification of Figurative and Connotative Meanings",
    "Analysis of Word Choices and Their Impact",
    "Understanding of Analogies and Allusions"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not identify or incorrectly identifies figurative or connotative meanings.",
      "Student identifies figurative or connotative meanings with limited accuracy.",
      "Student identifies some figurative and connotative meanings with reasonable accuracy.",
      "Student accurately identifies most figurative and connotative meanings.",
      "Student accurately identifies figurative and connotative meanings and provides some analysis.",
      "Student accurately identifies figurative and connotative meanings and provides insightful analysis."
    ],
    [
      "Student does not analyze or incorrectly analyzes the impact of word choices.",
      "Student attempts to analyze the impact of word choices with limited success.",
      "Student analyzes the impact of some word choices on meaning or tone.",
      "Student effectively analyzes the impact of most word choices on meaning and tone.",
      "Student analyzes the impact of word choices on meaning and tone, providing clear explanations.",
      "Student analyzes the impact of word choices on meaning and tone, demonstrating a nuanced understanding and insightful explanations."
    ],
    [
      "Student does not recognize or understand analogies or allusions.",
      "Student recognizes analogies or allusions with limited understanding.",
      "Student demonstrates a basic understanding of analogies or allusions.",
      "Student understands and explains the connection between analogies or allusions and the text.",
      "Student effectively analyzes the impact of analogies and allusions on the text's meaning and tone.",
      "Student expertly analyzes the impact of analogies and allusions, demonstrating a deep understanding of their function and significance."
    ]
  ]
}