{
  "criteria": [
    "Identification of Text Structures",
    "Comparison and Contrast of Structures",
    "Analysis of Contribution to Meaning and Style"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student fails to identify the structure of either text.",
      "Student identifies the structure of one text with significant inaccuracies.",
      "Student identifies the structure of one text accurately, or identifies the structure of both texts with inaccuracies.",
      "Student accurately identifies the structure of both texts but does not clearly understand how the structure contributes to the text's meaning.",
      "Student accurately identifies the structure of both texts and understands how the structure contributes to the text's meaning, but lacks depth in analysis.",
      "Student accurately identifies the structure of both texts and thoroughly analyzes how the structure contributes to the text's meaning and style."
    ],
    [
      "Student does not attempt to compare or contrast the structures of the texts.",
      "Student attempts to compare or contrast the texts, but the comparison is superficial or inaccurate.",
      "Student presents a basic comparison and contrast of the text structures but misses key differences or similarities.",
      "Student provides a clear comparison and contrast of the text structures, identifying several key differences and similarities.",
      "Student provides a detailed comparison and contrast of the text structures, noting subtle nuances and connections.",
      "Student provides an insightful and comprehensive comparison and contrast of the text structures, demonstrating a deep understanding of their relationship."
    ],
    [
      "Student does not analyze how the structure contributes to the meaning and style of either text.",
      "Student attempts to analyze the contribution of structure to meaning and style, but the analysis is unclear or irrelevant.",
      "Student identifies a superficial connection between structure and meaning\/style in one or both texts.",
      "Student analyzes how the structure contributes to the meaning and style of both texts, providing some supporting evidence.",
      "Student effectively analyzes how the structure contributes to the meaning and style of both texts, providing strong supporting evidence and logical reasoning.",
      "Student provides a sophisticated and insightful analysis of how the structure contributes to the meaning and style of both texts, demonstrating a nuanced understanding of the author's craft."
    ]
  ]
}