{"criteria":["Accuracy and completeness of story retelling and key detail identification.","Logical sequencing and understanding of plot events.","Use of language from the original story."],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to retell the story or identify any key details, even with significant prompting and support.","The student attempts to retell the story but struggles to recall even basic plot points and cannot identify key details, even with prompting.","The student retells parts of the story but misses several important plot points and can only identify a few key details with considerable support.","The student can retell most of the story with some prompting, identifying some key details but may omit others or misinterpret their significance.","The student accurately retells the story, including almost all key details with minimal prompting. Demonstrates a good understanding of the plot and main events.","The student fluently and accurately retells the story, comprehensively covering all key details without needing any prompting. Demonstrates a strong understanding of the narrative and its important elements."],["The student’s retelling shows no understanding of the story’s sequence or relationship between events.","The student struggles to present the events in a coherent order, showing little understanding of how the plot unfolds.","The student presents the story events out of order, demonstrating a limited grasp of the plot sequence and relationships between events.","The student generally presents the story in the correct sequence but may occasionally mix up minor events, showing a reasonable understanding of the plot.","The student accurately presents the story in a logical sequence, demonstrating a clear understanding of how the plot unfolds and the relationships between events.","The student masterfully presents the story in a compelling and logical sequence, clearly demonstrating a deep understanding of the plot’s intricacies and the cause-and-effect relationships between events."],["The student’s retelling uses language that is completely unrelated to the original story, showing no connection to the text.","The student’s retelling includes minimal language from the original story and struggles to express the events clearly.","The student’s retelling incorporates some language from the original story, but the expression is often unclear or inaccurate.","The student’s retelling includes adequate language from the original story and generally expresses the events clearly, though with limited detail.","The student’s retelling effectively uses language from the original story to enhance clarity and engagement, expressing events with good detail and accuracy.","The student’s retelling skillfully incorporates rich and precise language from the original story to create a vivid and engaging narrative, expressing events with exceptional detail and accuracy."]]}