{"criteria":["Engagement and Understanding","Use of Prior Knowledge and Contextual Clues"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not participate in group reading activities or demonstrate any understanding of the text.","Student attempts to participate but struggles to connect with the text or the group. Shows minimal understanding.","Student participates in group reading activities with some understanding, but struggles to activate prior knowledge or use context clues effectively.","Student actively participates in group reading activities and demonstrates a basic understanding of the text. Can activate some prior knowledge and use context clues to make simple predictions.","Student actively engages in group reading activities with purpose and understanding. Effectively activates prior knowledge and uses context clues to make relevant predictions about the text.","Student skillfully engages in group reading activities, consistently demonstrating a deep understanding of the text. Masterfully activates prior knowledge and uses illustrations and context to make insightful predictions that enhance comprehension."],["Student does not attempt to connect prior knowledge to the text or use illustrations\/context for predictions.","Student makes a minimal attempt to connect prior knowledge or use context, but the connection is unclear or inaccurate.","Student inconsistently connects prior knowledge to the text or uses illustrations\/context for predictions, with limited success.","Student connects relevant prior knowledge to the text and uses illustrations\/context to make predictions, but the connections are not always clear or fully developed.","Student effectively connects prior knowledge to the text and uses illustrations\/context to make logical and insightful predictions that enhance understanding.","Student expertly connects prior knowledge to the text, drawing on a wide range of experiences and information. Uses illustrations\/context to formulate sophisticated and accurate predictions, demonstrating a comprehensive understanding of the material."]]}