{"criteria":["Understanding of Literary Terms and Devices","Identification and Explanation of Key Details and Evidence","Analysis and Interpretation of Text"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of literary terms or devices.","Student demonstrates minimal understanding of literary terms or devices, with frequent inaccuracies.","Student demonstrates a basic understanding of literary terms and devices, but struggles to apply them correctly.","Student demonstrates a satisfactory understanding of literary terms and devices, applying them with some accuracy.","Student demonstrates a strong understanding of literary terms and devices, applying them accurately and effectively.","Student demonstrates a comprehensive understanding of literary terms and devices, applying them insightfully and creatively."],["Student does not identify any key details or evidence from the text.","Student identifies very few key details or evidence from the text, often inaccurately.","Student identifies some key details or evidence from the text, but struggles to explain their relevance.","Student identifies key details and evidence from the text and explains their relevance with some clarity.","Student identifies key details and evidence from the text and explains their relevance clearly and effectively.","Student identifies key details and evidence from the text and explains their relevance insightfully, demonstrating a deep understanding of the text."],["Student provides no analysis or interpretation of the text.","Student provides minimal analysis or interpretation of the text, with frequent inaccuracies.","Student provides a basic analysis or interpretation of the text, but struggles to support it with evidence.","Student provides a satisfactory analysis or interpretation of the text, supporting it with some evidence.","Student provides a strong analysis or interpretation of the text, supporting it with relevant evidence and clear reasoning.","Student provides an insightful and original analysis or interpretation of the text, demonstrating a deep understanding of its themes and ideas."]]}