{"criteria":["Identification of Information from Different Sources","Comparison and Contrast of Information","Understanding of Topic Across Multiple Mediums"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any relevant information from either the text or the multimedia source.","The student identifies minimal information from only one source (either text or multimedia).","The student identifies some information from both sources but struggles to accurately represent the core ideas.","The student accurately identifies key information from both sources, demonstrating a basic understanding of each.","The student clearly and accurately identifies significant information from both sources, showing a good grasp of core ideas.","The student skillfully identifies essential information from both sources, demonstrating a comprehensive and nuanced understanding."],["The student makes no attempt to compare or contrast the information from the two sources.","The student attempts to compare\/contrast, but the effort is superficial and lacks relevant connections.","The student identifies a few similarities or differences, but the analysis is limited and somewhat unclear.","The student identifies several similarities and differences, demonstrating a basic ability to compare and contrast.","The student provides a clear and organized comparison and contrast, highlighting key similarities and differences with supporting details.","The student offers a thorough, insightful comparison and contrast, revealing subtle nuances and drawing well-supported conclusions about the information presented in each source."],["The student's response indicates no understanding of the topic.","The student demonstrates a very limited understanding of the topic, primarily focusing on surface-level details.","The student demonstrates a partial understanding of the topic, but struggles to connect information between the sources.","The student demonstrates a satisfactory understanding of the topic, synthesizing information from both sources to form a coherent understanding.","The student demonstrates a strong understanding of the topic, providing a comprehensive and well-integrated analysis of the information presented in both sources.","The student demonstrates an exceptional and insightful understanding of the topic, expertly synthesizing information from both sources to form a nuanced and original perspective."]]}