{"criteria":["Identification of Textual Evidence","Quality of Analysis","Clarity and Precision of Citations"],"points":[0,1,2,3,4,5],"descriptions":[["No attempt to cite textual evidence is made, or the evidence provided is completely irrelevant.","Attempts to cite textual evidence are made, but the citations are vague, inaccurate, or do not support the analysis.","Some textual evidence is cited, but the connection to the analysis is weak or requires significant interpretation.","Relevant textual evidence is cited to support the analysis, but the explanation of the evidence's significance is superficial.","Specific and relevant textual evidence is cited to effectively support the analysis. The significance of the evidence is clearly explained.","Precise and compelling textual evidence is seamlessly integrated to provide a nuanced and insightful analysis. The evidence's significance is thoroughly and thoughtfully explained."],["No analysis of the text is presented, or the analysis is entirely illogical and unsupported.","The analysis is superficial, merely restating the text without providing meaningful interpretation.","The analysis shows some understanding of the text, but lacks depth and critical thinking.","The analysis is generally sound and demonstrates a reasonable understanding of the text's complexities.","The analysis is insightful, demonstrating a strong understanding of the text's nuances and complexities.","The analysis is exceptionally insightful and original, offering a profound and nuanced interpretation of the text that demonstrates independent and critical thinking."],["Citations are missing or entirely unclear, making it impossible to verify the evidence.","Citations are present but inaccurate or incomplete, hindering the reader's ability to locate the evidence.","Citations are generally accurate but may lack precision or specific details (e.g., page numbers).","Citations are accurate and include necessary details for locating the evidence, but may lack consistency in formatting.","Citations are accurate, precise, and consistently formatted, allowing the reader to easily locate the evidence.","Citations are flawlessly executed, demonstrating meticulous attention to detail and adherence to a specific citation style (e.g., MLA, APA)."]]}