{"criteria":["Reading Comprehension: Ability to accurately understand and interpret the main ideas and supporting details in science\/technical texts.","Text Complexity: Ability to navigate and extract meaning from texts within the grades 6-8 complexity band.","Independence and Proficiency: Ability to read and comprehend texts independently and at a proficient level."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of the text; unable to identify main ideas or supporting details.","Struggles to understand the text; misinterprets main ideas and supporting details.","Shows some understanding of the text; identifies main ideas but misses some supporting details or misinterprets their significance.","Understands the main ideas and most supporting details of the text with minor inaccuracies.","Demonstrates a strong understanding of the text; accurately interprets main ideas and supporting details and their relationships.","Demonstrates a comprehensive and insightful understanding of the text; accurately interprets main ideas and supporting details, and can infer deeper meanings or implications."],["Unable to engage with the text due to its complexity; demonstrates no strategies for understanding complex vocabulary or sentence structures.","Struggles significantly with the text's complexity; relies heavily on external support to understand basic elements.","Shows some ability to navigate the text's complexity with occasional difficulty; can identify some key terms and structures with support.","Navigates the text's complexity with moderate success; understands most key terms and structures and uses context clues to aid comprehension.","Confidently navigates the text's complexity; demonstrates effective strategies for understanding challenging vocabulary and sentence structures.","Masterfully navigates the text's complexity; demonstrates sophisticated strategies for understanding nuances and subtleties in language and structure."],["Unable to read and comprehend the text independently; requires constant support and demonstrates no proficiency.","Requires significant support to read and comprehend the text; demonstrates very limited proficiency.","Reads and comprehends the text with some support; demonstrates developing proficiency.","Reads and comprehends the text mostly independently; demonstrates adequate proficiency.","Reads and comprehends the text independently and proficiently; demonstrates a strong command of reading skills.","Reads and comprehends the text independently and with exceptional proficiency; demonstrates mastery of reading skills and a deep understanding of the material."]]}