{"criteria":["Identification of Central Ideas","Accuracy and Objectivity of Summary","Clarity and Coherence of Presentation"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to identify any central ideas or conclusions from the text.","Identifies a central idea, but it is vague or incomplete.  Demonstrates a misunderstanding of the text's main points.","Identifies a central idea, but the conclusion is missing or inaccurate. Struggles to grasp the essence of the text.","Identifies the main central idea of the text, but explanation is basic. Conclusion is present but lacks depth or connection to the central idea.","Clearly identifies the central idea and conclusion of the text. Explanation is accurate and reflects a good understanding of the source material.","Masterfully identifies the nuanced central ideas and conclusions. Demonstrates a comprehensive understanding with insightful observations."],["Summary is missing or completely inaccurate. Over-relies on prior knowledge or opinions.","Provides a summary with significant inaccuracies or distortions.  Heavily influenced by prior knowledge or personal opinions.","Summary contains some inaccuracies or irrelevant details. Prior knowledge or opinions are noticeable and detract from objectivity.","Provides a generally accurate summary with minor omissions or tangential details.  Attempts to separate prior knowledge but some influence is present.","Provides an accurate and concise summary, clearly distinct from prior knowledge or personal opinions. Demonstrates good objectivity.","Provides an exceptionally accurate and succinct summary, completely free of personal bias or prior assumptions.  Demonstrates exemplary objectivity and focus on the source material."],["The summary is incomprehensible and lacks any organization.","The summary is poorly organized and difficult to follow. Ideas are presented in a disjointed manner.","The summary lacks a clear structure and coherence. Transitions between ideas are weak.","The summary is generally clear and organized, but there are some lapses in coherence.","The summary is clearly and logically organized, with smooth transitions between ideas.","The summary is exceptionally clear, concise, and logically structured, enhancing the understanding of the source material."]]}