{"criteria":["Identification of the text's organizational structure","Explanation of how sections contribute to the whole","Analysis of how structure enhances understanding of the topic"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify any organizational structure within the text.","The student attempts to identify the organizational structure, but the attempt is inaccurate or incomplete.","The student identifies a basic organizational structure (e.g., chronological order) but does not elaborate.","The student accurately identifies the main organizational structure used by the author.","The student identifies the organizational structure and provides some explanation of its use and effect.","The student thoroughly identifies and explains the organizational structure, including how it shapes the text's meaning and impact."],["The student does not explain how individual sections relate to the text as a whole.","The student attempts to describe the relationship between sections and the whole, but the explanation is vague or inaccurate.","The student offers a limited explanation of how one or two sections relate to the overall text.","The student explains how multiple sections contribute to the text's overall message or argument.","The student clearly explains how each major section contributes to the text's central idea and development.","The student provides a nuanced explanation of how each section intricately contributes to the whole, demonstrating a deep understanding of the text's construction."],["The student fails to connect the text's structure to its understanding of the topic.","The student attempts to connect structure and understanding but offers superficial or incorrect reasoning.","The student makes a basic connection between the structure and understanding of the topic.","The student analyzes how the organizational structure helps clarify or emphasize key aspects of the topic.","The student provides a well-reasoned analysis of how the structure enhances the reader's understanding of the topic, providing specific examples.","The student offers a sophisticated analysis of how the author's structural choices profoundly shape the reader's understanding of the topic, discussing subtleties and implications."]]}