{"criteria":["Identification of Facts","Recognition of Reasoned Judgment","Discernment of Speculation","Differentiation Among Information Types"],"points":[0,1,2,3,4,5],"descriptions":[["The student cannot identify any facts within the text or provides inaccurate information.","The student identifies a few facts but struggles to differentiate them from other types of information.","The student identifies some facts within the text, but with some inaccuracies or omissions.","The student correctly identifies most of the facts presented in the text.","The student accurately identifies nearly all facts within the text, demonstrating a strong understanding of factual information.","The student flawlessly identifies all facts within the text, demonstrating a comprehensive understanding of factual information and its role in the text."],["The student does not recognize or incorrectly identifies instances of reasoned judgment based on research findings.","The student shows limited ability to recognize reasoned judgment, confusing it with personal opinion or speculation.","The student identifies some instances of reasoned judgment but struggles to explain the basis of the reasoning.","The student correctly recognizes most instances of reasoned judgment and can partially explain the research findings supporting them.","The student accurately recognizes reasoned judgment and explains the research findings that support the judgment.","The student expertly recognizes reasoned judgment, thoroughly explaining the research findings and how they logically support the conclusions."],["The student fails to identify speculation in the text, possibly mistaking it for fact or reasoned judgment.","The student shows difficulty in distinguishing speculation from other types of information in the text.","The student identifies some instances of speculation but may misinterpret their significance or basis.","The student correctly identifies most instances of speculation and understands that it is not based on concrete evidence.","The student accurately discerns speculation and can explain why it is speculative rather than factual or reasoned.","The student masterfully identifies speculation, thoroughly explaining its hypothetical nature and lack of empirical support."],["The student shows no ability to differentiate among facts, reasoned judgment, and speculation, treating all information as equivalent.","The student struggles to differentiate among the types of information, often confusing one with another.","The student makes some attempts to differentiate but demonstrates inconsistent understanding of the distinctions.","The student effectively differentiates among facts, reasoned judgment, and speculation for the most part, with minor inconsistencies.","The student clearly and accurately differentiates among facts, reasoned judgment, and speculation, demonstrating a strong understanding of their differences.","The student flawlessly differentiates among facts, reasoned judgment, and speculation, demonstrating an exceptional command of analytical skills."]]}