{"criteria":["Identification of Author's Purpose","Explanation of Author's Choices","Use of Textual Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not identify the author's purpose or provides an inaccurate identification.","The student attempts to identify the author's purpose but struggles to provide a clear or accurate response.","The student identifies a possible author's purpose but provides limited explanation or support.","The student identifies the author's purpose and provides a somewhat clear explanation, but the analysis lacks depth.","The student accurately identifies the author's purpose and provides a clear explanation with supporting details from the text.","The student skillfully identifies the author's purpose, providing a comprehensive and insightful analysis with strong textual evidence."],["The student does not explain how the author's choices contribute to the purpose.","The student attempts to explain the author's choices but struggles to connect them to the overall purpose.","The student offers a superficial explanation of how some author's choices relate to the purpose.","The student provides a satisfactory explanation of how several author's choices contribute to the purpose, with some supporting examples.","The student thoroughly explains how specific author's choices contribute to the purpose, providing relevant textual evidence.","The student provides a nuanced and insightful explanation of how the author's choices work together to achieve the intended purpose, demonstrating a sophisticated understanding of rhetorical strategies."],["The student provides no textual evidence to support their analysis.","The student attempts to provide textual evidence, but it is irrelevant or inaccurate.","The student provides minimal textual evidence, which is weakly connected to the analysis.","The student provides some textual evidence to support their analysis, but it may be limited or not fully explained.","The student effectively uses relevant textual evidence to support their analysis, with clear explanations of its significance.","The student skillfully integrates ample and compelling textual evidence to support a thorough and insightful analysis, demonstrating a strong command of the text."]]}