{"criteria":["Understanding of Symbols and Key Terms","Application of Domain-Specific Vocabulary","Contextual Interpretation"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of symbols or key terms in the text.","Student shows minimal understanding of symbols or key terms; interpretation is largely inaccurate.","Student identifies some symbols or key terms but struggles to explain their meaning within the scientific\/technical context.","Student can identify and explain the meaning of most symbols and key terms, but explanation lacks depth or connection to the broader context.","Student demonstrates a strong understanding of symbols and key terms, explaining their meaning and relevance to the scientific\/technical context effectively.","Student exhibits a comprehensive understanding of symbols and key terms, providing insightful explanations of their meaning and significance within the specific scientific or technical context."],["Student does not use or understand domain-specific vocabulary.","Student attempts to use domain-specific vocabulary, but usage is incorrect or inappropriate.","Student uses some domain-specific vocabulary correctly, but struggles with more complex terms or phrases.","Student uses domain-specific vocabulary appropriately in most cases, demonstrating a basic understanding of their meaning.","Student effectively uses domain-specific vocabulary, demonstrating a strong command of relevant terms and phrases.","Student demonstrates masterful use of domain-specific vocabulary, using terms and phrases precisely and effectively to enhance understanding of the scientific or technical content."],["Student is unable to determine meaning from context.","Student's interpretation is not related to the specific scientific or technical context.","Student attempts to interpret meaning within the context but struggles to connect terms\/symbols to the overall text.","Student generally interprets meaning within the context of the text, showing a connection between the terms\/symbols and the main topic.","Student effectively interprets meaning within the specific scientific or technical context, supporting their interpretations with evidence from the text.","Student expertly interprets meaning within the context, providing nuanced and insightful explanations that demonstrate a deep understanding of the scientific or technical material."]]}