{"criteria":["Accuracy in Following Procedures","Precision in Measurements","Completeness of Task Performance"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not follow the procedure or makes significant errors that invalidate the results.","The student attempts to follow the procedure but makes several critical errors, leading to inaccurate results.","The student follows most of the procedure but makes a few noticeable errors that affect the accuracy of the results.","The student follows the procedure with minor errors that do not significantly impact the results.","The student follows the procedure accurately with only very minor deviations, ensuring reliable results.","The student meticulously and accurately follows the procedure, demonstrating a thorough understanding and ensuring precise results."],["Measurements are not taken, or are completely inaccurate and lack units.","Measurements are taken but are highly imprecise and\/or lack appropriate units, showing a misunderstanding of measurement principles.","Measurements are somewhat precise but contain errors or inconsistencies, and units may be missing or incorrect.","Measurements are generally precise with minor inconsistencies, and units are mostly correct.","Measurements are precise and consistently recorded with correct units, demonstrating a good understanding of measurement techniques.","Measurements are exceptionally precise, consistently recorded with correct units, and demonstrate a mastery of measurement techniques, including error analysis when appropriate."],["The student does not attempt the technical task or abandons it before completion.","The student attempts the technical task but fails to complete essential steps, resulting in a largely unfinished product.","The student completes some parts of the technical task, but significant steps are missing or incomplete.","The student completes most of the technical task, but some minor steps are omitted or not fully executed.","The student completes the technical task thoroughly, with only very minor omissions or imperfections.","The student completes the technical task meticulously and comprehensively, demonstrating a strong attention to detail and mastery of the required steps."]]}