{"criteria":["Relevance and clarity of questions asked and answers provided in relation to the speaker's message.","Demonstration of active listening skills and engagement with the speaker.","Clarity and organization of questions and answers."],"points":[0,1,2,3,4,5],"descriptions":[["Student does not attempt to ask or answer questions related to the speaker's message.","Student attempts to ask or answer questions, but the questions are irrelevant or demonstrate a lack of understanding of the speaker's message.","Student asks or answers simple questions that are somewhat related to the speaker's message, but they do not seek clarification or additional information effectively.","Student asks or answers questions that are generally relevant to the speaker's message, showing some effort to gather additional information or clarify misunderstandings.","Student asks and answers thoughtful questions that are clearly related to the speaker's message, successfully gathering additional information or clarifying most misunderstandings.","Student consistently asks and answers insightful questions that demonstrate a deep understanding of the speaker's message, effectively gathering additional information and clarifying any nuanced or complex misunderstandings."],["Student does not demonstrate any active listening skills or engagement with the speaker.","Student shows minimal signs of active listening, such as occasional eye contact or nodding, but does not verbally engage or seek clarification.","Student displays some active listening skills, such as maintaining eye contact and nodding, but rarely asks clarifying questions or provides relevant answers.","Student actively listens to the speaker, demonstrates engagement through non-verbal cues, and occasionally asks clarifying questions or provides relevant answers.","Student consistently demonstrates active listening skills, maintains strong engagement with the speaker, and frequently asks clarifying questions or provides relevant and thoughtful answers.","Student actively listens with exceptional focus, demonstrating deep engagement with the speaker, and consistently asks insightful questions or provides comprehensive and nuanced answers that enhance understanding for themselves and others."],["Student's questions and answers are unclear, disorganized, or difficult to understand.","Student's questions and answers lack clarity and organization, making it challenging to follow their line of reasoning.","Student's questions and answers are somewhat clear and organized, but there are instances of confusion or lack of coherence.","Student's questions and answers are generally clear and organized, making it relatively easy to understand their points and reasoning.","Student's questions and answers are clear, well-organized, and easy to understand, demonstrating effective communication skills.","Student's questions and answers are exceptionally clear, concise, and logically organized, demonstrating mastery of communication skills and enhancing the overall understanding of the topic."]]}