{"criteria":["Memorization and Recitation Accuracy","Emotional Expression","Clarity and Enunciation"],"points":[0,1,2,3,4,5],"descriptions":[["The student is unable to recite the poem, rhyme, or song.","The student attempts to recite the poem, rhyme, or song, but struggles significantly with memorization and clarity.","The student recites the poem, rhyme, or song with limited accuracy and minimal expression.","The student recites the poem, rhyme, or song with reasonable accuracy, showing some expression in their delivery.","The student recites the poem, rhyme, or song accurately and with noticeable expression, engaging the audience effectively.","The student recites the poem, rhyme, or song flawlessly, demonstrating a strong command of the material and captivating the audience with their expressive delivery."],["The student's delivery lacks any discernible emotional connection to the material.","The student's delivery shows a limited attempt to convey emotions, but it is not convincing or impactful.","The student's delivery conveys some emotions, but it is inconsistent and not fully developed.","The student's delivery expresses emotions appropriately, enhancing the meaning of the poem, rhyme, or song.","The student's delivery is emotionally engaging, creating a deeper connection with the audience.","The student's delivery is deeply moving and emotionally resonant, demonstrating a profound understanding of the material and its emotional nuances."],["The student's enunciation is unclear, making it difficult to understand the recitation.","The student's enunciation is often unclear, hindering comprehension of the recitation.","The student's enunciation is generally understandable, but there are occasional lapses in clarity.","The student's enunciation is clear and easily understandable throughout the recitation.","The student's enunciation is exceptionally clear and precise, enhancing the overall impact of the performance.","The student's enunciation is impeccable, demonstrating a mastery of articulation and contributing to a flawless performance."]]}