{"criteria":["Clarity of Questions: Assesses how well the student formulates questions to seek clarification.","Relevance and Depth of Information Gathered: Assesses the student's ability to extract meaningful information from the speaker.","Evidence of Active Listening: Assesses the student's engagement with the speaker and the material presented."],"points":[0,1,2,3,4,5],"descriptions":[["Questions are unclear, irrelevant, or do not address the speaker's content.","Questions are often vague and occasionally relate to the speaker's content, but do not significantly clarify comprehension.","Questions are somewhat clear and mostly relevant, attempting to clarify understanding but may lack depth.","Questions are generally clear, relevant, and aimed at clarifying specific points, demonstrating a basic understanding of the presentation.","Questions are clear, concise, and insightful, effectively clarifying key aspects of the presentation and demonstrating a solid understanding of the topic.","Questions are exceptionally clear, incisive, and demonstrate a deep understanding of the nuances of the presentation, pushing the speaker to explore deeper insights."],["No relevant information is gathered; student shows no understanding of the presentation's content.","Little to no new information is gathered; student struggles to connect questions to the presentation's main points.","Some relevant information is gathered, but lacks depth and does not significantly enhance understanding.","Relevant information is gathered, providing a moderate level of understanding of the topic or issue.","Relevant and insightful information is gathered, significantly deepening understanding of the topic and demonstrating critical engagement.","Information gathered is exceptionally insightful, revealing a comprehensive understanding of the topic and demonstrating the ability to synthesize new knowledge effectively."],["No evidence of active listening; student appears disengaged or inattentive.","Minimal evidence of active listening; student struggles to connect questions to the speaker's statements.","Some evidence of active listening; student occasionally refers back to the speaker's points.","Demonstrates active listening through follow-up questions and comments; student engages with the speaker's ideas.","Demonstrates consistent active listening; student builds upon the speaker's points and makes insightful connections.","Demonstrates exceptional active listening; student anticipates the speaker's points and offers profound insights that advance the discussion."]]}