{"criteria":["Clarity and Completeness of Sentences","Appropriateness to Task and Situation"],"points":[0,1,2,3,4,5],"descriptions":[["Sentences are incomplete, fragmented, or incomprehensible, making it impossible to understand the student's ideas.","Sentences are frequently incomplete or unclear, significantly hindering comprehension and requiring substantial effort to understand the intended meaning.","Sentences are occasionally incomplete or unclear, causing some difficulty in understanding the student's ideas. Detail and clarification are lacking.","Sentences are mostly complete and clear, but some may lack detail or require minor clarification. The student generally provides requested information.","Sentences are complete, clear, and provide sufficient detail and clarification for the task and situation. The student effectively communicates their ideas.","Sentences are exceptionally clear, complete, and detailed, demonstrating a sophisticated command of language and enhancing the overall quality of communication. The student anticipates the needs of the audience and provides insightful clarification."],["Sentences are completely inappropriate for the task and situation, showing no awareness of the intended audience or purpose.","Sentences are largely inappropriate for the task and situation, indicating a limited understanding of the context and failing to meet the basic requirements.","Sentences are sometimes inappropriate for the task and situation, demonstrating a partial understanding of the context but lacking consistency in application.","Sentences are generally appropriate for the task and situation, showing a good understanding of the context and meeting most of the requirements.","Sentences are consistently appropriate for the task and situation, demonstrating a strong understanding of the context and effectively fulfilling the intended purpose.","Sentences are exceptionally appropriate for the task and situation, demonstrating a nuanced understanding of the context and exceeding expectations in fulfilling the intended purpose. The student shows mastery of the English language."]]}