{"criteria":["Clarity and Audibility","Factual Accuracy and Relevance","Descriptive Detail","Coherence and Sequencing","Narrative Structure and Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["The speaker is inaudible and\/or the message is incomprehensible.","The speaker is difficult to hear or understand; mumbling or low volume significantly impairs clarity.","The speaker is sometimes difficult to hear or understand; volume and enunciation need improvement.","The speaker is generally clear and audible; minor improvements in volume or enunciation could enhance clarity.","The speaker is clear and audible throughout the presentation; good volume and enunciation.","The speaker is exceptionally clear, audible, and engaging, demonstrating excellent command of vocal projection and enunciation."],["The story includes inaccurate facts and irrelevant details that detract from the narrative.","The story contains some factual inaccuracies or irrelevant details that confuse the narrative.","The story includes mostly accurate facts and relevant details, but some inaccuracies or irrelevancies are present.","The story presents accurate facts and relevant details that support the narrative.","The story presents accurate facts and relevant details that enhance the narrative and provide a clear understanding of the experience.","The story presents meticulously accurate facts and highly relevant, descriptive details that create a vivid and insightful portrayal of the experience."],["The story lacks descriptive details, making it difficult to visualize or understand the experience.","The story includes minimal descriptive details; more sensory language is needed.","The story includes some descriptive details, but they are not consistently used throughout the narrative.","The story includes adequate descriptive details that help to paint a picture of the experience.","The story includes rich and vivid descriptive details that bring the experience to life for the listener.","The story masterfully uses descriptive details to create a fully immersive and emotionally resonant experience for the listener."],["The story lacks coherence and a logical sequence, making it difficult to follow.","The story is somewhat disjointed and lacks a clear sequence of events.","The story generally follows a logical sequence, but some transitions are unclear or abrupt.","The story is coherent and follows a logical sequence of events with clear transitions.","The story is highly coherent and follows a seamless logical sequence, enhancing the overall impact.","The story is flawlessly coherent, with a masterful command of sequencing that draws the listener in and maintains their engagement throughout."],["The presentation lacks a clear beginning, middle, and end; no conclusion is present.","The presentation has a vague beginning, middle, or end; the conclusion is weak or missing.","The presentation includes a discernible beginning, middle, and end, but the conclusion could be stronger.","The presentation is well-structured with a clear beginning, middle, and end; the conclusion provides closure.","The presentation is exceptionally well-structured, with a compelling beginning, engaging middle, and satisfying conclusion that reinforces the narrative's impact.","The presentation demonstrates a masterful command of narrative structure, captivating the audience from beginning to end with a thought-provoking and memorable conclusion."]]}