{"criteria":["Adherence to Discussion Rules","Building on Others' Talk","Seeking Clarification and Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of discussion rules and consistently interrupts or dominates the conversation.","Student shows limited understanding of discussion rules, occasionally interrupting or speaking out of turn.","Student generally follows discussion rules, but occasionally struggles to gain the floor appropriately or listen attentively.","Student consistently follows discussion rules, gaining the floor respectfully and listening attentively to others.","Student expertly follows discussion rules, demonstrating exceptional awareness of others' contributions and maintaining a respectful tone.","Student not only follows discussion rules flawlessly but also actively encourages others to participate and ensures a respectful environment."],["Student fails to connect their comments to the remarks of others, speaking off-topic or irrelevant information.","Student attempts to build on others' talk, but struggles to make meaningful connections or provide relevant information.","Student occasionally builds on others' talk, but the connections are weak or superficial.","Student effectively builds on others' talk by linking their comments to previous remarks and adding relevant information.","Student skillfully builds on others' talk, offering insightful connections and expanding on previous ideas with clarity and depth.","Student masterfully builds on others' talk, synthesizing information from multiple sources and generating new perspectives on the topic."],["Student never seeks clarification or explanation, even when confused or unsure about the topics and texts under discussion.","Student rarely seeks clarification or explanation, and may remain confused or misinformed about key concepts.","Student occasionally asks for clarification or explanation, but may hesitate to admit confusion or uncertainty.","Student regularly asks for clarification and explanation when needed, demonstrating a willingness to learn and understand complex concepts.","Student proactively asks for clarification and explanation, anticipating potential areas of confusion and seeking deeper understanding.","Student consistently seeks clarification and explanation, demonstrating exceptional curiosity and a commitment to mastering the topics and texts under discussion."]]}