{"criteria":["Clarity and Pace of Speech","Organization and Logical Sequence","Use of Supporting Details and Evidence","Vocabulary and Language Use","Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["Speech is incomprehensible; pace is either too fast or too slow to follow.","Speech is often unclear; pace is either too fast or too slow in several instances.","Speech is somewhat clear; pace is generally appropriate but with occasional issues.","Speech is mostly clear and understandable; pace is generally well-maintained.","Speech is clear and easily understood; pace is appropriate and engaging.","Speech is exceptionally clear and articulate; pace is perfectly suited to the content and audience."],["Presentation lacks organization and logical sequence; ideas are presented randomly.","Presentation shows minimal organization; sequence is difficult to follow.","Presentation has some organization, but the logical sequence is weak or inconsistent.","Presentation is generally well-organized with a mostly logical sequence of ideas.","Presentation is well-organized with a clear and logical sequence that enhances understanding.","Presentation is exceptionally well-organized, demonstrating a sophisticated understanding of logical sequencing; ideas flow seamlessly."],["Presentation lacks supporting details and evidence.","Presentation includes very few supporting details; evidence is weak or irrelevant.","Presentation includes some supporting details, but they are not always relevant or convincing.","Presentation includes relevant supporting details that generally support the main points.","Presentation effectively uses supporting details and evidence to strengthen the main points.","Presentation masterfully integrates compelling supporting details and evidence, creating a highly persuasive and informative argument."],["Vocabulary is limited, inaccurate, or inappropriate for the topic.","Vocabulary is basic and sometimes inaccurate; language is unclear or confusing.","Vocabulary is adequate but lacks precision; language is sometimes unclear.","Vocabulary is appropriate and generally clear; language is mostly precise.","Vocabulary is precise and varied; language is clear, concise, and engaging.","Vocabulary is sophisticated and precise; language is eloquent, compelling, and enhances the presentation's impact."],["Presentation lacks a conclusion.","Conclusion is abrupt, confusing, or unrelated to the presentation.","Conclusion is weak and does not effectively summarize the main points.","Conclusion summarizes the main points but lacks impact.","Conclusion effectively summarizes the main points and provides a sense of closure.","Conclusion is memorable, insightful, and leaves a lasting impression on the audience."]]}