{"criteria":["Clarity and Completeness of Sentences","Appropriateness to Task and Situation","Provision of Requested Detail and Clarification"],"points":[0,1,2,3,4,5],"descriptions":[["Sentences are fragmented, incomplete, or incomprehensible, lacking necessary details or clarity.","Sentences are frequently incomplete or unclear, making it difficult to understand the intended meaning. Details are missing or confusing.","Sentences are sometimes incomplete or lack clarity, requiring effort to understand the message. Some details are provided, but they may not always be relevant or sufficient.","Sentences are generally complete and clear, providing adequate detail for the task and situation. Minor instances of ambiguity or incompleteness may be present.","Sentences are consistently complete, clear, and well-structured, effectively conveying detailed information. Language is precise and appropriate for the context.","Sentences are exceptionally clear, complete, and articulate, demonstrating a sophisticated command of language. Details are thorough, relevant, and enhance understanding."],["Response demonstrates no awareness of the task or situation, with language use being entirely inappropriate.","Response shows minimal awareness of the task or situation. Language is often inappropriate or ineffective for the intended purpose.","Response demonstrates some awareness of the task and situation, but language choices may not always be suitable or effective.","Response is generally appropriate for the task and situation, with language choices mostly aligned with the intended purpose and audience.","Response is consistently appropriate for the task and situation, demonstrating a strong understanding of context and audience. Language is used effectively to achieve the desired outcome.","Response is exceptionally tailored to the task and situation, demonstrating a nuanced understanding of context, audience, and purpose. Language choices are highly effective and impactful."],["Fails to provide requested detail or clarification, leaving questions unanswered or misunderstandings unresolved.","Provides minimal detail or clarification, which is often insufficient or irrelevant to the request.","Provides some detail and clarification, but may not fully address the request or resolve potential misunderstandings.","Provides adequate detail and clarification, generally addressing the request and resolving potential misunderstandings.","Provides thorough and relevant detail and clarification, effectively addressing the request and anticipating potential misunderstandings.","Provides exceptionally detailed and insightful clarification, exceeding expectations in addressing the request and preventing misunderstandings. Demonstrates proactive and thoughtful communication."]]}