{"criteria":["Clarity and Relevance of Questions","Quality of Answers","Elaboration and Detail","Active Listening and Engagement"],"points":[0,1,2,3,4,5],"descriptions":[["Questions are unclear, irrelevant, or missing.","Questions are sometimes unclear or slightly irrelevant.","Questions are generally clear and relevant but may lack depth.","Questions are clear, relevant, and demonstrate understanding of the speaker's information.","Questions are insightful, relevant, and show a deep understanding of the speaker's information, prompting further discussion.","Questions are exceptionally insightful, relevant, and strategically designed to advance understanding and discussion."],["Answers are absent, incorrect, or do not address the question.","Answers are incomplete, vague, or partially address the question.","Answers are mostly correct but lack detail or elaboration.","Answers are accurate, provide sufficient detail, and address the question effectively.","Answers are thorough, well-supported, and offer insightful elaboration.","Answers are exceptionally comprehensive, insightful, and demonstrate a mastery of the subject matter with compelling elaboration."],["No elaboration or detail is provided.","Minimal elaboration or detail is provided.","Some elaboration and detail are provided but may be superficial.","Appropriate elaboration and detail are provided to support understanding.","Significant elaboration and detail are provided, enhancing understanding and offering additional insights.","Extensive and insightful elaboration and detail are provided, demonstrating a comprehensive understanding and enriching the discussion."],["Student does not appear to be actively listening or engaged.","Student shows minimal signs of active listening or engagement.","Student occasionally demonstrates active listening and engagement.","Student consistently demonstrates active listening and engagement through appropriate verbal and non-verbal cues.","Student actively listens, engages, and encourages others to participate in the discussion.","Student expertly facilitates discussion through active listening, insightful questions, and inclusive engagement strategies."]]}