{"criteria":["Preparation for Discussion","Following Discussion Rules","Questioning and Clarification","Explaining Ideas and Understanding"],"points":[0,1,2,3,4,5],"descriptions":[["Student shows no evidence of preparation. Did not read or study the required material.","Student is minimally prepared, showing little evidence of having read or studied the material. Struggles to contribute meaningfully.","Student shows some preparation, referencing the material occasionally. Contribution to the discussion is limited.","Student is generally well-prepared, referencing the material and contributing relevant ideas. Could expand on connections to the text.","Student is well-prepared, demonstrating a strong understanding of the material. Actively uses the preparation to explore ideas in discussion.","Student is exceptionally well-prepared, demonstrating a comprehensive understanding of the material. Skillfully uses preparation to drive the discussion forward with insightful ideas."],["Student consistently violates discussion rules, interrupting others and dominating the conversation.","Student frequently violates discussion rules, struggling to listen respectfully and take turns speaking.","Student occasionally violates discussion rules, sometimes interrupting or speaking out of turn. Needs reminders to follow guidelines.","Student generally follows discussion rules, listening respectfully and taking turns speaking. Minor lapses may occur.","Student consistently follows discussion rules, actively listening and respecting the contributions of others.","Student skillfully facilitates discussion by encouraging others to participate, ensuring all voices are heard and respecting diverse perspectives."],["Student asks no questions and demonstrates no effort to clarify understanding. Appears disengaged from the discussion.","Student asks irrelevant or off-topic questions, demonstrating little effort to understand the material.","Student asks basic questions that show some effort to understand the information but does not connect to the remarks of others.","Student asks relevant questions to clarify understanding and stay on topic, occasionally linking comments to the remarks of others.","Student asks insightful questions that deepen understanding and promote further discussion, actively linking comments to the remarks of others.","Student skillfully uses questioning to guide the discussion, challenging assumptions, synthesizing information, and promoting a deeper understanding of the topic for all participants."],["Student offers no explanation of their own ideas and demonstrates no understanding of the discussion.","Student struggles to explain their own ideas and demonstrates minimal understanding of the discussion.","Student offers a limited explanation of their own ideas, with some connection to the discussion.","Student explains their own ideas and understanding clearly, relating them to the discussion.","Student explains their own ideas and understanding in a clear, coherent, and insightful manner, building on the ideas of others.","Student synthesizes their own ideas with those of others, offering a nuanced and comprehensive understanding of the topic that significantly enhances the discussion."]]}