{"criteria":["Pace and Fluency","Clarity and Pronunciation","Engagement and Expression","Use of Visuals (if applicable)"],"points":[0,1,2,3,4,5],"descriptions":[["Reading is halting and disjointed; pace is either too fast or too slow to understand.","Reading is slow and labored, with many pauses and hesitations; pace is inconsistent.","Reading is generally smooth, but there are some noticeable pauses or rushes in pace.","Reading is fluid and paced appropriately for the content, with only minor hesitations.","Reading is consistently smooth and well-paced, enhancing the listener's understanding and engagement.","Reading is exceptionally fluid and paced perfectly to capture the nuances of the text, creating a captivating listening experience."],["Pronunciation is consistently unclear, making it difficult to understand the recording.","Pronunciation is often unclear, with several mispronounced words that impede understanding.","Pronunciation is generally clear, but there are occasional mispronounced words or unclear articulation.","Pronunciation is clear and accurate, with good articulation of words and sounds.","Pronunciation is consistently clear and precise, enhancing the overall quality of the recording.","Pronunciation is impeccable, demonstrating a mastery of enunciation and creating a highly polished and professional recording."],["Recording is monotone and lacks expression, failing to engage the listener.","Recording has minimal expression, with little variation in tone or emphasis.","Recording shows some attempts at expression, but they are inconsistent or not fully effective.","Recording uses appropriate tone, emphasis, and emotion to enhance the listener's understanding and engagement.","Recording is highly engaging, with skillful use of expression to bring the text to life and captivate the listener.","Recording is a masterful performance, using a full range of vocal techniques to create a deeply immersive and emotional experience for the listener."],["No visuals are included, or visuals are completely irrelevant to the content.","Visuals are included, but they are poorly chosen or do not enhance the recording.","Visuals are somewhat relevant to the content, but their connection is not always clear.","Visuals are appropriate and help to clarify or emphasize certain facts or details.","Visuals are thoughtfully chosen and seamlessly integrated with the audio, enhancing the overall impact of the recording.","Visuals are exceptionally creative and effective, transforming the recording into a multimedia experience that deeply engages the audience."]]}