{"criteria":["Identification of Main Ideas","Recognition of Supporting Details","Comprehension Across Diverse Media and Formats"],"points":[0,1,2,3,4,5],"descriptions":[["Student is unable to identify the main idea of the text or presentation.","Student struggles to identify the main idea; response is vague or inaccurate.","Student identifies the main idea with some difficulty or provides a partially accurate response.","Student accurately identifies the main idea of the text or presentation.","Student clearly and accurately identifies the main idea and explains its significance.","Student masterfully identifies the main idea, explains its significance, and connects it to broader themes or contexts."],["Student fails to recognize any supporting details.","Student identifies few supporting details, and those identified are irrelevant or inaccurate.","Student identifies some supporting details, but their connection to the main idea is unclear.","Student identifies relevant supporting details that support the main idea.","Student identifies and explains the connection of supporting details to the main idea with clarity and accuracy.","Student expertly identifies, explains, and synthesizes supporting details, demonstrating a comprehensive understanding of their role in supporting the main idea."],["Student demonstrates no understanding of information presented in any media or format.","Student struggles to understand information presented in diverse media and formats.","Student understands information presented in some media and formats, but struggles with others.","Student demonstrates comprehension of information presented in diverse media and formats, including visual, quantitative, and oral.","Student effectively synthesizes information across diverse media and formats, demonstrating a strong understanding.","Student expertly synthesizes and analyzes information across diverse media and formats, drawing insightful conclusions and demonstrating a mastery of the material."]]}