{"criteria":["Accuracy of Paraphrase","Clarity and Conciseness","Use of Own Words","Comprehensiveness"],"points":[0,1,2,3,4,5],"descriptions":[["The paraphrase is completely inaccurate and does not reflect the original source material.","The paraphrase contains significant inaccuracies and demonstrates a poor understanding of the source material.","The paraphrase contains some inaccuracies and demonstrates a partial understanding of the source material.","The paraphrase is mostly accurate and demonstrates a good understanding of the source material, with minor errors.","The paraphrase is accurate and demonstrates a strong understanding of the source material, with only very minor or negligible errors.","The paraphrase is exceptionally accurate and demonstrates a comprehensive understanding of the source material, capturing nuances and subtleties effectively."],["The paraphrase is unclear, rambling, and difficult to understand.","The paraphrase lacks clarity and is overly wordy, making it difficult to grasp the main points.","The paraphrase is somewhat clear but could be more concise and focused.","The paraphrase is clear and concise, effectively conveying the main points of the source material.","The paraphrase is exceptionally clear, concise, and well-organized, making it easy to understand and follow.","The paraphrase is remarkably clear, concise, and elegantly summarizes the source material while maintaining accuracy."],["The paraphrase consists primarily of copied text from the original source without any attempt to use the student's own words.","The paraphrase relies heavily on the original source's wording with minimal use of the student's own words.","The paraphrase includes some use of the student's own words but still relies significantly on the original source's wording.","The paraphrase mostly uses the student's own words, with only occasional phrases or terms borrowed from the original source.","The paraphrase demonstrates a strong ability to rephrase the information using the student's own words and sentence structure.","The paraphrase showcases exceptional originality in rephrasing the information, demonstrating a masterful command of language and style."],["The paraphrase misses almost all of the key elements and ideas from the original presentation.","The paraphrase captures a few of the key elements and ideas from the original presentation.","The paraphrase captures some key elements, but misses others.","The paraphrase captures most of the key elements and ideas from the original presentation.","The paraphrase captures nearly all of the key elements and ideas from the original presentation.","The paraphrase captures all key elements with high level of detail."]]}