{"criteria":["Preparation for Discussion","Following Discussion Rules and Assigned Roles","Clarity and Relevance of Questions and Comments","Reviewing Key Ideas and Explaining Understanding"],"points":[0,1,2,3,4,5],"descriptions":[["Student comes to the discussion unprepared, showing no evidence of having read or studied the required material.","Student shows minimal preparation, with little evidence of having read or studied the required material.","Student is somewhat prepared, showing some evidence of having read or studied the required material, but lacks depth.","Student is generally prepared, showing a good understanding of the required material and drawing on it to explore ideas.","Student is well-prepared, thoroughly understanding the required material and effectively using it to contribute to the discussion.","Student is exceptionally well-prepared, demonstrating a deep understanding of the material and skillfully using it to enhance the discussion, offering insightful perspectives."],["Student consistently fails to follow agreed-upon rules for discussions and does not carry out assigned roles.","Student struggles to follow agreed-upon rules for discussions and inconsistently carries out assigned roles.","Student sometimes follows agreed-upon rules for discussions and attempts to carry out assigned roles, but with limited success.","Student generally follows agreed-upon rules for discussions and adequately carries out assigned roles.","Student consistently follows agreed-upon rules for discussions and effectively carries out assigned roles.","Student expertly follows agreed-upon rules for discussions, enhances group dynamics, and excels in assigned roles, demonstrating leadership and responsibility."],["Student's questions and comments are unclear, irrelevant, or disruptive to the discussion.","Student's questions and comments are often unclear or irrelevant, with minimal contribution to the discussion.","Student's questions and comments are sometimes clear and relevant, but lack depth or connection to others' remarks.","Student poses and responds to specific questions with reasonable clarity and relevance, contributing to the discussion and linking to others' remarks.","Student poses and responds to specific questions clearly and relevantly, contributing meaningfully to the discussion and effectively linking to others' remarks.","Student poses insightful and highly relevant questions, providing thoughtful responses that significantly enhance the discussion and create meaningful connections between ideas."],["Student fails to review key ideas expressed or explain their own understanding in light of the discussion.","Student struggles to review key ideas or explain their own understanding, showing minimal comprehension of the discussion.","Student attempts to review key ideas and explain their own understanding, but with limited clarity or accuracy.","Student adequately reviews key ideas expressed and explains their own understanding in light of the discussion.","Student clearly and accurately reviews key ideas expressed and explains their own understanding in light of the discussion, demonstrating good comprehension.","Student masterfully reviews key ideas expressed, provides insightful explanations of their own understanding, and synthesizes information from the discussion to form new perspectives."]]}