{"criteria":["Understanding of Formal vs. Informal Contexts","Appropriate Use of Formal English","Adaptability to Task and Situation"],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no understanding of when to use formal versus informal English.","Shows minimal understanding of the difference between formal and informal contexts; struggles to identify appropriate situations.","Identifies some differences between formal and informal contexts but has difficulty applying this understanding consistently.","Generally understands the difference between formal and informal contexts and can identify most appropriate situations.","Clearly understands and differentiates between formal and informal contexts, accurately identifying when each is appropriate.","Demonstrates a sophisticated understanding of formal and informal contexts and can explain the nuances of each with clarity and precision."],["Does not use formal English, even when the context requires it.","Attempts to use formal English but makes frequent errors in grammar, vocabulary, and tone.","Uses some elements of formal English but inconsistently and with noticeable errors.","Generally uses formal English appropriately in required contexts, with occasional lapses or minor errors.","Consistently uses formal English correctly and effectively in appropriate contexts.","Uses formal English with a high degree of skill and precision, demonstrating mastery of grammar, vocabulary, and tone to enhance communication."],["Shows no awareness of how to adapt language to the specific task or situation.","Struggles to adapt language to the task or situation; language choice is often inappropriate.","Demonstrates some awareness of the need to adapt language but struggles to do so effectively.","Generally adapts language to the task and situation, with some minor inconsistencies.","Effectively adapts language to the task and situation, demonstrating a strong command of language choices.","Masterfully adapts language to the task and situation, demonstrating a nuanced understanding of audience and purpose to maximize impact."]]}