{"criteria":["Identification of Reasons","Use of Evidence","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no understanding of the reasons provided by the speaker or media source.","The student struggles to identify any reasons provided by the speaker or media source.","The student identifies one or two reasons, but the explanation is vague or incomplete.","The student identifies some reasons provided by the speaker or media source with a basic explanation.","The student identifies most reasons provided by the speaker or media source with a clear explanation.","The student accurately identifies all reasons provided by the speaker or media source with a thorough and insightful explanation."],["The student demonstrates no understanding of the evidence provided by the speaker or media source.","The student struggles to identify any evidence provided by the speaker or media source.","The student identifies one or two pieces of evidence, but the connection to the speaker's points is unclear.","The student identifies some evidence provided by the speaker or media source and attempts to connect it to the points.","The student identifies most evidence provided by the speaker or media source and clearly connects it to the points.","The student accurately identifies all evidence provided by the speaker or media source and effectively connects it to the points, demonstrating a deep understanding of the material."],["The student's response is unclear, disorganized, and difficult to understand.","The student's response is somewhat unclear and disorganized, making it difficult to follow their reasoning.","The student's response is understandable but could be more clear and organized.","The student's response is generally clear and organized, but there may be some areas for improvement.","The student's response is clear, well-organized, and easy to follow.","The student's response is exceptionally clear, well-organized, and demonstrates a strong command of language and communication skills."]]}