{"criteria":["Organization and Structure","Use of Facts and Details","Clarity and Pace","Insight and Reflection (Narrative Element)"],"points":[0,1,2,3,4,5],"descriptions":[["The presentation lacks a clear organizational structure. Ideas are presented randomly with no discernible pattern.","The presentation has a weak organizational structure. Ideas are somewhat connected, but the overall flow is difficult to follow.","The presentation has a basic organizational structure. Most ideas are connected, but transitions may be weak or missing.","The presentation is generally well-organized with a clear structure. Ideas are logically connected with mostly smooth transitions.","The presentation is well-organized with a coherent structure. Ideas are logically connected with smooth and effective transitions.","The presentation is exceptionally well-organized with a compelling structure that enhances the message. Ideas are seamlessly connected with sophisticated transitions."],["The presentation lacks supporting facts and details. Information is vague or missing.","The presentation includes minimal supporting facts and details. Some information may be irrelevant or inaccurate.","The presentation includes some supporting facts and details, but more could be added to strengthen the presentation.","The presentation includes appropriate facts and relevant details that support the main ideas or themes.","The presentation includes well-chosen facts and vivid details that effectively support the main ideas or themes.","The presentation includes compelling facts and insightful details that enhance the main ideas or themes, demonstrating a deep understanding of the topic."],["The speaker is difficult to understand due to mumbling, speaking too fast, or other articulation issues. The pace is either too fast or too slow.","The speaker is sometimes difficult to understand. The pace is inconsistent and may be too fast or too slow at times.","The speaker is generally understandable, but there are occasional issues with clarity or pace.","The speaker speaks clearly at an understandable pace throughout the presentation.","The speaker speaks clearly and articulately at a pace that is well-suited to the audience and the content.","The speaker commands attention with exceptional clarity and an engaging pace that enhances the message."],["The narrative lacks a clear context and fails to provide insight into why the event or experience is memorable.","The narrative provides a vague context and offers minimal insight into the significance of the event or experience.","The narrative establishes a basic context and provides some insight into why the event or experience is memorable.","The narrative provides a clear context and includes clear insight into why the event or experience is memorable.","The narrative provides a vivid context and offers thoughtful insight into the lasting impact of the event or experience.","The narrative provides a richly detailed context and demonstrates profound insight into the transformative power of the event or experience."]]}