{"criteria":["Preparation for Discussion","Adherence to Discussion Rules and Roles","Quality of Questions and Responses","Synthesis of Ideas and Conclusions"],"points":[0,1,2,3,4,5],"descriptions":[["Student comes to the discussion unprepared, showing no evidence of having read or studied the required material. Does not draw on any external information.","Student comes to the discussion with minimal preparation, showing little evidence of having read or studied the required material. Barely draws on external information.","Student shows some preparation for the discussion, demonstrating a basic understanding of the required material. Attempts to draw on some external information, but may be superficial.","Student comes to the discussion prepared, demonstrating a solid understanding of the required material. Draws on external information to support their ideas.","Student comes to the discussion well-prepared, demonstrating a comprehensive understanding of the required material. Effectively integrates external information to enrich the discussion.","Student comes exceptionally prepared, demonstrating mastery of the required material. Skillfully integrates a wide range of external information, significantly enhancing the discussion."],["Student disregards agreed-upon rules for discussions and does not carry out assigned roles.","Student inconsistently follows agreed-upon rules for discussions and struggles to carry out assigned roles.","Student generally follows agreed-upon rules for discussions and attempts to carry out assigned roles with some prompting.","Student consistently follows agreed-upon rules for discussions and effectively carries out assigned roles.","Student consistently follows agreed-upon rules for discussions and effectively carries out assigned roles, contributing positively to the group dynamic.","Student expertly follows agreed-upon rules for discussions and seamlessly carries out assigned roles, enhancing the overall effectiveness of the group."],["Student does not pose or respond to specific questions, and does not contribute to the discussion or elaborate on the remarks of others.","Student struggles to pose or respond to specific questions, and makes comments that do not contribute meaningfully to the discussion or elaborate on the remarks of others.","Student poses and responds to some specific questions, making comments that contribute somewhat to the discussion and elaborate on the remarks of others in a limited way.","Student effectively poses and responds to specific questions, making comments that contribute to the discussion and elaborate on the remarks of others.","Student skillfully poses and responds to specific questions, making comments that significantly contribute to the discussion and thoughtfully elaborate on the remarks of others.","Student masterfully poses and responds to insightful questions, making comments that substantially contribute to the discussion and profoundly elaborate on the remarks of others, advancing the group's understanding."],["Student does not review key ideas expressed or draw conclusions in light of information and knowledge gained from the discussions.","Student struggles to review key ideas expressed or draw conclusions in light of information and knowledge gained from the discussions.","Student attempts to review key ideas expressed and draw conclusions, but the synthesis is superficial and lacks depth.","Student reviews key ideas expressed and draws reasonable conclusions in light of information and knowledge gained from the discussions.","Student effectively reviews key ideas expressed and draws insightful conclusions in light of information and knowledge gained from the discussions.","Student masterfully reviews key ideas expressed and draws profound, well-supported conclusions in light of information and knowledge gained from the discussions, demonstrating a deep understanding of the topic."]]}