{"criteria":["Accuracy of Summary","Clarity and Conciseness","Inclusion of Diverse Media and Formats","Organization and Structure"],"points":[0,1,2,3,4,5],"descriptions":[["The summary is completely inaccurate and does not reflect the main points of the original text\/presentation.","The summary contains significant inaccuracies and misses several key points from the original text\/presentation.","The summary contains some inaccuracies and misses some key points from the original text\/presentation.","The summary is mostly accurate but may have minor inaccuracies or omissions.","The summary is accurate and includes all the main points from the original text\/presentation.","The summary is exceptionally accurate, comprehensive, and captures all the nuances of the original text\/presentation."],["The summary is unclear, disorganized, and excessively long.","The summary is difficult to understand and lacks organization.","The summary is somewhat unclear and could be more concise.","The summary is generally clear and concise but could be improved.","The summary is clear, concise, and easy to understand.","The summary is exceptionally clear, concise, and effectively communicates the essence of the original text\/presentation."],["The summary does not address or integrate any information from diverse media or formats.","The summary minimally addresses information from diverse media or formats but lacks integration.","The summary attempts to include information from diverse media or formats but struggles with integration.","The summary includes some information from diverse media or formats and integrates it adequately.","The summary effectively integrates information from diverse media and formats.","The summary masterfully integrates information from diverse media and formats to create a comprehensive overview."],["The summary lacks any discernible organization or structure.","The summary is poorly organized and difficult to follow.","The summary has some organization, but it is not consistently maintained.","The summary is generally well-organized with a clear structure.","The summary is well-organized, logically structured, and easy to follow.","The summary exhibits exceptional organization and structure, enhancing the clarity and impact of the information presented."]]}