{"criteria":["Logical Sequencing and Organization","Use of Facts and Details","Clarity and Pace of Speech","Delivery and Presentation Skills (for Poem\/Speech Recitation)"],"points":[0,1,2,3,4,5],"descriptions":[["The presentation lacks a clear sequence. Ideas are presented randomly and are difficult to follow.","The presentation attempts a sequence, but it is weak and inconsistent. Some ideas are out of place.","The presentation has a discernible sequence, but transitions are weak. The order of ideas could be improved.","The presentation is logically sequenced for the most part. Transitions are present but could be smoother.","The presentation is logically sequenced with clear transitions that enhance understanding.","The presentation is exceptionally well-organized, with a compelling and logical sequence that significantly enhances the impact of the message."],["The presentation lacks supporting facts and details. Main ideas are unsupported.","The presentation includes few facts and details, and they are not always relevant to the main ideas.","The presentation includes some relevant facts and details, but more support is needed to develop the main ideas.","The presentation provides relevant facts and details to support most main ideas.","The presentation provides strong, relevant facts and descriptive details that effectively support the main ideas or themes.","The presentation is rich with specific, compelling, and highly relevant facts and details that powerfully support and enhance the main ideas or themes."],["The speaker is difficult to understand due to mumbling, excessive speed, or other speech impediments.","The speaker is sometimes difficult to understand. The pace is either too fast or too slow.","The speaker is generally understandable, but there are moments of unclear speech or an uneven pace.","The speaker is clear and understandable at a mostly appropriate pace.","The speaker is consistently clear and speaks at an understandable pace, making it easy for the audience to follow.","The speaker is exceptionally clear and articulate, with a pace perfectly suited to the content and audience, enhancing the overall impact of the presentation."],["Demonstrates no understanding of the text. Lacks expression, gestures, and appropriate rate.","Shows minimal understanding of the text. Delivery is monotone with few gestures and an inappropriate rate.","Demonstrates some understanding of the text. Delivery is somewhat expressive with a few appropriate gestures and a mostly suitable rate.","Demonstrates good understanding of the text. Uses appropriate rate, expression, and gestures to convey the meaning.","Demonstrates a strong understanding of the text. Effectively uses rate, expression, and gestures to enhance the performance.","Demonstrates a masterful understanding of the text. Performance is captivating, using rate, expression, and gestures to create a profound impact on the audience."]]}