{"criteria":["Preparation and Use of Evidence: Demonstrates preparedness for discussions by referencing relevant material and evidence.","Following Discussion Rules and Roles: Adheres to rules for discussions, sets goals, and defines roles effectively.","Questioning and Response Skills: Poses relevant questions and provides detailed responses that contribute to the discussion.","Understanding and Reflection: Demonstrates understanding of multiple perspectives through reflection and paraphrasing."],"points":[0,1,2,3,4,5],"descriptions":[["Student is not prepared for the discussion and does not reference any material or evidence.","Student shows minimal preparation and struggles to reference relevant material or evidence.","Student is somewhat prepared and attempts to reference material or evidence, but lacks clarity and depth.","Student is generally prepared and references relevant material and evidence to support their ideas.","Student is well-prepared, effectively uses relevant material and evidence to support their ideas, and probes deeper into the topic.","Student is exceptionally prepared, skillfully uses relevant material and evidence to enhance the discussion, and reflects critically on the ideas presented."],["Student does not follow discussion rules, does not contribute to setting goals, and neglects defined roles.","Student struggles to follow discussion rules, has difficulty contributing to setting goals, and understanding defined roles.","Student inconsistently follows discussion rules, vaguely contributes to setting goals, and participation in roles is not apparent.","Student generally follows discussion rules, contributes to setting goals, and participates appropriately in assigned roles.","Student consistently follows discussion rules, actively contributes to setting goals and defining roles, and enhances group efficiency.","Student expertly follows discussion rules, facilitates the setting of goals and roles, and ensures maximum group effectiveness."],["Student does not ask questions or provide relevant responses.","Student asks irrelevant questions and provides unclear or incomplete responses.","Student asks somewhat relevant questions and provides basic responses with limited detail.","Student asks relevant questions and provides elaborated responses that contribute to the discussion.","Student poses insightful questions and provides well-detailed responses, enhancing the depth of the discussion.","Student asks probing questions and provides comprehensive, nuanced responses, transforming the discussion into a richer experience."],["Student shows no understanding of different perspectives and does not reflect or paraphrase.","Student shows limited understanding of different perspectives and struggles to reflect or paraphrase.","Student attempts to acknowledge different perspectives and paraphrase, but lacks clarity and precision.","Student generally understands different perspectives and provides adequate reflections and paraphrasing.","Student clearly understands different perspectives and provides insightful reflections and paraphrasing.","Student demonstrates a deep understanding of multiple perspectives and provides profound reflections and paraphrasing, synthesizing various viewpoints."]]}