{"criteria":["Logical Sequencing and Organization","Use of Supporting Details","Nonverbal Elements (Eye Contact, Volume, Pronunciation)","Language Use and Vocabulary"],"points":[0,1,2,3,4,5],"descriptions":[["Presentation lacks a clear sequence; ideas are disjointed and difficult to follow.","Presentation shows minimal organization; sequencing is weak and unclear.","Presentation is somewhat organized, but transitions are weak and some ideas are out of place.","Presentation is generally well-organized with mostly logical sequencing, but some transitions could be smoother.","Presentation is well-organized with clear and logical sequencing; transitions effectively connect ideas.","Presentation is exceptionally well-organized, demonstrating a sophisticated understanding of sequencing to enhance clarity and impact."],["Presentation lacks relevant facts, descriptions, or details to support claims.","Presentation includes few relevant facts, descriptions, or details; support is weak.","Presentation includes some relevant facts, descriptions, and details, but could be more developed.","Presentation provides adequate facts, descriptions, and details to support most claims effectively.","Presentation provides thorough and relevant facts, descriptions, and details to support claims persuasively.","Presentation uses insightful and compelling facts, descriptions, and details that significantly enhance the presentation's credibility and impact."],["Nonverbal elements are distracting or absent; eye contact is minimal, volume is too low or high, and pronunciation is unclear.","Nonverbal elements are weak; eye contact is infrequent, volume is inconsistent, and pronunciation is sometimes unclear.","Nonverbal elements are somewhat effective; eye contact is present but not consistent, volume is generally adequate, and pronunciation is mostly clear.","Nonverbal elements are generally effective; good eye contact, adequate volume, and clear pronunciation enhance the presentation.","Nonverbal elements are strong; consistent eye contact, varied volume, and precise pronunciation engage the audience effectively.","Nonverbal elements are exceptionally effective; confident eye contact, dynamic volume, and flawless pronunciation captivate the audience and significantly enhance the message."],["Language is vague and imprecise; vocabulary is limited and inappropriate for the topic.","Language is simplistic; vocabulary is basic and lacks precision.","Language is generally appropriate, but vocabulary could be more precise and varied.","Language is clear and precise; appropriate vocabulary is used effectively.","Language is sophisticated and engaging; domain-specific vocabulary is used expertly.","Language is masterful; vocabulary is used with nuance and sophistication, enhancing the presentation's impact and demonstrating a deep understanding of the subject."]]}