{"criteria":["Comprehension of Information","Explanation of Contribution","Analysis of Diverse Media and Formats"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no understanding of the information presented in diverse media and formats.","Student shows a minimal understanding of the information but struggles to grasp the main idea or key details.","Student demonstrates a basic understanding of the information but may miss some nuances or connections.","Student comprehends the information presented in most media and formats, identifying key details and ideas with some accuracy.","Student demonstrates a strong understanding of the information, accurately interpreting it across various media and formats.","Student demonstrates a comprehensive and insightful understanding of the information, skillfully interpreting it across diverse media and formats."],["Student is unable to explain how the information contributes to a topic, text, or issue under study.","Student attempts to explain the contribution but provides vague or irrelevant connections.","Student offers a limited explanation of how the information contributes, but the connection may be superficial.","Student explains how the information contributes to the topic, text, or issue with reasonable clarity and relevance.","Student clearly and effectively explains how the information enhances understanding of the topic, text, or issue.","Student provides a sophisticated and insightful explanation of how the information significantly contributes to a deeper understanding of the topic, text, or issue."],["Student does not recognize or engage with the different media and formats used.","Student identifies different media and formats but does not analyze their impact or effectiveness.","Student offers a basic analysis of the media and formats, but the observations are limited and lack depth.","Student analyzes how the different media and formats shape the presentation and interpretation of information.","Student provides a thorough and insightful analysis of the media and formats, exploring their impact on the message and audience.","Student offers a nuanced and sophisticated analysis of the diverse media and formats, demonstrating a deep understanding of their rhetorical and communicative functions."]]}