{"criteria":["Clarity of Speech","Organization of Ideas","Fluency and Pacing"],"points":[0,1,2,3,4,5],"descriptions":[["The student's speech is inaudible or incomprehensible. Thoughts, feelings, and ideas are not expressed.","The student struggles to speak audibly, and expressing thoughts, feelings, and ideas is difficult to understand.","The student's speech is sometimes audible, and the expression of thoughts, feelings, and ideas is somewhat clear but lacks coherence.","The student speaks audibly most of the time, and thoughts, feelings, and ideas are generally expressed clearly with some minor issues.","The student speaks audibly, and thoughts, feelings, and ideas are expressed clearly and coherently.","The student speaks audibly and articulately, expressing thoughts, feelings, and ideas clearly, coherently, and persuasively."],["The student's presentation lacks organization, making it difficult to follow their line of thinking.","The student's presentation is poorly organized, and the line of thinking is difficult to follow.","The student's presentation shows some organization, but the line of thinking is still somewhat unclear.","The student's presentation is organized adequately, and the line of thinking is generally clear.","The student's presentation is well-organized, and the line of thinking is easy to follow.","The student's presentation is exceptionally well-organized, and the line of thinking is compelling and insightful."],["The student uses distracting filler words, pauses excessively, or speaks too quickly or slowly.","The student uses many filler words, pauses frequently, or speaks at an inconsistent pace, hindering effective communication.","The student uses some filler words, pauses occasionally, or speaks at a pace that occasionally detracts from the message.","The student uses few filler words, pauses appropriately, and maintains a moderate pace that generally supports effective communication.","The student avoids filler words, pauses strategically, and speaks at a pace that enhances effective communication.","The student speaks fluently and confidently with no filler words, using pauses and pace effectively to captivate the audience."]]}