{"criteria":["Engagement and Adherence to Discussion Rules","Relevance and Connection to Topic","Sustaining Conversation"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not participate in discussions or actively avoids engaging with peers and adults.","Student attempts to participate but struggles to follow basic rules of discussion or maintain focus on the topic.","Student inconsistently follows rules for discussions and struggles to stay on topic or engage in meaningful exchanges.","Student generally follows rules for discussions, staying mostly on topic and engaging in brief exchanges with some prompting.","Student effectively follows rules for discussions, actively listening and taking turns while contributing relevant ideas to the conversation.","Student excels in collaborative conversations, demonstrating strong listening skills, thoughtful contributions, and the ability to sustain conversations through multiple exchanges while adhering to agreed-upon rules."],["Student demonstrates no ability to connect their comments to the topic or previous speakers.","Student makes minimal attempts to connect comments but struggles to maintain relevance.","Student occasionally connects comments to the topic or previous speakers, but connections are often weak or unclear.","Student generally connects comments to the topic and previous speakers, demonstrating a basic understanding of the conversation flow.","Student effectively connects comments to the topic and previous speakers, building upon ideas and contributing to a cohesive discussion.","Student skillfully connects comments to the topic and previous speakers, synthesizing information, building consensus, and advancing the conversation with insightful contributions."],["Student does not attempt to continue the conversation and offers no additional input.","Student makes minimal attempts to continue the conversation but struggles to maintain engagement.","Student occasionally contributes to continuing the conversation but struggles to maintain engagement.","Student contributes to continuing the conversation but struggles to maintain focus.","Student effectively contributes to continuing the conversation, building upon ideas and offering additional relevant input.","Student skillfully contributes to continuing the conversation, building upon ideas, synthesizing information, and advancing the discussion with insightful contributions."]]}