{"criteria":["Clarity and relevance of questions and answers","Ability to identify areas of confusion or information needed","Engagement with responses and integration of new information"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not attempt to ask or answer questions.","Student attempts to ask or answer questions but demonstrates significant difficulty in formulating coherent questions or providing relevant answers.","Student asks or answers simple questions with limited clarity and relevance. Struggles to seek help or clarify misunderstandings effectively.","Student asks and answers questions with moderate clarity and relevance. Can seek help or clarify misunderstandings with some prompting.","Student asks and answers questions clearly and relevantly to seek help, get information, or clarify misunderstandings. Demonstrates good understanding of the topic.","Student consistently asks insightful and probing questions, providing thoughtful and relevant answers. Effectively seeks help, gets information, and clarifies misunderstandings to enhance understanding."],["Student is unable to identify areas of confusion or information needed.","Student struggles to recognize when help is needed or information is lacking.","Student identifies basic areas of confusion or information needs with prompting.","Student independently identifies some areas of confusion or information needs.","Student effectively identifies areas of confusion or information needs and seeks clarification.","Student proactively identifies complex areas of confusion or information needs and seeks clarification with precision."],["Student does not listen to or acknowledge responses from others.","Student shows minimal attention to responses from others and struggles to integrate new information.","Student listens to responses but has difficulty integrating new information or adjusting understanding.","Student listens to responses and integrates some new information into their understanding.","Student actively listens to responses, integrates new information, and adjusts understanding effectively.","Student critically listens to responses, synthesizes new information, and demonstrates a refined understanding through follow-up questions and insights."]]}