{"criteria":["Questioning and Answering Skills","Following Oral Directions","Seeking Clarification"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not attempt to ask or answer questions about the text or information presented.","Student attempts to ask or answer questions but demonstrates minimal understanding of the text or information.","Student asks or answers basic questions about the text or information with some clarity but may miss key details.","Student asks and answers questions about key details of the text or information, demonstrating a general understanding.","Student asks and answers detailed questions about the text or information, clarifying understanding and showing a solid grasp of the content.","Student proactively asks insightful questions and provides comprehensive answers, demonstrating a deep understanding of the text or information and seeking clarification effectively."],["Student does not follow oral directions.","Student struggles to follow even one-step oral directions.","Student follows one-step oral directions with difficulty and is unable to follow two-step directions.","Student generally follows one- and two-step oral directions but may require repetition or clarification.","Student accurately follows one- and two-step oral directions with minimal need for clarification.","Student independently and accurately follows one- and two-step oral directions, demonstrating strong listening and comprehension skills."],["Student does not attempt to seek clarification when confused.","Student shows awareness of confusion but does not attempt to seek clarification.","Student occasionally seeks clarification but does so unclearly or ineffectively.","Student seeks clarification when confused, asking relevant questions to aid understanding.","Student proactively seeks clarification, asking specific and insightful questions to fully understand the material.","Student demonstrates exceptional self-awareness by identifying areas of confusion and articulating precise questions that significantly enhance comprehension."]]}