{"criteria":["Clarity and Detail of Description","Accuracy and Understanding","Organization and Coherence"],"points":[0,1,2,3,4,5],"descriptions":[["The description lacks detail and provides minimal information about the subject. The description is confusing.","The description is vague and provides limited information about the subject with little or no additional details.","The description is somewhat clear, providing some information about the subject and attempts to add additional details with some prompting","The description is generally clear and provides relevant information about the subject with some supporting details.","The description is clear, detailed, and provides a comprehensive account of the subject, including relevant and specific details.","The description is vivid, insightful, and provides an exceptionally detailed and engaging account of the subject, demonstrating a deep understanding and nuanced perspective."],["The description demonstrates no understanding of the subject and is filled with inaccuracies.","The description shows a very limited understanding of the subject and contains several inaccuracies.","The description indicates a basic understanding of the subject but includes some inaccuracies or misunderstandings.","The description demonstrates a satisfactory understanding of the subject with minor inaccuracies or omissions.","The description demonstrates a strong understanding of the subject with accurate and well-supported information.","The description demonstrates a comprehensive and insightful understanding of the subject, reflecting a deep level of knowledge and mastery."],["The description lacks organization and coherence, making it difficult to follow or understand.","The description is poorly organized and lacks coherence, making it challenging to follow.","The description shows some organization but may lack coherence in certain areas.","The description is generally well-organized and coherent, with a logical flow of information.","The description is well-organized and coherent, with a clear and logical flow of information throughout.","The description is exceptionally well-organized, coherent, and flows seamlessly, enhancing the overall clarity and impact of the description."]]}