{"criteria":["Sequencing and Details: How well does the narrative recount events in a logical order and provide relevant details?","Use of Temporal Words: To what extent are temporal words employed to signal event order?","Sense of Closure: How effectively does the narrative provide a sense of conclusion or resolution?"],"points":[0,1,2,3,4,5],"descriptions":[["The narrative lacks a clear sequence of events. Details are missing or irrelevant, and temporal words are absent. There is no sense of closure.","The narrative attempts to recount events, but the sequence is unclear. Few details are provided, and temporal words are used incorrectly or are missing. The closure is weak or nonexistent.","The narrative recounts events with some semblance of sequence, but the order may be confusing. Some details are included, and temporal words are used inconsistently. The closure is attempted but feels abrupt.","The narrative generally recounts events in a logical sequence. Details are included to support the events, and temporal words are used to signal order, though not always effectively. The narrative provides a basic sense of closure.","The narrative recounts two or more events in a clear and logical sequence. Relevant details are included to enhance the events, and temporal words are used effectively to signal order. The narrative provides a satisfactory sense of closure.","The narrative skillfully recounts two or more events in a seamless and logical sequence. Rich, relevant details are included to vividly enhance the events, and temporal words are used masterfully to signal order. The narrative provides a compelling and satisfying sense of closure."],["Temporal words are completely absent, making it impossible to follow the sequence of events.","Temporal words are rare and misplaced, causing confusion about the timing of events.","Temporal words are used occasionally, but their placement is awkward and sometimes misleading.","Temporal words are used adequately to indicate the order of events, but there is room for improvement in their precision and variety.","Temporal words are used effectively to create a clear timeline of events, enhancing the narrative's coherence.","Temporal words are used skillfully and creatively to establish a precise and engaging timeline of events, enriching the narrative's impact."],["The narrative abruptly ends without any attempt to conclude or resolve the events.","The narrative offers a vague or incomplete conclusion, leaving the reader unsatisfied.","The narrative provides a brief and somewhat predictable closure, but it lacks depth and emotional resonance.","The narrative achieves a functional closure that ties up loose ends and offers a sense of resolution.","The narrative delivers a thoughtful and well-crafted closure that provides insight or reflection on the events.","The narrative offers a compelling and memorable closure that lingers in the reader's mind, leaving a lasting impression."]]}