{"criteria":["Clarity and Focus of Topic","Quality and Use of Facts","Sense of Closure","Clarity and Grammar"],"points":[0,1,2,3,4,5],"descriptions":[["The text does not name a clear topic.","The text names a topic, but it is vague or unclear.","The text names a topic, but it is not consistently maintained throughout the text.","The text clearly names a topic and maintains focus on it for the most part.","The text clearly and consistently names a specific topic.","The text introduces a compelling topic and maintains a sharp, consistent focus throughout."],["The text includes no facts about the topic.","The text includes only one fact about the topic, or the facts are inaccurate.","The text includes a few facts about the topic, but they are not well-developed or explained.","The text includes several relevant facts about the topic, providing some explanation or detail.","The text provides a good amount of accurate and relevant facts about the topic, with clear explanations.","The text presents a wealth of well-researched, accurate, and insightful facts about the topic, enhancing the reader's understanding."],["The text provides no sense of closure or ending.","The text attempts to provide closure, but it is abrupt or confusing.","The text provides a weak or generic sense of closure.","The text provides a reasonable sense of closure, summarizing the main points.","The text offers a thoughtful and clear sense of closure, reinforcing the topic's importance.","The text concludes with a memorable and insightful closure, leaving the reader with a strong understanding of the topic's significance."],["The writing demonstrates no understanding of basic grammar and sentence structure.","The writing contains frequent errors in grammar and sentence structure, making it difficult to understand.","The writing contains several errors in grammar and sentence structure that occasionally interfere with understanding.","The writing demonstrates a basic understanding of grammar and sentence structure, with some errors.","The writing is clear and grammatically correct, with only minor errors.","The writing is exceptionally clear, concise, and grammatically sound, demonstrating a mastery of language conventions."]]}