{"criteria":["Focus on Topic and Understanding","Response to Questions and Suggestions","Addition of Details to Strengthen Writing"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear focus and demonstrates no understanding of the topic.","The writing demonstrates a minimal focus on the topic with little understanding.","The writing shows some focus on the topic, but understanding is limited and details are sparse.","The writing generally focuses on the topic and shows a moderate understanding, with some supporting details.","The writing is focused and demonstrates a good understanding of the topic, with relevant details that strengthen the piece.","The writing is sharply focused, demonstrating a comprehensive understanding of the topic, with rich and compelling details that significantly enhance the writing."],["There is no evidence of responding to questions or suggestions, and no attempt to strengthen writing based on feedback.","The response to questions or suggestions is minimal or irrelevant, with little to no effort to strengthen the writing.","The writing shows a limited response to questions or suggestions, and there is a weak attempt to strengthen the writing based on feedback.","The writing addresses some questions and suggestions, with a moderate effort to incorporate feedback and strengthen the writing.","The writing thoughtfully responds to questions and suggestions, and feedback is effectively used to strengthen and refine the writing.","The writing demonstrates a highly insightful and proactive response to questions and suggestions, with feedback expertly integrated to substantially improve the writing's quality and impact."],["The writing lacks detail and depth, offering no additional information to support the main points.","The writing includes very few details, which do little to enhance the main points.","The writing has some details, but they are superficial and do not significantly strengthen the writing.","The writing includes relevant details that provide support and clarification, but there is room for more depth.","The writing incorporates substantial details that effectively strengthen the main points and enrich the overall piece.","The writing is replete with vivid and insightful details that powerfully enhance the main points, creating a compelling and deeply engaging reading experience."]]}