{"criteria":["Participation and Contribution","Clarity and Accuracy of Instructions","Use of Sources and Citations"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not participate in the research or writing project.","Student attempts to participate but struggles to contribute meaningfully to the research or writing.","Student participates in the research and writing project but has difficulty following instructions or contributing original ideas.","Student participates in the research and writing project, follows instructions adequately, and contributes some original ideas.","Student actively participates in the research and writing project, follows instructions effectively, and contributes meaningful original ideas.","Student leads the research and writing project, demonstrates a strong understanding of the topic, follows instructions with precision, and contributes insightful original ideas."],["Student's sequence of instructions is missing or completely incomprehensible.","Student's sequence of instructions is difficult to follow and lacks clarity.","Student's sequence of instructions is somewhat clear but contains errors or omissions.","Student's sequence of instructions is mostly clear and accurate, with minor errors or omissions.","Student's sequence of instructions is clear, accurate, and easy to follow.","Student's sequence of instructions is exceptionally clear, accurate, easy to follow, and demonstrates a deep understanding of the topic."],["Student fails to cite sources or uses them inappropriately.","Student attempts to cite sources but does so inconsistently or with errors.","Student cites sources but may have some minor errors or inconsistencies.","Student cites sources correctly and consistently throughout the project.","Student cites sources meticulously and demonstrates a strong understanding of proper citation methods.","Student not only cites sources impeccably but also critically evaluates and synthesizes information from various sources to enhance the project."]]}