{"criteria":["Organization and Structure","Grammar and Mechanics","Evidence and Support"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear introduction, thesis statement, and conclusion. There is no discernible structure or organization.","The writing has a weak introduction, thesis statement, and conclusion. The structure is poorly organized and difficult to follow.","The writing has an identifiable introduction, thesis statement, and conclusion, but they may be vague or underdeveloped. The structure is somewhat organized but may have inconsistencies.","The writing has a clear introduction, thesis statement, and conclusion. The structure is generally well-organized and logical.","The writing has a strong and engaging introduction, a clear and focused thesis statement, and a satisfying conclusion. The structure is well-organized and enhances the clarity of the argument.","The writing has a compelling and insightful introduction, a precise and nuanced thesis statement, and a thought-provoking conclusion. The structure is exceptionally well-organized and effectively supports the argument."],["The writing contains numerous grammatical errors, spelling mistakes, and punctuation errors that significantly impede understanding.","The writing contains frequent grammatical errors, spelling mistakes, and punctuation errors that distract the reader and confuse the meaning.","The writing contains some grammatical errors, spelling mistakes, and punctuation errors, but they do not seriously impede understanding.","The writing contains few grammatical errors, spelling mistakes, and punctuation errors. The errors are minor and do not distract the reader.","The writing is mostly free of grammatical errors, spelling mistakes, and punctuation errors. Any errors are minimal and do not affect clarity.","The writing is exceptionally polished and free of grammatical errors, spelling mistakes, and punctuation errors. The language is precise and effective."],["The writing does not present any evidence or supporting details. The argument is based on unsubstantiated claims and opinions.","The writing presents minimal evidence or supporting details. The evidence is weak, irrelevant, or inaccurate.","The writing presents some evidence or supporting details, but it may be insufficient or not directly relevant to the argument.","The writing presents adequate evidence and supporting details to support the argument. The evidence is generally relevant and accurate.","The writing presents strong evidence and compelling supporting details that effectively support the argument. The evidence is relevant, accurate, and well-integrated.","The writing presents a wealth of compelling evidence and insightful supporting details that strengthen the argument and demonstrate a deep understanding of the topic. The evidence is expertly integrated and analyzed."]]}