{"criteria":["Effective use of digital tools for writing and publishing.","Collaboration with peers in the writing process.","Quality and effectiveness of digital publishing."],"points":[0,1,2,3,4,5],"descriptions":[["The student does not use digital tools for writing or publishing.","The student attempts to use digital tools with significant guidance but struggles to produce or publish writing effectively.","The student uses basic digital tools to produce writing but requires frequent assistance and struggles with publishing.","The student independently uses a variety of digital tools to produce and publish writing, demonstrating basic proficiency.","The student effectively uses a variety of digital tools to produce and publish writing, showing good proficiency and collaboration skills.","The student skillfully uses a wide range of digital tools to produce and publish writing, excelling in both individual work and collaboration with peers, demonstrating leadership in tool usage."],["The student does not collaborate with peers on writing projects.","The student attempts to collaborate but struggles to contribute meaningfully or work effectively with peers.","The student participates in collaboration but requires significant guidance to stay on task and contribute constructively.","The student collaborates effectively with peers, contributing to the writing and publishing process.","The student actively collaborates with peers, enhances the writing through collaboration, and demonstrates strong teamwork skills.","The student leads collaborative writing projects, fostering an inclusive and productive environment, demonstrating exemplary collaboration skills and insights."],["The student’s writing is not published or shared in any digital format.","The student attempts to publish writing but faces significant challenges in formatting and presenting the work digitally.","The student publishes writing with basic formatting but lacks attention to detail and audience appropriateness.","The student publishes writing in a clear and accessible digital format suitable for the intended audience.","The student publishes writing with effective formatting and presentation, engaging the intended audience and adhering to digital publishing standards.","The student expertly publishes writing, demonstrating innovative and impactful digital presentation skills, creating a compelling and professional final product."]]}