{"criteria":["Effectively integrates textual evidence to support analysis, reflection, and research.","Cites sources accurately and effectively using a consistent citation style.","Distinguishes the writer's own ideas from the information and evidence drawn from other sources."],"points":[0,1,2,3,4,5],"descriptions":[["The writer provides no evidence of drawing evidence from literary or informational texts to support analysis, reflection, and research.","The writer attempts to draw evidence from texts, but the connections to the analysis, reflection, or research are vague, irrelevant, or minimal.","The writer draws some evidence from texts, but the evidence is not always clearly connected to the analysis, reflection, or research, or the explanation is superficial.","The writer draws evidence from texts to support analysis, reflection, and research, but the explanation of the evidence’s significance or relevance could be more thorough or insightful.","The writer effectively draws evidence from texts to support analysis, reflection, and research, providing a clear explanation of the evidence’s significance and relevance.","The writer skillfully and insightfully draws evidence from literary or informational texts to comprehensively support analysis, reflection, and research, demonstrating a deep understanding of the material and its implications."],["The writer demonstrates no attempt to properly cite sources, or the citation is completely missing.","The writer attempts to cite sources, but the citation is incorrect, incomplete, or inconsistently applied.","The writer cites sources, but there are noticeable errors or omissions in the citation format.","The writer generally cites sources correctly, with only minor errors or inconsistencies.","The writer accurately cites sources, adhering to a consistent citation style throughout the work.","The writer meticulously and accurately cites all sources, demonstrating a thorough understanding of citation conventions and providing complete and precise references."],["There is no clear distinction or connection between the evidence presented and the writer's own ideas.","The writer attempts to distinguish between evidence and their own ideas, but the connection is superficial or unclear.","The writer identifies some distinctions between evidence and their own ideas, but the integration is not always seamless or well-explained.","The writer generally distinguishes between evidence and their own ideas, providing a basic level of integration and explanation.","The writer clearly distinguishes between evidence and their own ideas, effectively integrating the two to support their points.","The writer masterfully distinguishes between evidence and their own ideas, seamlessly integrating the two to create a compelling and insightful analysis or argument."]]}