{"criteria":["Clarity and Coherence","Organization and Structure","Audience Awareness"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence of clear and coherent writing is present. The writing lacks a central idea or focus.","The writing demonstrates minimal coherence and clarity. The central idea is vague, and the structure is weak.","The writing shows some coherence and clarity. The central idea is identifiable, but the structure needs improvement.","The writing is generally coherent and clear. The central idea is mostly focused, and the structure is adequately organized.","The writing is coherent, clear, and focused. The central idea is well-defined, and the structure is logically organized.","The writing is exceptionally coherent, clear, and focused. The central idea is compelling, and the structure is sophisticated and effective."],["The organization is completely lacking. Ideas are presented randomly with no discernible pattern.","The organization is very weak. Ideas are loosely connected and lack a logical sequence.","The organization is somewhat weak. Ideas are connected, but the sequence is not always logical or effective.","The organization is adequate. Ideas are generally presented in a logical sequence, but there is room for improvement.","The organization is strong. Ideas are presented in a clear and logical sequence, enhancing the overall message.","The organization is exceptional. Ideas are masterfully arranged to create a compelling and coherent narrative."],["There is no evidence of audience awareness. The writing is inappropriate for the intended reader.","The writing shows little awareness of the audience. The tone and style are not well-suited to the intended reader.","The writing shows some awareness of the audience. The tone and style are generally appropriate, but there are inconsistencies.","The writing demonstrates a good understanding of the audience. The tone and style are appropriate for the intended reader.","The writing is carefully tailored to the audience. The tone, style, and language are effective and engaging.","The writing demonstrates a deep understanding of the audience. The tone, style, and language are expertly crafted to resonate with the intended reader."]]}