{"criteria":["Organization and Structure","Development of Ideas","Clarity and Focus"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear organizational structure. Ideas are presented randomly, and there is no discernible pattern or flow.","The writing shows minimal organization. There is an attempt to structure the ideas, but it is inconsistent and difficult to follow.","The writing has a basic organizational structure, but it may be weak or inconsistent in places. Transitions between ideas may be abrupt or unclear.","The writing is generally well-organized with a clear structure. Ideas are presented in a logical sequence, and transitions are mostly smooth.","The writing is effectively organized with a clear and logical structure that enhances the overall message. Transitions are smooth and purposeful.","The writing demonstrates exceptional organization and structure. The ideas are presented in a compelling and coherent manner, with seamless transitions and a strong sense of flow."],["The writing lacks development. Ideas are presented without any supporting details or examples.","The writing shows minimal development. Ideas are presented with little supporting details or examples.","The writing has some development of ideas, but it may be superficial or underdeveloped in places. Supporting details may be generic or lack relevance.","The writing develops ideas with relevant and specific supporting details and examples. The writer explains and expands on the ideas effectively.","The writing demonstrates strong development of ideas with well-chosen and insightful supporting details and examples. The writer explores the ideas in depth and provides clear explanations.","The writing exhibits exceptional development of ideas with rich and compelling supporting details and examples. The writer demonstrates a deep understanding of the topic and provides insightful analysis."],["The writing lacks clarity and focus. The purpose of the writing is unclear, and the ideas are presented in a confusing or disjointed manner.","The writing shows minimal clarity and focus. The purpose of the writing is vague, and the ideas may be presented in a disorganized or rambling manner.","The writing has some clarity and focus, but it may be inconsistent in places. The purpose of the writing is generally apparent, but the ideas may be somewhat disjointed.","The writing is generally clear and focused. The purpose of the writing is evident, and the ideas are presented in a coherent and logical manner.","The writing is clear, concise, and focused. The purpose of the writing is well-defined, and the ideas are presented in a coherent and persuasive manner.","The writing demonstrates exceptional clarity and focus. The purpose of the writing is masterfully conveyed, and the ideas are presented in a compelling and insightful manner."]]}