{"criteria":["Elaboration of Event or Sequence of Events","Description of Actions, Thoughts, and Feelings","Use of Temporal Words to Signal Event Order","Sense of Closure"],"points":[0,1,2,3,4,5],"descriptions":[["The narrative lacks a central event or sequence of events. There is no clear focus or purpose.","The narrative introduces an event or sequence of events, but the elaboration is minimal. Key details are missing, making it difficult to follow the storyline.","The narrative recounts an event or sequence of events with some elaboration. However, the details provided are limited, and the storyline may be somewhat vague.","The narrative recounts a well-elaborated event or sequence of events with sufficient details. The storyline is generally clear and easy to follow.","The narrative recounts a well-elaborated event or sequence of events with rich and vivid details. The storyline is engaging and easy to follow, demonstrating a clear understanding of the narrative's purpose.","The narrative masterfully recounts a well-elaborated event or sequence of events with exceptional detail and depth. The storyline is captivating, demonstrating a sophisticated understanding of narrative techniques."],["The narrative provides no description of actions, thoughts, or feelings. The characters and their motivations are unclear.","The narrative includes minimal descriptions of actions, thoughts, or feelings. The reader has little insight into the characters' experiences.","The narrative includes some descriptions of actions, thoughts, or feelings, but they are superficial and lack depth. The reader gains limited insight into the characters' experiences.","The narrative effectively describes actions, thoughts, and feelings, providing the reader with a reasonable understanding of the characters' experiences.","The narrative vividly describes actions, thoughts, and feelings, creating a strong connection between the reader and the characters. The reader gains significant insight into the characters' experiences.","The narrative masterfully describes actions, thoughts, and feelings, offering profound insights into the characters' experiences. The reader is deeply immersed in the narrative."],["The narrative does not use temporal words to signal event order. The sequence of events is unclear and confusing.","The narrative uses temporal words inconsistently or inaccurately. The sequence of events is difficult to follow.","The narrative uses some temporal words to signal event order, but their use is limited or imprecise. The sequence of events may be somewhat unclear.","The narrative effectively uses temporal words to signal event order, creating a clear and logical sequence of events.","The narrative skillfully uses a variety of temporal words to signal event order, enhancing the clarity and flow of the narrative.","The narrative demonstrates a masterful command of temporal words, using them with precision and artistry to create a seamless and engaging sequence of events."],["The narrative lacks a sense of closure. The ending feels abrupt or incomplete, leaving the reader unsatisfied.","The narrative provides a weak or perfunctory sense of closure. The ending feels rushed or unresolved.","The narrative provides some sense of closure, but it may feel somewhat contrived or unconvincing.","The narrative provides a satisfactory sense of closure, resolving the main conflicts or themes of the story.","The narrative provides a strong and satisfying sense of closure, leaving the reader with a sense of resolution and fulfillment.","The narrative provides an exceptional sense of closure, leaving a lasting impression on the reader and prompting reflection on the narrative's deeper meaning."]]}