{"criteria":["Introduction of Topic","Use of Facts and Definitions","Development of Points","Concluding Statement or Section"],"points":[0,1,2,3,4,5],"descriptions":[["The topic is not clearly introduced, or there is no discernible introduction.","The topic is vaguely introduced with little clarity.","The topic is introduced, but the introduction lacks focus or direction.","The topic is clearly introduced, providing some context for the reader.","The topic is effectively introduced, engaging the reader and providing a clear sense of purpose.","The topic is masterfully introduced, captivating the reader and establishing a strong foundation for the text."],["No facts or definitions are used to develop points.","Few facts or definitions are used, and they are largely irrelevant or inaccurate.","Facts and definitions are used, but they are not well-integrated or clearly connected to the points being made.","Facts and definitions are appropriately used to support and develop points.","Facts and definitions are effectively used to enhance understanding and strengthen arguments.","Facts and definitions are seamlessly integrated, demonstrating a deep understanding of the topic and enhancing the text's credibility."],["Points are not developed, or there is no discernible development of ideas.","Points are superficially developed with minimal supporting evidence.","Points are developed, but the development is inconsistent or lacks depth.","Points are adequately developed with sufficient supporting evidence.","Points are thoroughly developed with insightful analysis and compelling evidence.","Points are masterfully developed, demonstrating a sophisticated understanding of the topic and providing profound insights."],["There is no concluding statement or section, or it is completely missing.","The concluding statement or section is weak, abrupt, or fails to summarize or provide closure.","The concluding statement or section is present but lacks clarity or effectiveness.","The concluding statement or section adequately summarizes the main points and provides closure.","The concluding statement or section effectively summarizes the main points, provides closure, and leaves the reader with a lasting impression.","The concluding statement or section is masterful, providing a profound synthesis of ideas and leaving the reader with a thought-provoking conclusion."]]}