{"criteria":["Focus on Topic","Revision","Editing"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear focus, and the topic is not evident.","The writing demonstrates a limited focus on the topic, with some digressions.","The writing generally focuses on the topic, but there may be occasional lapses in focus.","The writing maintains a clear focus on the topic, with minimal digressions.","The writing demonstrates a strong focus on the topic, with clear connections throughout.","The writing exhibits an exceptional focus on the topic, demonstrating a deep understanding and insightful exploration."],["The writing shows no evidence of revision or attempts to improve the content or structure.","The writing demonstrates minimal revision efforts, with few changes made to the original draft.","The writing shows some evidence of revision, but the changes are superficial and do not significantly improve the overall quality.","The writing demonstrates moderate revision efforts, with some noticeable improvements to the content and structure.","The writing exhibits thoughtful revision, with clear improvements made to the clarity, coherence, and organization of ideas.","The writing showcases extensive and effective revision, resulting in a polished and well-crafted piece that demonstrates a high level of critical thinking."],["The writing is riddled with errors in grammar, spelling, punctuation, and sentence structure, making it difficult to understand.","The writing contains numerous errors in grammar, spelling, punctuation, and sentence structure that impede comprehension.","The writing exhibits several errors in grammar, spelling, punctuation, and sentence structure, but they do not significantly hinder understanding.","The writing contains a few minor errors in grammar, spelling, punctuation, and sentence structure that do not detract from the overall quality.","The writing demonstrates a strong command of grammar, spelling, punctuation, and sentence structure, with only occasional errors.","The writing is virtually free of errors in grammar, spelling, punctuation, and sentence structure, demonstrating exceptional attention to detail and precision."]]}