{"criteria":["Contribution to Research","Collaboration and Teamwork","Quality of Writing","Use of Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not participate in the research process.","Student participates minimally, contributing little to the research effort.","Student contributes occasionally to research, but inconsistently.","Student actively participates in research, contributing relevant information and sources.","Student consistently and effectively contributes to the research process, finding valuable sources and insights.","Student leads the research effort, demonstrating exceptional research skills and providing critical resources."],["Student does not collaborate with team members and works independently.","Student struggles to collaborate and often works separately from the team.","Student collaborates sporadically, sometimes struggling to integrate ideas with others.","Student collaborates effectively with team members, sharing ideas and working towards a common goal.","Student demonstrates strong teamwork skills, actively supporting and encouraging team members.","Student excels in collaborative efforts, facilitating team discussions and ensuring everyone's voice is heard."],["The writing is unclear, disorganized, and lacks coherence.","The writing is difficult to understand and contains numerous errors.","The writing is somewhat clear but needs improvement in organization and clarity.","The writing is clear, organized, and conveys information effectively.","The writing is well-crafted, engaging, and demonstrates a strong command of language.","The writing is exceptional, demonstrating mastery of language, style, and structure."],["Student does not use evidence from research to support writing.","Student attempts to use evidence, but it is irrelevant or inaccurate.","Student uses some evidence, but it is not always integrated effectively.","Student uses relevant evidence to support claims in the writing.","Student effectively integrates evidence to strengthen arguments and provide context.","Student expertly uses evidence to create a compelling and persuasive narrative."]]}