{"criteria":["Clarity and Focus of Argument","Use of Evidence and Support","Organization and Structure","Style and Conventions"],"points":[0,1,2,3,4,5],"descriptions":[["The argument is unclear, unfocused, or missing entirely. The writer does not establish a clear position or purpose.","The argument is vague and lacks a clear focus. The writer's position is difficult to identify.","The argument is somewhat clear but may lack depth or complexity. The writer's position is identifiable but not consistently maintained.","The argument is generally clear and focused, with a discernible position. The writer provides some support for their claims.","The argument is clear, focused, and well-developed, with a strong position. The writer provides solid evidence and reasoning to support their claims.","The argument is exceptionally clear, insightful, and compelling. The writer demonstrates a sophisticated understanding of the topic and presents a persuasive and original position."],["The writing lacks evidence or support for claims. Information is inaccurate or irrelevant.","The writing includes minimal evidence, and the connection to the argument is unclear. Sources may be questionable or unreliable.","The writing uses some evidence to support claims, but the evidence may be weak or insufficient. Sources are generally credible but not always effectively integrated.","The writing uses relevant evidence to support claims. Sources are credible and integrated reasonably well.","The writing effectively uses a variety of credible sources to support claims. Evidence is well-integrated and strengthens the argument.","The writing skillfully integrates compelling and diverse evidence to support claims. The use of evidence demonstrates a deep understanding of the topic and enhances the persuasiveness of the argument."],["The writing lacks organization and coherence. Ideas are presented randomly, and there is no logical flow.","The writing is poorly organized and difficult to follow. Transitions are weak or absent, and ideas seem disconnected.","The writing is somewhat organized, but the structure is inconsistent. Transitions may be awkward, and the flow of ideas is sometimes disrupted.","The writing is generally well-organized with a clear structure. Transitions are present and aid in the flow of ideas.","The writing is logically organized with a clear and effective structure. Transitions are smooth and enhance the flow of ideas.","The writing exhibits a sophisticated and seamless organization. The structure is perfectly tailored to the argument, and transitions are artful and contribute to the overall coherence and impact of the piece."],["The writing contains numerous errors in grammar, mechanics, and usage that impede understanding. The style is inappropriate for the audience and purpose.","The writing contains frequent errors in grammar, mechanics, and usage that distract the reader. The style is inconsistent or ineffective.","The writing contains some errors in grammar, mechanics, and usage, but they do not significantly impede understanding. The style is generally appropriate but may lack sophistication.","The writing is generally free of errors in grammar, mechanics, and usage. The style is clear and appropriate for the audience and purpose.","The writing is polished and demonstrates a strong command of grammar, mechanics, and usage. The style is engaging and enhances the message.","The writing is flawless in its grammar, mechanics, and usage. The style is sophisticated, compelling, and perfectly suited to the audience and purpose. The writer demonstrates mastery of language."]]}