{"criteria":["Introduction and Opinion Statement","Reasons and Supporting Evidence","Use of Linking Words","Concluding Statement or Section"],"points":[0,1,2,3,4,5],"descriptions":[["The piece lacks an introduction and does not clearly state an opinion.","The introduction is weak or missing, and the opinion statement is vague or unclear.","The introduction is present but may be underdeveloped, and the opinion statement is somewhat clear.","The introduction is adequate and presents the topic, and the opinion statement is clearly stated.","The introduction is engaging and effectively presents the topic, and the opinion statement is clear, concise, and compelling.","The introduction is highly engaging and insightful, and the opinion statement is exceptionally clear, concise, and persuasive."],["No reasons are provided to support the opinion.","Reasons are weak, irrelevant, or unsupported.","Reasons are present but lack sufficient development or evidence.","Reasons are relevant and supported with some evidence.","Reasons are well-developed and supported with relevant and credible evidence.","Reasons are insightful, thoroughly developed, and supported with compelling and authoritative evidence."],["Linking words are absent or used incorrectly.","Few linking words are used, and their use is often inappropriate or ineffective.","Linking words are used inconsistently, and their effect on connecting ideas is limited.","Linking words are used appropriately to connect opinion and reasons.","Linking words are used effectively and varied to create a smooth flow of ideas.","Linking words are used masterfully to create a seamless and logical connection between opinion and reasons, enhancing the overall persuasiveness of the piece."],["The piece lacks a conclusion.","The conclusion is abrupt, weak, or unrelated to the opinion.","The conclusion is present but may be repetitive or lack a sense of closure.","The conclusion summarizes the main points and restates the opinion.","The conclusion effectively summarizes the main points, restates the opinion, and provides a thought-provoking final statement.","The conclusion is memorable and insightful, leaving the reader with a lasting impression and a deeper understanding of the opinion."]]}