{"criteria":["Focus and Purpose","Development and Elaboration","Organization and Structure","Language and Style","Conventions and Mechanics"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear focus and purpose. It does not address the prompt or task.","The writing has a vague focus and purpose. It only partially addresses the prompt or task.","The writing demonstrates a general focus and purpose, addressing the prompt or task but lacking depth.","The writing maintains a clear focus and purpose, effectively addressing the prompt or task with sufficient detail.","The writing demonstrates a strong focus and purpose, thoroughly addressing the prompt or task with well-developed ideas.","The writing exhibits an exceptional focus and purpose, masterfully addressing the prompt or task with insightful and comprehensive ideas."],["The writing lacks development and elaboration. Ideas are not supported with evidence or examples.","The writing provides minimal development and elaboration. Ideas are weakly supported with limited evidence or examples.","The writing includes some development and elaboration. Ideas are supported with basic evidence or examples.","The writing demonstrates adequate development and elaboration. Ideas are supported with relevant evidence and examples.","The writing exhibits strong development and elaboration. Ideas are well-supported with specific and convincing evidence and examples.","The writing showcases exceptional development and elaboration. Ideas are richly supported with compelling and insightful evidence and examples."],["The writing lacks organization and structure. Ideas are presented randomly and without coherence.","The writing has a weak organization and structure. Ideas are loosely connected and lack a clear flow.","The writing demonstrates a basic organization and structure. Ideas are generally connected but may lack transitions.","The writing maintains a logical organization and structure. Ideas are clearly connected with effective transitions.","The writing exhibits a strong organization and structure. Ideas are seamlessly connected with sophisticated transitions.","The writing showcases an exceptional organization and structure. Ideas are artfully connected with seamless and impactful transitions."],["The writing demonstrates poor language and style. Word choice is limited, and sentences are awkward or unclear.","The writing exhibits weak language and style. Word choice is basic, and sentences are often unclear or grammatically incorrect.","The writing includes adequate language and style. Word choice is appropriate, and sentences are generally clear and grammatically correct.","The writing demonstrates effective language and style. Word choice is precise, and sentences are clear, varied, and grammatically correct.","The writing exhibits strong language and style. Word choice is sophisticated, and sentences are fluent, varied, and grammatically correct.","The writing showcases exceptional language and style. Word choice is vivid and precise, and sentences are artful, varied, and grammatically flawless."],["The writing contains numerous errors in conventions and mechanics (grammar, spelling, punctuation, capitalization).","The writing contains frequent errors in conventions and mechanics that interfere with readability.","The writing contains some errors in conventions and mechanics but does not significantly interfere with readability.","The writing demonstrates control of conventions and mechanics with few errors.","The writing exhibits strong control of conventions and mechanics with minimal errors.","The writing showcases exceptional control of conventions and mechanics with virtually no errors."]]}