{"criteria":["Technology Use and Production","Keyboarding Skills","Collaboration and Interaction","Following Instructions"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no use of technology in producing and publishing writing.","Student attempts to use technology with significant errors and minimal output.","Student uses technology to produce writing with frequent errors and limited collaboration.","Student uses technology to produce and publish writing with some errors and limited collaboration.","Student effectively uses technology to produce and publish writing with few errors and some collaboration.","Student skillfully uses technology to produce and publish polished writing, effectively interacting and collaborating with others."],["Student's keyboarding skills are non-existent, hindering their ability to produce written work.","Student's keyboarding skills are extremely limited, significantly slowing down the writing process.","Student's keyboarding skills are weak, resulting in frequent errors and a slow writing pace.","Student's keyboarding skills are adequate, but errors and speed occasionally impede the writing process.","Student's keyboarding skills are proficient, allowing for efficient and accurate writing.","Student's keyboarding skills are exceptional, enabling fluid and effortless writing with high accuracy."],["Student does not interact or collaborate with others.","Student attempts interaction but is unsuccessful or disruptive.","Student interacts minimally with others, showing little collaboration.","Student interacts and collaborates with others, but inconsistently.","Student interacts and collaborates effectively with others, enhancing the writing process.","Student actively and skillfully interacts and collaborates with others, leading to significant improvements in the final product."],["Student does not follow any instructions when using technology for writing and collaboration.","Student attempts to follow instructions but misunderstands or disregards most of them.","Student follows some instructions but misses key details or steps.","Student generally follows instructions but may require reminders or clarification.","Student accurately follows instructions with minimal prompting.","Student meticulously follows all instructions and proactively seeks clarification when needed, ensuring precise and effective technology use."]]}