{"criteria":["Ability to write routinely over extended time frames, demonstrating research, reflection, and revision skills.","Capacity to write effectively within shorter time frames (single sitting or a day or two).","Skill in adapting writing for a range of discipline-specific tasks.","Awareness and consideration of purpose and audience in writing."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no ability to write routinely over extended time frames; no evidence of research, reflection, or revision.","Shows minimal ability to write routinely; research, reflection, and revision are largely absent or poorly executed.","Demonstrates limited ability to write routinely; research, reflection, and revision are present but underdeveloped.","Writes routinely over extended time frames with moderate effectiveness; research, reflection, and revision are evident but could be more thorough.","Writes routinely over extended time frames effectively, showing good research, reflection, and revision skills.","Writes routinely over extended time frames with high proficiency, demonstrating excellent research, reflection, and revision skills, resulting in a polished piece."],["Unable to write effectively within shorter time frames; work is incomplete or incoherent.","Struggles to write within shorter time frames; writing is rushed and lacks clarity.","Demonstrates some ability to write within shorter time frames, but the quality is inconsistent.","Writes adequately within shorter time frames, producing a coherent but not exceptional piece.","Writes well within shorter time frames, producing a clear and effective piece of writing.","Writes exceptionally well within shorter time frames, producing a polished, insightful, and well-structured piece."],["Unable to adapt writing for different discipline-specific tasks.","Shows minimal understanding of how to adapt writing for different tasks.","Adapts writing for some tasks, but struggles with others.","Adapts writing for a range of tasks with moderate success.","Adapts writing effectively for a variety of discipline-specific tasks.","Demonstrates mastery in adapting writing for a wide range of discipline-specific tasks, showcasing versatility and understanding of different writing styles."],["Shows no awareness of purpose or audience in writing.","Demonstrates limited awareness of purpose or audience.","Shows some consideration of purpose and audience, but inconsistently.","Considers purpose and audience in writing, but may not fully address their needs.","Effectively tailors writing to suit the intended purpose and audience.","Demonstrates exceptional skill in crafting writing that is perfectly suited to its purpose and resonates deeply with the intended audience."]]}