{"criteria":["Establishment of Situation and Characters","Organization of Event Sequence","Use of Dialogue, Actions, Thoughts, and Feelings","Use of Temporal Words and Phrases","Sense of Closure"],"points":[0,1,2,3,4,5],"descriptions":[["The narrative lacks a clear situation and does not introduce any narrator or characters.","The narrative attempts to establish a situation, but it is vague or confusing. Narrator\/characters are weakly introduced.","The narrative establishes a basic situation and introduces a narrator\/characters, but lacks detail and clarity.","The narrative clearly establishes a situation and introduces a narrator\/characters with adequate detail and clarity.","The narrative effectively establishes a compelling situation and introduces well-defined narrator\/characters with strong detail and clarity.","The narrative masterfully establishes a vivid and engaging situation and introduces memorable narrator\/characters with exceptional detail and clarity."],["The narrative lacks any discernible event sequence, appearing disjointed and random.","The narrative attempts to organize an event sequence, but it is confusing and difficult to follow.","The narrative presents a basic event sequence, but the connections between events are weak and unclear.","The narrative presents a logical event sequence that unfolds naturally, with clear connections between events.","The narrative presents a compelling and well-organized event sequence that enhances the story's impact.","The narrative presents a masterful event sequence that is perfectly paced and seamlessly integrated, creating a captivating reading experience."],["The narrative includes no dialogue or descriptions of actions, thoughts, or feelings.","The narrative attempts to use dialogue and descriptions, but they are weak, generic, or irrelevant.","The narrative uses some dialogue and descriptions, but they are not well-integrated or impactful.","The narrative effectively uses dialogue and descriptions to develop experiences and events or show character responses.","The narrative skillfully uses dialogue and descriptions to create vivid experiences and compelling character responses.","The narrative masterfully uses dialogue and descriptions to create immersive experiences and deeply resonant character responses."],["The narrative does not use any temporal words or phrases.","The narrative uses few temporal words and phrases, and they are used incorrectly or ineffectively.","The narrative uses some temporal words and phrases, but their use is inconsistent or adds little to the clarity of the event order.","The narrative consistently uses temporal words and phrases to clearly signal the event order.","The narrative skillfully uses a variety of temporal words and phrases to enhance the clarity and flow of the event order.","The narrative masterfully uses a rich array of temporal words and phrases to create a seamless and engaging event order."],["The narrative lacks any sense of closure, ending abruptly or without resolution.","The narrative attempts to provide closure, but it is weak, rushed, or confusing.","The narrative provides a basic sense of closure, but it is not fully satisfying or complete.","The narrative provides a clear and satisfying sense of closure, resolving the main events and themes.","The narrative provides a thoughtful and impactful sense of closure that leaves a lasting impression.","The narrative provides a masterful sense of closure that is both satisfying and thought-provoking, leaving the reader with a profound sense of completion."]]}