{"criteria":["Development of Ideas","Organization and Structure","Use of Language and Conventions"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a central idea or purpose and demonstrates no development of ideas.","The writing shows a limited understanding of the task and purpose, with minimal development of ideas.","The writing demonstrates a basic understanding of the task and purpose, with some development of ideas, but lacks depth and consistency.","The writing demonstrates a clear understanding of the task and purpose, with a moderate development of ideas and some supporting details.","The writing demonstrates a strong understanding of the task and purpose, with well-developed ideas and relevant supporting details.","The writing demonstrates a comprehensive understanding of the task and purpose, with fully developed ideas, compelling supporting details, and insightful analysis."],["The writing lacks a clear organizational structure and coherence, making it difficult to follow the writer's train of thought.","The writing demonstrates a limited organizational structure with minimal coherence, making it challenging to follow the writer's train of thought.","The writing demonstrates a basic organizational structure with some coherence, but lacks consistency and transitions.","The writing demonstrates a clear organizational structure with moderate coherence, including a discernible introduction, body paragraphs, and conclusion.","The writing demonstrates a strong organizational structure with well-developed coherence, including a clear introduction, logically sequenced body paragraphs, and a satisfying conclusion.","The writing demonstrates a sophisticated organizational structure with seamless coherence, including an engaging introduction, logically sequenced and unified body paragraphs, and a thoughtful conclusion that leaves a lasting impression."],["The writing demonstrates frequent errors in grammar, mechanics, and usage that impede understanding.","The writing demonstrates numerous errors in grammar, mechanics, and usage that distract from the content.","The writing demonstrates some errors in grammar, mechanics, and usage that occasionally interfere with understanding.","The writing demonstrates general control of grammar, mechanics, and usage, with only minor errors that do not impede understanding.","The writing demonstrates a strong command of grammar, mechanics, and usage, with only occasional errors that do not detract from the overall quality.","The writing demonstrates exceptional command of grammar, mechanics, and usage, with virtually no errors and a sophisticated use of language."]]}