{"criteria":["Introduction and Organization","Development of Topic","Use of Linking Words and Phrases","Concluding Statement or Section"],"points":[0,1,2,3,4,5],"descriptions":[["The text lacks a clear introduction and the information is not grouped logically. No illustrations are present.","The introduction is weak or unclear, and the organization of information is inconsistent. Few or irrelevant illustrations are included.","The introduction is present but basic, and the organization of information is somewhat logical. Illustrations are present but may not always aid comprehension.","The text introduces the topic and groups related information, but the organization could be improved. Illustrations are included and generally aid comprehension.","The introduction is engaging and clearly presents the topic, and the information is logically grouped. Illustrations enhance understanding effectively.","The introduction is compelling and provides a strong sense of purpose, and the information is expertly organized for maximum clarity. Illustrations are thoughtfully integrated to significantly enhance comprehension."],["The topic is not developed with facts, definitions, or details.","The topic is minimally developed with few facts, definitions, or details.","The topic is somewhat developed with some facts, definitions, and details, but lacks depth.","The topic is developed with relevant facts, definitions, and details that provide sufficient information.","The topic is well-developed with a variety of relevant and specific facts, definitions, and details that enhance understanding.","The topic is expertly developed with insightful and comprehensive facts, definitions, and details that demonstrate a deep understanding."],["Linking words and phrases are absent or used incorrectly.","Few linking words and phrases are used, and they may not always connect ideas effectively.","Some linking words and phrases are used, but their application is inconsistent.","Linking words and phrases are used to connect ideas within categories of information.","Linking words and phrases are used effectively to create smooth transitions between ideas and categories of information.","Linking words and phrases are used masterfully to create seamless transitions and enhance the overall coherence of the text."],["There is no concluding statement or section.","The concluding statement or section is weak or missing key elements.","The concluding statement or section is present but basic.","A concluding statement or section is provided, summarizing the main points.","The concluding statement or section effectively summarizes the main points and provides closure.","The concluding statement or section provides a strong and memorable conclusion that reinforces the main ideas and leaves a lasting impression."]]}