{"criteria":["Introduction and Opinion Statement","Reasons Supporting Opinion","Use of Linking Words and Phrases","Concluding Statement or Section"],"points":[0,1,2,3,4,5],"descriptions":[["The piece lacks an introduction or fails to state an opinion. There is no clear organizational structure.","The introduction is weak or unclear, and the opinion statement is vague. The organizational structure is rudimentary.","The introduction is present but may lack focus. The opinion statement is identifiable but could be clearer. The organizational structure is basic.","The introduction clearly presents the topic, and the opinion statement is evident. The organizational structure is logical and lists reasons.","The introduction is engaging and clearly states the topic and opinion. The organizational structure is well-defined and effectively lists reasons.","The introduction is compelling and expertly introduces the topic and opinion. The organizational structure is sophisticated and enhances the argument."],["No reasons are provided, or the reasons provided do not support the opinion.","Reasons are weak, irrelevant, or lack connection to the opinion.","Reasons are present but may be generic or lack sufficient support for the opinion.","Reasons are relevant and generally support the opinion with some explanation.","Reasons are strong and provide clear support for the opinion with detailed explanation.","Reasons are compelling, insightful, and powerfully support the opinion with thorough and persuasive explanation."],["Linking words and phrases are absent.","Linking words and phrases are used incorrectly or are very limited.","Linking words and phrases are used, but usage is infrequent or sometimes inappropriate.","Linking words and phrases are used effectively to connect opinion and reasons in most instances.","Linking words and phrases are used skillfully to create smooth transitions and connections between ideas.","Linking words and phrases are used masterfully to enhance the clarity, flow, and persuasiveness of the argument."],["The piece lacks a concluding statement or section.","The conclusion is abrupt, missing, or does not relate to the opinion.","The conclusion is present but weak, generic, or doesn't summarize the main points effectively.","The conclusion summarizes the main points and restates the opinion.","The conclusion reinforces the opinion with a thoughtful summary and leaves the reader with a strong sense of closure.","The conclusion is memorable and provides a powerful restatement of the opinion, leaving the reader with a lasting impression and a deeper understanding of the topic."]]}