{"criteria":["Clarity and Focus","Use of Evidence and Reasoning","Organization and Structure","Language and Style"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear central claim or focus and is difficult to understand.","The writing has a vague central claim, but it is not consistently maintained throughout the essay.","The writing presents a central claim, but it may lack clarity or consistency.","The writing presents a clear central claim with some consistency.","The writing presents a clear and focused central claim that is consistently maintained throughout the essay.","The writing presents a compelling and insightful central claim that is masterfully maintained, demonstrating a deep understanding of the topic."],["The writing provides no evidence or reasoning to support the claim.","The writing provides minimal and irrelevant evidence or reasoning to support the claim.","The writing provides some evidence or reasoning, but it is weak or poorly connected to the claim.","The writing provides adequate evidence and reasoning to support the claim.","The writing provides strong and relevant evidence and reasoning to effectively support the claim.","The writing provides compelling evidence and insightful reasoning to persuasively support the claim, demonstrating a nuanced understanding of the text."],["The writing lacks any discernible organization or structure.","The writing is poorly organized and difficult to follow.","The writing has a basic organizational structure, but it may be inconsistent or confusing.","The writing is adequately organized with a clear beginning, middle, and end.","The writing is well-organized with a logical flow of ideas and effective transitions.","The writing is skillfully organized with a sophisticated structure that enhances the clarity and impact of the argument."],["The writing contains numerous errors in grammar, mechanics, and usage, making it difficult to understand.","The writing contains frequent errors in grammar, mechanics, and usage that distract from the message.","The writing contains some errors in grammar, mechanics, and usage, but they do not significantly impede understanding.","The writing demonstrates adequate command of grammar, mechanics, and usage with few errors.","The writing demonstrates strong command of grammar, mechanics, and usage with minimal errors.","The writing demonstrates exceptional command of language and style, using sophisticated vocabulary and sentence structure to effectively communicate the message."]]}