{"criteria":["Focus and Topic Selection","Information Gathering","Organization and Structure","Synthesis and Analysis","Clarity and Presentation"],"points":[0,1,2,3,4,5],"descriptions":[["The research project lacks a clear focus and the topic is undefined or irrelevant.","The research project has a vague focus, and the topic is broad or loosely related to the assignment.","The research project identifies a general topic, but the focus could be clearer and more specific.","The research project has a defined topic with a clear focus, demonstrating an understanding of the research goal.","The research project showcases a well-defined topic with a sharp focus, indicating a strong understanding of the research goal and its significance.","The research project presents an exceptionally well-defined and focused topic that is relevant, engaging, and demonstrates a sophisticated understanding of the research's purpose and potential impact."],["No attempt was made to gather information, or the sources are entirely missing.","Very few sources are used, and they are of questionable reliability or relevance.","Some sources are used, but they may not be entirely reliable or directly relevant to the topic. There are gaps in information.","A variety of sources are used, with most being reliable and relevant to the topic. Information is generally accurate and sufficient.","A wide range of credible and relevant sources are used effectively to gather comprehensive information, demonstrating thorough research.","Extensive and diverse high-quality sources are expertly integrated to provide a comprehensive and insightful understanding of the topic, demonstrating exceptional research skills."],["The research project is completely disorganized and lacks any logical structure.","The research project is poorly organized, making it difficult to follow the information presented.","The research project has some organization, but there are inconsistencies and a lack of clear transitions between ideas.","The research project is logically organized with a clear structure that supports the presentation of information.","The research project is well-organized with a coherent structure, including a clear introduction, body, and conclusion, enhancing the reader's understanding.","The research project exhibits an exceptionally well-organized and coherent structure, demonstrating a sophisticated command of organization that significantly enhances the clarity, impact, and flow of information."],["There is no evidence of synthesis or analysis of information from different sources.","Minimal attempt is made to synthesize information, and analysis is superficial or missing.","Some synthesis of information is present, but analysis is basic and lacks depth.","Information from different sources is synthesized and analyzed to draw conclusions and insights.","Information is effectively synthesized and analyzed, demonstrating critical thinking and a deeper understanding of the topic.","Information is expertly synthesized and analyzed, revealing insightful conclusions and demonstrating a nuanced understanding of complex relationships within the research topic."],["The research project is unclear, poorly written, and difficult to understand.","The writing is confusing, with numerous errors and a lack of clarity in the presentation of information.","The writing is generally understandable, but there are some areas where clarity could be improved. Errors are present but not pervasive.","The research project is clear, well-written, and easy to understand. Information is presented logically and effectively.","The research project is exceptionally clear, concise, and engaging. The presentation of information is polished and enhances the reader's understanding.","The research project is presented with exceptional clarity, eloquence, and precision, captivating the audience and conveying complex ideas with remarkable finesse."]]}