{"criteria":["Accuracy of Information Recall\/Gathering","Effectiveness of Note-Taking","Organization and Sorting of Evidence"],"points":[0,1,2,3,4,5],"descriptions":[["Information recalled or gathered is entirely inaccurate or irrelevant to the topic. No sources are used.","Information recalled or gathered is mostly inaccurate and\/or irrelevant. Sources, if present, are unreliable.","Information recalled or gathered contains some inaccuracies or is partially relevant. Sources are questionable.","Information recalled or gathered is generally accurate and relevant, with minor inaccuracies. Sources are mostly reliable.","Information recalled or gathered is accurate and relevant. Sources are reliable and appropriate.","Information recalled or gathered is exceptionally accurate, insightful, and directly relevant. Sources are exemplary and authoritative."],["No notes are taken, or notes are completely incomprehensible and unusable.","Notes are sparse, disorganized, and difficult to understand, lacking key information.","Notes are somewhat organized but miss important details; understanding the notes requires significant effort.","Notes are generally organized and capture most important details, aiding in understanding the information.","Notes are well-organized, detailed, and clearly summarize the key information from the sources.","Notes are exceptionally detailed, insightful, and well-organized, demonstrating a comprehensive understanding of the material and its nuances."],["Evidence is not sorted, or the sorting method is nonsensical and does not align with provided categories.","Evidence is poorly sorted, with most items placed in incorrect or inappropriate categories.","Evidence is sorted with limited accuracy; many items are misplaced or do not fit the provided categories.","Evidence is generally sorted correctly, with most items placed in appropriate categories.","Evidence is sorted accurately and efficiently, with all items clearly aligned with the provided categories.","Evidence is sorted with exceptional precision and insight, demonstrating a sophisticated understanding of the categories and the relationships between evidence items."]]}