{"criteria":["Planning and Organization","Revisions and Editing","Command of Language Standards 1-3 (Grade 3 Level)"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence of planning or organization is present. The writing is disjointed and lacks a clear direction.","Minimal planning is evident. The writing shows some attempt at organization, but it is weak and inconsistent.","Basic planning is evident. The writing has a discernible structure, but it may lack focus or coherence in places.","Adequate planning and organization are demonstrated. The writing is generally well-structured with a clear focus, although some minor inconsistencies may be present.","Well-developed planning and organization are evident. The writing is logically structured and demonstrates a clear focus and coherence throughout.","Exceptional planning and organization are demonstrated. The writing exhibits a sophisticated structure, a clear and compelling focus, and seamless coherence, enhancing the overall impact of the writing."],["No revisions or editing are evident. Numerous errors in grammar, mechanics, and usage detract significantly from the writing.","Minimal revisions or editing are attempted. Frequent errors in grammar, mechanics, and usage impede understanding.","Some revisions and editing are evident, but errors in grammar, mechanics, and usage are still noticeable and distracting.","Adequate revisions and editing are demonstrated. The writing contains few errors in grammar, mechanics, and usage, and they do not significantly impede understanding.","Thorough revisions and editing are evident. The writing is largely free of errors in grammar, mechanics, and usage, enhancing clarity and readability.","Exceptional revisions and editing are demonstrated. The writing is polished and refined, exhibiting impeccable grammar, mechanics, and usage, elevating the overall quality of the writing."],["Demonstrates no understanding of basic grammar and sentence structure. Errors in capitalization, punctuation, and spelling are pervasive.","Demonstrates limited understanding of basic grammar and sentence structure. Frequent errors in capitalization, punctuation, and spelling interfere with comprehension.","Demonstrates some understanding of basic grammar and sentence structure. Errors in capitalization, punctuation, and spelling are present but do not significantly impede comprehension.","Demonstrates adequate command of basic grammar and sentence structure. Minor errors in capitalization, punctuation, and spelling are present but do not detract from overall clarity.","Demonstrates strong command of basic grammar and sentence structure. Few errors in capitalization, punctuation, and spelling are present.","Demonstrates exceptional command of basic grammar and sentence structure. Writing is virtually free of errors in capitalization, punctuation, and spelling."]]}