{"criteria":["Clarity and Coherence","Development","Organization","Task, Purpose, and Audience"],"points":[0,1,2,3,4,5],"descriptions":[["Writing lacks clarity and coherence; difficult to understand the main idea.","Writing shows limited clarity and coherence; the main idea is difficult to follow.","Writing demonstrates some clarity and coherence; the main idea is present but not always easy to follow.","Writing is mostly clear and coherent; the main idea is generally easy to follow.","Writing is clear and coherent; the main idea is easy to follow and enhances the reader's understanding.","Writing is exceptionally clear, coherent, and engaging; the main idea is compelling and maintains the reader's interest throughout."],["Writing lacks development; supporting details are missing or irrelevant.","Writing shows minimal development; supporting details are weak or insufficient.","Writing demonstrates some development; supporting details are present but not always relevant or strong.","Writing is adequately developed; supporting details are generally relevant and provide some support.","Writing is well-developed; supporting details are relevant, strong, and enhance the main idea.","Writing is exceptionally well-developed; supporting details are compelling, insightful, and significantly enhance the main idea."],["Writing lacks organization; ideas are presented randomly and are difficult to follow.","Writing shows limited organization; ideas are loosely connected and may be confusing.","Writing demonstrates some organization; ideas are generally connected but transitions may be weak.","Writing is adequately organized; ideas are logically connected with clear transitions.","Writing is well-organized; ideas are logically sequenced with smooth and effective transitions.","Writing is exceptionally well-organized; ideas are presented in a compelling sequence with seamless and sophisticated transitions."],["Writing does not address the task, purpose, or audience.","Writing minimally addresses the task, purpose, or audience.","Writing partially addresses the task, purpose, and audience.","Writing adequately addresses the task, purpose, and audience.","Writing effectively addresses the task, purpose, and audience.","Writing masterfully addresses the task, purpose, and audience, demonstrating a deep understanding of the rhetorical situation."]]}