{"criteria":["Introduction and Organization: Assesses the clarity of the introduction, the logical grouping of information into paragraphs and sections, and the effective use of formatting, illustrations, and multimedia.","Development of Topic: Evaluates the use of facts, definitions, concrete details, quotations, and other relevant information and examples to develop the topic.","Linking of Ideas: Assesses the use of words and phrases to link ideas within categories of information.","Use of Language: Evaluates the use of precise language and domain-specific vocabulary to inform about or explain the topic.","Concluding Statement: Assesses the presence and relevance of a concluding statement or section."],"points":[0,1,2,3,4,5],"descriptions":[["The introduction is missing or unclear. Information is not grouped logically, and there is no use of formatting, illustrations, or multimedia.","The introduction is present but lacks clarity. Information is loosely grouped, and formatting, illustrations, or multimedia are minimal or ineffective.","The introduction is somewhat clear, and information is grouped into paragraphs and sections. Formatting, illustrations, or multimedia are present but not always effective.","The introduction is clear and provides context for the topic. Information is logically grouped, and formatting, illustrations, or multimedia enhance comprehension.","The introduction is engaging and clearly introduces the topic. Information is effectively organized, and formatting, illustrations, or multimedia significantly aid comprehension.","The introduction is compelling and masterfully introduces the topic. Information is seamlessly organized, and formatting, illustrations, or multimedia are expertly integrated to maximize comprehension."],["The topic is not developed with facts, definitions, details, quotations, or examples.","The topic is minimally developed with few facts, definitions, details, quotations, or examples.","The topic is somewhat developed with some facts, definitions, details, quotations, or examples, but relevance is not always clear.","The topic is adequately developed with relevant facts, definitions, details, quotations, and examples.","The topic is well-developed with specific and relevant facts, definitions, details, quotations, and examples that support the main ideas.","The topic is comprehensively developed with compelling and insightful facts, definitions, details, quotations, and examples that demonstrate a deep understanding."],["Ideas are not linked, and there is no use of transitional words or phrases.","Ideas are poorly linked, and transitional words or phrases are minimal or inappropriate.","Ideas are somewhat linked with basic transitional words or phrases.","Ideas are linked within categories of information using appropriate transitional words and phrases.","Ideas are clearly and effectively linked, creating a smooth and logical flow of information.","Ideas are seamlessly and artfully linked, demonstrating a mastery of transitions and enhancing the overall coherence of the text."],["Language is imprecise, and there is no use of domain-specific vocabulary.","Language is vague, and the use of domain-specific vocabulary is minimal or inappropriate.","Language is somewhat precise, and some domain-specific vocabulary is used.","Language is precise, and domain-specific vocabulary is used appropriately to inform about or explain the topic.","Language is precise and sophisticated, and domain-specific vocabulary is used effectively to enhance understanding.","Language is exceptionally precise and nuanced, and domain-specific vocabulary is used masterfully to convey complex ideas with clarity and impact."],["There is no concluding statement or section.","The concluding statement or section is weak or irrelevant to the information presented.","The concluding statement or section is present but lacks clarity or depth.","The concluding statement or section summarizes the information or explanation presented.","The concluding statement or section effectively summarizes the information and provides a sense of closure.","The concluding statement or section provides a thoughtful and insightful summary, leaving the reader with a clear understanding of the topic."]]}