{"criteria":["Recalls information from experiences or gathers information from sources.","Takes notes, paraphrases, and categorizes information effectively.","Provides a comprehensive and accurate list of sources."],"points":[0,1,2,3,4,5],"descriptions":[["Does not recall any information or gather information from sources.","Recalls very little information or gathers information from very few sources. Information is irrelevant or inaccurate.","Recalls some information or gathers information from a limited number of sources. Some information may be irrelevant or inaccurate.","Recalls relevant information or gathers information from an adequate number of sources. Most information is accurate and relevant.","Recalls mostly relevant information or gathers information from a variety of sources. Information is accurate and relevant.","Effectively recalls relevant information or gathers information from a comprehensive range of sources. Information is consistently accurate and relevant."],["Does not take notes, paraphrase, or categorize information.","Attempts to take notes, paraphrase, or categorize information, but is largely unsuccessful.","Takes notes, paraphrases, or categorizes information with limited effectiveness. Organization is lacking.","Takes notes, paraphrases, and categorizes information adequately. Organization is present but could be improved.","Takes notes, paraphrases, and categorizes information effectively. Organization is clear and logical.","Masterfully takes notes, paraphrases, and categorizes information. Organization is exceptionally clear, logical, and enhances understanding."],["No list of sources is provided.","Provides a list of sources that is incomplete or contains inaccuracies.","Provides a list of sources with some omissions or inaccuracies.","Provides a list of sources that is mostly complete and accurate.","Provides a complete and accurate list of sources with minor errors.","Provides a comprehensive, accurate, and properly formatted list of sources."]]}