{"criteria":["Quality and Relevance of Evidence","Application of Reading Standards (Grade 4 - Literature)","Application of Reading Standards (Grade 4 - Informational Texts)","Clarity and Precision of Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence presented or evidence is completely irrelevant to the analysis, reflection, or research.","Evidence is sparse and\/or demonstrates minimal connection to the analysis, reflection, or research.","Some evidence is presented, but its relevance or connection to the analysis, reflection, or research is unclear or weak.","Evidence is adequately presented and generally relevant to the analysis, reflection, or research.  Connections are mostly clear.","Evidence is well-chosen and clearly relevant, effectively supporting the analysis, reflection, or research.","Evidence is compelling, insightful, and precisely supports a sophisticated analysis, reflection, or research with clear and strong connections."],["Demonstrates no understanding or application of Grade 4 Reading standards for literature.","Demonstrates very limited understanding or application of Grade 4 Reading standards for literature.","Demonstrates some understanding, but application of Grade 4 Reading standards for literature is inconsistent or inaccurate.","Demonstrates adequate understanding and generally applies Grade 4 Reading standards for literature appropriately.","Demonstrates thorough understanding and effectively applies Grade 4 Reading standards for literature.","Demonstrates sophisticated understanding and seamlessly integrates Grade 4 Reading standards for literature in an insightful way."],["Demonstrates no understanding or application of Grade 4 Reading standards for informational texts.","Demonstrates very limited understanding or application of Grade 4 Reading standards for informational texts.","Demonstrates some understanding, but application of Grade 4 Reading standards for informational texts is inconsistent or inaccurate.","Demonstrates adequate understanding and generally applies Grade 4 Reading standards for informational texts appropriately.","Demonstrates thorough understanding and effectively applies Grade 4 Reading standards for informational texts.","Demonstrates sophisticated understanding and seamlessly integrates Grade 4 Reading standards for informational texts in an insightful way."],["Explanations are absent or incomprehensible.","Explanations are vague, confusing, and lack precision.","Explanations are somewhat understandable but lack clarity and precision in places.","Explanations are generally clear and precise, with minor areas for improvement.","Explanations are clear, precise, and easy to follow, demonstrating a strong understanding.","Explanations are exceptionally clear, precise, and insightful, demonstrating a mastery of understanding."]]}