{"criteria":["Ability to write routinely over extended time frames for various purposes.","Ability to write routinely over shorter time frames for various purposes.","Ability to write for a range of discipline-specific tasks.","Ability to write for a range of audiences."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no ability to write over extended time frames or for varied purposes.","Rarely writes over extended time frames; struggles to adapt writing for different purposes.","Sometimes writes over extended time frames; limited adaptation for different purposes.","Writes over extended time frames with moderate consistency; attempts to adapt writing for different purposes.","Consistently writes over extended time frames; effectively adapts writing for different purposes.","Writes routinely and effectively over extended time frames, seamlessly adapting style and content for a wide range of purposes."],["Demonstrates no ability to write over shorter time frames or for varied purposes.","Rarely writes over shorter time frames; struggles to adapt writing for different purposes.","Sometimes writes over shorter time frames; limited adaptation for different purposes.","Writes over shorter time frames with moderate consistency; attempts to adapt writing for different purposes.","Consistently writes over shorter time frames; effectively adapts writing for different purposes.","Writes routinely and effectively over shorter time frames, seamlessly adapting style and content for a wide range of purposes."],["Unable to produce writing for any discipline-specific task.","Struggles to complete discipline-specific tasks in writing.","Completes some discipline-specific tasks in writing with difficulty.","Adequately completes discipline-specific tasks in writing.","Skillfully completes most discipline-specific tasks in writing.","Expertly completes a wide range of discipline-specific tasks in writing with notable insight."],["Shows no awareness of audience in writing.","Rarely considers audience in writing.","Sometimes considers audience in writing, but inconsistently.","Generally considers audience in writing and makes some appropriate adjustments.","Consistently tailors writing to suit the intended audience.","Masterfully crafts writing to engage and resonate with diverse audiences."]]}