{"criteria":["Focus and Purpose: How well does the research project maintain a clear focus on a specific topic and address a well-defined purpose?","Research and Investigation: How effectively does the project demonstrate thorough research and investigation of different aspects of the topic?","Sources and Evidence: How well does the project utilize credible sources and relevant evidence to support claims and build knowledge?","Organization and Structure: How effectively is the project organized and structured to present information clearly and logically?"],"points":[0,1,2,3,4,5],"descriptions":[["The project lacks a clear focus or purpose, and the topic is too broad or undefined.","The project demonstrates a vague focus and purpose, with some inconsistencies in addressing the topic.","The project generally maintains a focus and purpose, but there may be minor digressions or lack of clarity.","The project maintains a clear focus and purpose, addressing a specific topic with minimal digressions.","The project demonstrates a strong focus and purpose, effectively addressing a well-defined topic with clarity and precision.","The project exhibits an exceptional focus and purpose, demonstrating a deep understanding of the topic and a sophisticated approach to the research question."],["The project lacks evidence of research or investigation, relying on personal opinions or unsubstantiated claims.","The project demonstrates minimal research and investigation, with limited exploration of different aspects of the topic.","The project shows some evidence of research and investigation, but the exploration of different aspects of the topic is superficial.","The project demonstrates adequate research and investigation, exploring different aspects of the topic with reasonable depth.","The project demonstrates thorough research and investigation, exploring different aspects of the topic with depth and insight.","The project exhibits exceptional research and investigation, demonstrating a comprehensive understanding of the topic and a sophisticated approach to exploring different perspectives."],["The project lacks credible sources or relevant evidence to support claims, relying on unreliable or inappropriate sources.","The project utilizes few credible sources and limited relevant evidence, with weak support for claims.","The project utilizes some credible sources and relevant evidence, but the support for claims may be inconsistent or superficial.","The project utilizes credible sources and relevant evidence to support claims, demonstrating a reasonable understanding of the topic.","The project effectively utilizes credible sources and relevant evidence to support claims, demonstrating a strong understanding of the topic.","The project demonstrates exceptional utilization of credible sources and relevant evidence to support claims, exhibiting a deep understanding of the topic and a sophisticated approach to knowledge building."],["The project lacks organization or structure, making it difficult to follow the information or understand the connections between ideas.","The project demonstrates minimal organization and structure, with significant inconsistencies in the presentation of information.","The project shows some organization and structure, but there may be confusion or lack of clarity in the presentation of information.","The project demonstrates adequate organization and structure, presenting information clearly and logically with minimal inconsistencies.","The project is well-organized and structured, presenting information clearly and logically with effective transitions and connections between ideas.","The project exhibits exceptional organization and structure, presenting information with clarity, coherence, and sophistication, demonstrating a deep understanding of rhetorical principles."]]}