{"criteria":["Planning and Organization: Assesses the student's ability to effectively plan and organize their writing with guidance and support.","Revisions and Improvements: Evaluates the student's ability to revise their work and make meaningful improvements based on feedback and self-reflection.","Editing for Conventions: Focuses on the student's ability to edit their work for grammatical correctness, punctuation, spelling, and capitalization (Language standards 1-3 up to grade 5).","Experimentation and Risk-Taking: Assesses the student's willingness to try new approaches and take risks in their writing, demonstrating creativity and innovation."],"points":[0,1,2,3,4,5],"descriptions":[["No discernible plan or organization; writing appears random and lacks direction.","Minimal planning evident; organization is weak and inconsistent, making the writing difficult to follow.","Some planning evident, but organization is basic and may lack coherence in certain areas.","Adequate planning and organization; writing generally flows logically with minor inconsistencies.","Well-developed plan and clear organization; writing is coherent and easy to follow, with logical transitions.","Exceptional planning and sophisticated organization; writing is highly coherent, engaging, and effectively structured to enhance the message."],["No revisions made or attempted; the original writing remains unchanged despite obvious flaws.","Minimal revisions attempted; changes are superficial and do not significantly improve the quality of the writing.","Some revisions made, but improvements are limited; may address some surface-level issues but not deeper structural or content problems.","Adequate revisions made; improvements are noticeable, addressing some key areas for enhancement.","Thoughtful revisions implemented; writing demonstrates significant improvement in clarity, coherence, and overall quality.","Extensive and insightful revisions; writing is substantially improved, demonstrating a strong commitment to excellence and refinement."],["Numerous errors in grammar, punctuation, spelling, and capitalization; writing is difficult to understand due to pervasive errors.","Frequent errors in conventions; errors often interfere with the reader's understanding.","Some errors in conventions, but meaning is generally clear; errors may distract the reader at times.","Few errors in conventions; writing is generally clean and polished, with only minor errors.","Minimal errors in conventions; writing is clear, concise, and demonstrates a strong command of basic conventions.","Virtually error-free; writing is polished and refined, demonstrating an exceptional command of language conventions."],["No evidence of experimentation or risk-taking; writing is formulaic and lacks originality.","Minimal experimentation attempted; any new approaches are hesitant and lack confidence.","Some experimentation evident, but results are mixed; may try a new technique but not fully commit to it.","Adequate experimentation; demonstrates a willingness to try new approaches, with some success.","Thoughtful experimentation; takes risks in writing that enhance the message and engage the reader.","Bold and innovative experimentation; writing is highly original and demonstrates a fearless approach to creativity."]]}