{"criteria":["Introduction and Focus","Development with Evidence","Linking of Ideas","Use of Language","Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["The introduction is missing or completely unclear. The topic is not identified.","The introduction is weak and provides little clarity. The topic is vaguely identified.","The introduction is present but lacks focus. The topic is generally identified but may be broad.","The introduction clearly states the topic, provides a general observation, and attempts to focus the information.","The introduction is engaging, clearly introduces the topic, provides a focused observation, and logically organizes information.","The introduction is compelling, clearly introduces the topic, provides a sharp and insightful focus, and expertly organizes information for the reader."],["No facts, definitions, details, or examples are provided to develop the topic.","Minimal and irrelevant facts, definitions, details, or examples are provided.","Some facts, definitions, details, or examples are provided, but they are not well-related to the topic.","The topic is developed with relevant facts, definitions, details, and examples.","The topic is well-developed with specific and well-chosen facts, definitions, details, and examples that enhance understanding.","The topic is exceptionally well-developed with compelling, insightful, and thoroughly explained facts, definitions, details, and examples that demonstrate a deep understanding."],["Ideas are presented randomly with no connection to each other.","There is little attempt to link ideas. Connections are vague or missing.","Ideas are presented with some attempt to link them, but the connections are weak or unclear.","Ideas are linked within and across categories using basic words and phrases.","Ideas are effectively linked within and across categories using a variety of words, phrases, and clauses.","Ideas are seamlessly and skillfully linked within and across categories, creating a cohesive and insightful flow of information."],["Language is vague, imprecise, and inappropriate for the topic.","Language is simple and lacks precision. Vocabulary is limited.","Language is generally appropriate, but there is a lack of precision and domain-specific vocabulary.","Precise language and domain-specific vocabulary are used to inform or explain the topic.","Language is precise, sophisticated, and enhances the clarity and impact of the explanation.","Language is used with exceptional precision and flair, demonstrating a mastery of domain-specific vocabulary and enhancing the overall effectiveness of the text."],["There is no concluding statement or section.","The conclusion is abrupt and unrelated to the information presented.","The conclusion is weak and provides a minimal summary.","A concluding statement or section is provided, related to the information or explanation presented.","The conclusion effectively summarizes the main points and provides a thoughtful reflection on the topic.","The conclusion is insightful, memorable, and leaves the reader with a clear understanding of the topic's significance."]]}