{"criteria":["Ability to write routinely for extended time frames (research, reflection, and revision)","Ability to write routinely for shorter time frames (single sitting or a day or two)","Ability to tailor writing for a range of discipline-specific tasks, purposes, and audiences"],"points":[0,1,2,3,4,5],"descriptions":[["The student does not demonstrate an ability to write over extended time frames. There is no evidence of research, reflection, or revision.","The student attempts to write over an extended time frame, but the effort is minimal and lacks clear research, reflection, or revision.","The student writes over an extended time frame with some evidence of research, reflection, or revision, but these elements are superficial or inconsistently applied.","The student routinely writes over extended time frames, showing adequate research, reflection, and revision, though some aspects may need further development.","The student writes routinely over extended time frames effectively, demonstrating strong research, thoughtful reflection, and meaningful revision throughout the process.","The student expertly writes routinely over extended time frames, showcasing comprehensive research, insightful reflection, and thorough revision, resulting in a polished and refined final product."],["The student does not demonstrate an ability to write within shorter time frames. The writing is either incomplete or nonexistent.","The student attempts to write within a shorter time frame, but the effort is minimal and lacks coherence or focus.","The student writes within a shorter time frame with some coherence and focus, but the writing is underdeveloped and lacks detail.","The student routinely writes within shorter time frames, showing adequate coherence and focus, though some aspects may need further development.","The student writes routinely within shorter time frames effectively, demonstrating strong coherence, clear focus and sufficient details.","The student expertly writes routinely within shorter time frames, showcasing comprehensive, coherent, focused and detailed writing, resulting in a polished and refined final product."],["The student shows no awareness of the task, purpose, or audience in their writing.","The student demonstrates a minimal understanding of the task, purpose, or audience, but this understanding does not translate into their writing.","The student attempts to tailor their writing to the task, purpose, and audience, but the effort is superficial or inconsistent.","The student generally tailors their writing to the task, purpose, and audience, though some aspects may not be fully addressed or optimized.","The student effectively tailors their writing to the task, purpose, and audience, demonstrating a strong understanding of the specific requirements and expectations.","The student expertly tailors their writing to the task, purpose, and audience, showcasing a sophisticated understanding of rhetorical strategies and audience engagement."]]}