{"criteria":["Clarity and Focus","Organization and Structure","Development and Elaboration","Audience Awareness"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear purpose and is difficult to understand. The central idea is vague or missing.","The writing demonstrates a limited understanding of the purpose. The central idea is present but not well-defined.","The writing demonstrates a basic understanding of the purpose. The central idea is identifiable but may lack focus.","The writing is generally clear and focused, with a discernible purpose and central idea.","The writing is clear, focused, and demonstrates a strong understanding of the purpose. The central idea is well-developed and maintained.","The writing is exceptionally clear, focused, and demonstrates a sophisticated understanding of the purpose. The central idea is compelling and expertly maintained throughout the text."],["The writing lacks a logical organization. Ideas are presented randomly and incoherently.","The writing demonstrates a weak attempt at organization. Transitions are missing or ineffective.","The writing demonstrates a basic organizational structure. Transitions are present but may be weak or inconsistent.","The writing is generally well-organized with a clear structure. Transitions are used effectively to connect ideas.","The writing is effectively organized with a logical and coherent structure. Transitions are smooth and enhance the flow of ideas.","The writing is masterfully organized with a sophisticated and seamless structure. Transitions are artful and create a cohesive and engaging reading experience."],["The writing lacks development and elaboration. Ideas are not supported with evidence or examples.","The writing demonstrates minimal development and elaboration. Support is weak or irrelevant.","The writing demonstrates some development and elaboration. Support is present but may be superficial or generic.","The writing is adequately developed and elaborated with relevant support and examples.","The writing is well-developed and elaborated with strong support and specific examples that enhance the reader's understanding.","The writing is exceptionally well-developed and elaborated with insightful support and compelling examples that demonstrate a deep understanding of the topic."],["The writing demonstrates no awareness of the intended audience.","The writing demonstrates limited awareness of the intended audience.","The writing demonstrates some awareness of the intended audience.","The writing is generally appropriate for the intended audience.","The writing is well-suited for the intended audience and demonstrates a clear understanding of their needs and expectations.","The writing is expertly tailored for the intended audience and demonstrates a sophisticated understanding of their knowledge, interests, and perspectives."]]}