{"criteria":["Selection of Relevant Sources","Use of Information to Build Knowledge","Organization and Focus","Clarity and Precision of Writing"],"points":[0,1,2,3,4,5],"descriptions":[["No sources are used or the sources are completely irrelevant to the research topic.","Few sources are used, and their relevance to the research topic is questionable.","Some sources are used, but their relevance to the research topic is limited.","Adequate sources are used, and they generally relate to the research topic.","Relevant and varied sources are used to support the research topic.","Highly relevant, credible, and diverse sources are strategically used to comprehensively support the research topic."],["No attempt is made to use the information from the sources to build knowledge about the topic.","Little attempt is made to use the information from the sources to build knowledge about the topic; understanding is lacking.","An attempt is made to use the information, but the connection to building knowledge is weak or unclear.","Information from the sources is used to build a basic understanding of different aspects of the topic.","Information from the sources is effectively used to build a comprehensive understanding of different aspects of the topic.","Information is synthesized from a variety of sources to create new insights and a sophisticated understanding of different aspects of the topic."],["The research project lacks organization and focus, making it difficult to follow the line of inquiry.","The research project is poorly organized, and the focus is unclear.","The research project has some organization, but the focus may shift or be inconsistent.","The research project is adequately organized with a generally clear focus on the research topic.","The research project is well-organized, and the focus remains consistent throughout.","The research project is exceptionally well-organized with a sharp, maintained focus that enhances the impact of the research."],["Writing is unclear, imprecise, and contains numerous errors that impede understanding.","Writing is often unclear and imprecise with frequent errors.","Writing is somewhat clear but may lack precision; errors are present but do not significantly impede understanding.","Writing is clear and precise with few errors.","Writing is very clear, precise, and engaging with minimal errors.","Writing is exceptionally clear, precise, and compelling, demonstrating mastery of language conventions."]]}