{"criteria":["Orientation and Organization","Use of Narrative Techniques","Transitions","Word Choice and Sensory Details","Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["The narrative lacks a clear beginning, does not introduce characters or setting, and the sequence of events is confusing and disorganized.","The narrative attempts to establish a situation and introduce characters, but it is unclear or incomplete. The organization of events is weak.","The narrative establishes a basic situation and introduces characters. The event sequence is present but may have some gaps or lack natural flow.","The narrative effectively orients the reader with a clear situation and introduces characters. The event sequence is generally well-organized and unfolds logically.","The narrative skillfully orients the reader, providing a vivid situation and engaging characters. The event sequence is well-organized, creating a natural and compelling flow.","The narrative expertly orients the reader, creating a strong sense of place and character. The event sequence is masterfully organized, enhancing the narrative's impact."],["The narrative lacks narrative techniques such as dialogue, description, or pacing. Character responses are absent or unclear.","The narrative includes minimal narrative techniques, but their use is ineffective or underdeveloped. Character responses are basic or superficial.","The narrative uses some narrative techniques to develop experiences and events, but the techniques may be inconsistent or not fully realized. Character responses are present but may lack depth.","The narrative effectively uses narrative techniques, such as dialogue, description, and pacing, to develop experiences and events. Character responses are thoughtful and contribute to the narrative.","The narrative skillfully employs a variety of narrative techniques to create engaging experiences and events. Character responses are insightful and enhance the narrative's emotional impact.","The narrative masterfully integrates narrative techniques to create a rich and immersive experience. Character responses are nuanced and deeply affecting, elevating the narrative to a higher level."],["The narrative lacks transitional words, phrases, or clauses, resulting in abrupt shifts and a disjointed sequence of events.","The narrative includes few transitional words, phrases, or clauses, and their use is often inappropriate or ineffective.","The narrative uses some transitional words, phrases, and clauses, but their application may be inconsistent, leading to occasional confusion.","The narrative effectively uses transitional words, phrases, and clauses to manage the sequence of events, creating a smooth and logical flow.","The narrative skillfully uses a variety of transitional elements to enhance the sequence of events, adding clarity and sophistication to the writing.","The narrative masterfully employs transitions to create a seamless and compelling sequence of events, demonstrating a sophisticated understanding of narrative structure."],["The narrative uses vague or generic language and lacks sensory details, failing to create a vivid or engaging experience for the reader.","The narrative includes some concrete words and phrases and sensory details, but their impact is limited or inconsistent.","The narrative uses concrete words and phrases and sensory details to convey experiences and events, but the descriptions may lack precision or depth.","The narrative effectively uses concrete words and phrases and sensory details to convey experiences and events precisely, creating a clear and engaging picture for the reader.","The narrative skillfully uses vivid language and sensory details to bring experiences and events to life, immersing the reader in the narrative.","The narrative masterfully employs language and sensory details to create a powerful and unforgettable experience for the reader, demonstrating exceptional descriptive ability."],["The narrative lacks a conclusion or the conclusion is abrupt and unrelated to the narrated experiences or events.","The narrative provides a weak or incomplete conclusion that does not fully resolve the narrated experiences or events.","The narrative provides a conclusion that attempts to follow from the narrated experiences or events, but the connection may be unclear or superficial.","The narrative provides a conclusion that logically follows from the narrated experiences or events, bringing the narrative to a satisfying close.","The narrative provides a thoughtful and well-developed conclusion that effectively ties together the narrated experiences or events, leaving a lasting impression on the reader.","The narrative provides a powerful and insightful conclusion that resonates deeply with the reader, demonstrating a masterful understanding of narrative closure."]]}