{"criteria":["Ability to extract and cite evidence from literary texts to support analysis, reflection, and research.","Ability to extract and cite evidence from informational texts to support analysis, reflection, and research.","Application of 5th-grade reading standards to literary texts (e.g., character comparison, setting analysis).","Application of 5th-grade reading standards to informational texts (e.g., author's purpose, evidence identification)."],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no ability to extract evidence from literary texts.","The student struggles to extract evidence from literary texts and provides irrelevant or inaccurate citations.","The student extracts some evidence from literary texts, but the evidence is weakly connected to the analysis, reflection, or research.","The student extracts relevant evidence from literary texts to support analysis, reflection, or research, but the citations may be incomplete or inconsistent.","The student effectively extracts and cites evidence from literary texts to support analysis, reflection, and research, with accurate and consistent citations.","The student skillfully extracts and cites compelling evidence from literary texts to deeply support analysis, reflection, and research. Citations are accurate, consistent, and enhance the overall presentation."],["The student demonstrates no ability to extract evidence from informational texts.","The student struggles to extract evidence from informational texts and provides irrelevant or inaccurate citations.","The student extracts some evidence from informational texts, but the evidence is weakly connected to the analysis, reflection, or research.","The student extracts relevant evidence from informational texts to support analysis, reflection, or research, but the citations may be incomplete or inconsistent.","The student effectively extracts and cites evidence from informational texts to support analysis, reflection, and research, with accurate and consistent citations.","The student skillfully extracts and cites compelling evidence from informational texts to deeply support analysis, reflection, and research. Citations are accurate, consistent, and enhance the overall presentation."],["The student does not apply 5th-grade reading standards to the analysis of literary texts.","The student attempts to apply 5th-grade reading standards but demonstrates a limited understanding or application.","The student inconsistently applies 5th-grade reading standards to the analysis of literary texts.","The student applies 5th-grade reading standards to the analysis of literary texts, but the connection is not always clear or insightful.","The student effectively applies 5th-grade reading standards to the analysis of literary texts, providing relevant and insightful observations.","The student expertly applies 5th-grade reading standards to the analysis of literary texts, demonstrating a nuanced understanding and insightful interpretations."],["The student does not apply 5th-grade reading standards to the analysis of informational texts.","The student attempts to apply 5th-grade reading standards but demonstrates a limited understanding or application.","The student inconsistently applies 5th-grade reading standards to the analysis of informational texts.","The student applies 5th-grade reading standards to the analysis of informational texts, but the connection is not always clear or insightful.","The student effectively applies 5th-grade reading standards to the analysis of informational texts, providing relevant and insightful observations.","The student expertly applies 5th-grade reading standards to the analysis of informational texts, demonstrating a nuanced understanding and insightful interpretations."]]}