{"criteria":["Gathering Relevant Information","Assessing Source Credibility","Quoting and Paraphrasing","Avoiding Plagiarism","Providing Bibliographic Information"],"points":[0,1,2,3,4,5],"descriptions":[["No information gathered from sources.","Information gathered is irrelevant to the topic.","Information is somewhat relevant, but lacks depth.","Relevant information is gathered from a limited number of sources.","Relevant information is gathered from multiple sources, but some sources may be questionable.","Relevant information is gathered from a variety of credible sources."],["No attempt to assess the credibility of sources.","Sources are used without regard to their credibility.","Attempt to assess credibility is superficial or inaccurate.","Credibility of some sources is assessed, but not consistently.","Credibility of most sources is assessed, with some justification provided.","Credibility of all sources is thoroughly assessed and justified."],["No use of quotes or paraphrasing.","Excessive direct quoting with no paraphrasing; plagiarism is evident.","Attempts to quote and paraphrase, but often lacks accuracy or proper citation.","Quotes and paraphrases are generally accurate, but citation is inconsistent.","Quotes and paraphrases are accurate and appropriately used, with consistent citation.","Quotes and paraphrases are seamlessly integrated and accurately cited, demonstrating a strong understanding of source material."],["Plagiarism is evident throughout the work.","Significant instances of plagiarism are present.","Some instances of unintentional plagiarism may be present.","Plagiarism is mostly avoided, but some errors in citation may occur.","Plagiarism is avoided through proper citation and paraphrasing techniques.","Plagiarism is completely avoided, with exemplary use of citation and attribution."],["No bibliographic information is provided.","Incomplete or inaccurate bibliographic information is provided.","Bibliographic information is provided for some sources, but is incomplete or inconsistent.","Basic bibliographic information is provided for most sources, but may contain errors.","Complete and accurate bibliographic information is provided for all sources.","Bibliographic information is presented in a consistent and accurate format, demonstrating attention to detail."]]}