{"criteria":["Clarity and Focus","Narrative Techniques","Organization and Structure","Language and Style","Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["The narrative lacks a clear focus or central theme. The purpose is unclear and difficult to identify.","The narrative demonstrates a vague focus with some attempt to establish a central theme, but it may wander or lack clarity.","The narrative generally maintains focus on a central theme, but there may be occasional lapses in clarity or digressions from the main purpose.","The narrative maintains a clear focus throughout, with a well-defined central theme that is consistently explored and supported.","The narrative exhibits a sharp and consistent focus, with a compelling central theme that is thoroughly explored and engagingly presented.","The narrative demonstrates exceptional clarity and focus, with a powerfully conveyed central theme that resonates deeply with the reader."],["The narrative demonstrates little to no use of narrative techniques such as dialogue, pacing, or description.","The narrative demonstrates limited use of narrative techniques. Dialogue, pacing, and description may be underdeveloped or ineffective.","The narrative incorporates some narrative techniques, but they may be inconsistently applied or lack refinement. Dialogue, pacing, and description may be basic.","The narrative effectively utilizes narrative techniques to enhance the story. Dialogue, pacing, and description are used purposefully to develop experiences, events, and characters.","The narrative demonstrates skillful use of narrative techniques. Dialogue, pacing, and description are crafted with attention to detail and contribute to the overall impact of the story.","The narrative demonstrates masterful use of narrative techniques. Dialogue, pacing, and description are expertly woven together to create a rich and immersive reading experience."],["The narrative lacks a clear organizational structure, making it difficult to follow the sequence of events. Transitions are absent or confusing.","The narrative demonstrates a weak organizational structure, with unclear sequencing of events and ineffective transitions between ideas or time frames.","The narrative generally follows a logical organizational structure, but there may be occasional lapses in coherence or ineffective transitions between events or time frames.","The narrative is logically organized with a clear sequence of events that unfolds naturally. Transitions are used effectively to connect ideas and signal shifts in time or setting.","The narrative exhibits a well-crafted organizational structure, with a seamless sequence of events and smooth transitions that enhance the reading experience.","The narrative demonstrates masterful control of organization and structure, with a flawless sequence of events and seamless transitions that create a cohesive and engaging narrative."],["The narrative demonstrates limited use of precise language, descriptive details, or sensory language. The writing lacks clarity and impact.","The narrative demonstrates basic use of language and style, with limited descriptive details and sensory language. The writing may be vague or imprecise.","The narrative incorporates some precise language, descriptive details, and sensory language, but they may be inconsistently applied or lack impact.","The narrative effectively uses precise language, descriptive details, and sensory language to convey experiences and events. The writing is clear and engaging.","The narrative demonstrates skillful use of language and style, with vivid descriptive details and sensory language that bring the story to life. The writing is polished and impactful.","The narrative demonstrates masterful command of language and style, with rich, evocative descriptions and sensory language that immerse the reader in the story. The writing is elegant and refined."],["The narrative lacks a clear conclusion or resolution. The ending feels abrupt or incomplete.","The narrative provides a weak conclusion that may not fully resolve the events or experiences presented in the story.","The narrative offers a conclusion, but it may feel somewhat disconnected from the rest of the story or lack a sense of closure.","The narrative provides a satisfactory conclusion that follows logically from the narrated experiences or events, offering a sense of closure.","The narrative delivers a thoughtful and satisfying conclusion that effectively ties together the themes and ideas presented in the story, leaving a lasting impression on the reader.","The narrative offers a powerful and memorable conclusion that resonates deeply with the reader, leaving a profound and lasting impact."]]}