{"criteria":["Introduction and Organization","Support with Reasons and Evidence","Clarity of Relationships","Formal Style","Concluding Statement"],"points":[0,1,2,3,4,5],"descriptions":[["Fails to introduce a clear claim or organize reasons and evidence.","Introduces a claim, but the organization of reasons and evidence is unclear and illogical.","Introduces a claim and attempts to organize reasons and evidence, but clarity is lacking.","Clearly introduces a claim and organizes reasons and evidence in a generally logical manner.","Effectively introduces a compelling claim and organizes reasons and evidence logically and coherently.","Masterfully introduces a nuanced claim and organizes reasons and evidence in a sophisticated and compelling manner."],["Provides no reasons or evidence to support the claim.","Offers minimal reasons or evidence, which are irrelevant or lack credibility.","Provides some reasons and evidence, but relevance and credibility are questionable.","Supports the claim with relevant reasons and evidence from generally credible sources.","Substantiates the claim with well-chosen, relevant evidence from credible sources, demonstrating a solid understanding of the topic.","Effectively uses a variety of compelling and credible sources to provide convincing evidence and insightful understanding of the topic."],["Uses no transitions or clarifying language; relationships between claims and reasons are unclear.","Uses limited or inappropriate transitions, leading to confusion in the relationships between claims and reasons.","Attempts to use transitions, but they are often ineffective or misplaced.","Uses transitions and clarifying language to establish clear relationships between claims and reasons.","Skillfully employs a variety of transitions and clarifying phrases to enhance the connection between claims and reasons.","Masterfully uses sophisticated transitions and nuanced language to create seamless and compelling connections between claims and reasons."],["Uses inappropriate or informal language throughout the argument.","Uses predominantly informal language with some attempts at formality.","Inconsistently maintains a formal style with noticeable lapses into informality.","Generally maintains a formal style appropriate for academic argumentation.","Consistently maintains a sophisticated and appropriate formal style.","Exemplifies a refined and compelling formal style that enhances the persuasiveness of the argument."],["Provides no concluding statement or a conclusion that is unrelated to the argument.","Offers a weak or irrelevant concluding statement that does not follow from the argument.","Provides a concluding statement that is somewhat related to the argument but lacks clarity.","Presents a concluding statement that generally follows from the argument presented.","Provides a clear and effective concluding statement that logically follows from the argument and summarizes the main points.","Crafts a compelling and insightful concluding statement that not only summarizes the argument but also leaves a lasting impression on the reader."]]}