{"criteria":["Clarity and Coherence","Development","Organization","Style"],"points":[0,1,2,3,4,5],"descriptions":[["Writing lacks clarity and coherence; difficult to understand the main idea.","Writing demonstrates minimal clarity and coherence; the main idea is somewhat difficult to follow.","Writing demonstrates some clarity and coherence; the main idea is generally understandable, but connections may be weak.","Writing is generally clear and coherent; the main idea is understandable, and connections are mostly logical.","Writing is clear and coherent; the main idea is well-developed, and connections are logical and effective.","Writing is exceptionally clear and coherent; the main idea is expertly developed, and connections are seamless and insightful."],["Writing lacks development; ideas are undeveloped or unsupported.","Writing demonstrates minimal development; ideas are underdeveloped and lack sufficient support.","Writing demonstrates some development; ideas are partially developed, but support may be weak or inconsistent.","Writing is generally well-developed; ideas are developed with relevant support, but some areas may need further elaboration.","Writing is well-developed; ideas are thoroughly developed with relevant and convincing support.","Writing is exceptionally well-developed; ideas are expertly developed with compelling and insightful support."],["Writing lacks organization; ideas are presented randomly or illogically.","Writing demonstrates minimal organization; ideas are presented with little logical structure.","Writing demonstrates some organization; ideas are presented with some logical structure, but transitions may be weak.","Writing is generally well-organized; ideas are presented in a logical order with clear transitions.","Writing is well-organized; ideas are presented in a logical and effective order with smooth transitions.","Writing is exceptionally well-organized; ideas are presented in a sophisticated and compelling order with seamless transitions."],["Writing lacks style; language is inappropriate for the task, purpose, and audience.","Writing demonstrates minimal style; language is somewhat inappropriate for the task, purpose, and audience.","Writing demonstrates some style; language is generally appropriate for the task, purpose, and audience, but may lack sophistication.","Writing demonstrates appropriate style; language is tailored to the task, purpose, and audience.","Writing demonstrates effective style; language is engaging and enhances the task, purpose, and audience.","Writing demonstrates sophisticated style; language is precise, nuanced, and elevates the task, purpose, and audience."]]}