{"criteria":["Evidence Identification and Selection","Application of Reading Standards to Literature","Application of Reading Standards to Literary Nonfiction","Clarity and Coherence of Explanation"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence is selected or identified from the text.","Minimal evidence is selected, but it is irrelevant or does not support the analysis, reflection, or research.","Some evidence is selected, but it is weakly connected to the analysis, reflection, or research.","Adequate evidence is selected and generally supports the analysis, reflection, or research, but may lack depth.","Well-chosen evidence is selected and clearly supports the analysis, reflection, or research with reasonable depth.","Insightful and compelling evidence is selected, strongly supports the analysis, reflection, or research, and demonstrates a deep understanding of the text."],["No application of grade 6 reading standards to literature is evident.","Attempts to apply grade 6 reading standards are minimal and largely unsuccessful.","Limited application of grade 6 reading standards; comparisons or contrasts are superficial.","Adequate application of grade 6 reading standards; comparisons or contrasts are present but may lack nuance.","Clear application of grade 6 reading standards; comparisons or contrasts are well-developed and insightful.","Sophisticated application of grade 6 reading standards; comparisons or contrasts are nuanced, original, and demonstrate a thorough understanding of literary elements."],["No application of grade 6 reading standards to literary nonfiction is evident.","Attempts to apply grade 6 reading standards are minimal and largely unsuccessful.","Limited application of grade 6 reading standards; evaluation of arguments and claims is superficial.","Adequate application of grade 6 reading standards; evaluation of arguments and claims is present but may lack depth.","Clear application of grade 6 reading standards; evaluation of arguments and claims is well-developed and insightful.","Sophisticated application of grade 6 reading standards; evaluation of arguments and claims is nuanced, original, and demonstrates a critical understanding of rhetorical strategies."],["Explanation of evidence and its connection to the analysis is unclear and incoherent.","Explanation is minimal, difficult to follow, and lacks coherence.","Explanation is present but may be vague, somewhat disorganized, and lacks clear connections.","Explanation is generally clear and coherent, with logical connections between evidence and analysis.","Explanation is clear, coherent, and logically organized, with strong connections between evidence and analysis.","Explanation is exceptionally clear, coherent, insightful, and logically structured, demonstrating a sophisticated understanding of the material."]]}