{"criteria":["Use of Technology for Writing and Publishing","Interaction and Collaboration Using Technology","Keyboarding Skills and Typing Speed"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not use technology to produce or publish writing.","Student attempts to use technology but struggles significantly with basic functions.","Student uses technology with some difficulty to produce and publish writing, requiring frequent assistance.","Student generally uses technology effectively to produce and publish writing, with occasional minor issues.","Student proficiently uses technology to produce and publish writing, demonstrating good command of relevant tools.","Student expertly uses technology to produce and publish writing, exploring advanced functions and demonstrating innovation."],["Student does not interact or collaborate with others using technology.","Student struggles to interact or collaborate effectively using technology.","Student participates in interaction and collaboration with some difficulty, requiring guidance.","Student interacts and collaborates adequately using technology, with occasional minor issues.","Student effectively interacts and collaborates with others using technology, demonstrating good communication skills.","Student skillfully interacts and collaborates with others using technology, enhancing group dynamics and achieving shared goals."],["Student's keyboarding skills are severely lacking; unable to type a coherent page.","Student demonstrates very slow keyboarding skills; struggles to type even a short paragraph.","Student types slowly and with many errors, unable to complete three pages in a single sitting.","Student types at a moderate speed with some errors, completing close to three pages in a single sitting.","Student types efficiently with few errors, completing three pages in a single sitting.","Student types rapidly and accurately, exceeding the three-page requirement in a single sitting, demonstrating mastery of keyboarding skills."]]}