{"criteria":["Topic Introduction and Organization","Development of Topic with Evidence","Use of Transitions","Language and Vocabulary","Formal Style","Concluding Statement"],"points":[0,1,2,3,4,5],"descriptions":[["The writing lacks a clear topic or thesis. Ideas are disorganized and confusing, with no discernible structure.","The topic or thesis is vague or unclear. Organization is minimal, and the structure is difficult to follow. Formatting and graphics are absent or irrelevant.","The topic or thesis is present but may lack focus. Organization is attempted but inconsistent. Formatting and graphics are minimal or used ineffectively.","The topic or thesis is clearly stated. Organization is logical, using strategies such as definition or comparison. Formatting and graphics are present and generally support comprehension.","The topic or thesis is well-defined and engaging. Organization is effective and enhances understanding. Formatting and graphics are appropriately used to aid comprehension.","The topic or thesis is compelling and insightful. Organization is masterful, using a variety of strategies to create a cohesive and impactful text. Formatting, graphics, and multimedia are seamlessly integrated to maximize comprehension."],["The writing lacks supporting evidence. Facts, definitions, and details are missing or irrelevant.","The writing includes minimal supporting evidence. Facts, definitions, and details are scarce or loosely related to the topic.","The writing includes some supporting evidence, but it may be superficial or lack depth. Facts, definitions, and details are present but not consistently relevant.","The writing develops the topic with relevant facts, definitions, and details. Evidence is generally supportive of the main ideas.","The writing effectively develops the topic with well-chosen facts, definitions, and details. Evidence is strong and clearly supports the main ideas.","The writing expertly develops the topic with a rich array of compelling facts, definitions, details, and examples. Evidence is meticulously integrated to provide comprehensive support."],["The writing lacks transitions, making it difficult to follow the relationships between ideas.","The writing includes few transitions, resulting in abrupt shifts between ideas.","The writing includes some transitions, but they may be weak or ineffective in clarifying relationships.","The writing uses appropriate transitions to clarify the relationships among most ideas and concepts.","The writing uses a variety of effective transitions to clearly and smoothly connect ideas and concepts.","The writing employs sophisticated transitions to create seamless connections between ideas and concepts, enhancing the overall flow and coherence."],["The writing uses imprecise language and lacks domain-specific vocabulary.","The writing uses vague language and includes minimal domain-specific vocabulary.","The writing uses generally appropriate language but may lack precision or sophistication in vocabulary.","The writing uses precise language and incorporates some domain-specific vocabulary to inform or explain the topic.","The writing uses precise and sophisticated language, incorporating domain-specific vocabulary effectively to enhance understanding.","The writing employs nuanced and sophisticated language with a masterful command of domain-specific vocabulary, conveying complex ideas with clarity and precision."],["The writing lacks a formal style and may include inappropriate language or tone.","The writing attempts a formal style but is inconsistent or contains informal elements.","The writing generally maintains a formal style with occasional lapses.","The writing establishes and maintains a consistently formal style appropriate for informative\/explanatory texts.","The writing demonstrates a refined and sophisticated formal style, enhancing the credibility and impact of the text.","The writing exemplifies a masterful command of formal style, employing rhetorical techniques to create a compelling and authoritative voice."],["The writing lacks a concluding statement or section.","The concluding statement or section is abrupt or does not follow from the information presented.","The concluding statement or section is present but weak or repetitive.","The writing provides a concluding statement or section that follows from the information or explanation presented.","The writing provides a thoughtful and well-developed concluding statement or section that effectively summarizes the main points.","The writing provides a powerful and insightful concluding statement or section that leaves a lasting impression and reinforces the key takeaways."]]}