{"criteria":["Ability to sustain writing over extended time frames for research, reflection, and revision.","Ability to adapt writing style and content to suit different discipline-specific tasks.","Ability to tailor writing for different purposes and audiences."],"points":[0,1,2,3,4,5],"descriptions":[["Demonstrates no ability to sustain writing for extended periods; shows no evidence of research, reflection, or revision.","Shows minimal ability to sustain writing; limited evidence of research, reflection, or revision.","Can sustain writing for short periods; some evidence of research, reflection, and revision is present but underdeveloped.","Sustains writing for moderate periods with adequate research, reflection, and revision evident.","Sustains writing effectively over extended time frames with clear evidence of thoughtful research, reflection, and revision.","Demonstrates exceptional ability to sustain writing, showing sophisticated research, insightful reflection, and thorough revision."],["Unable to adapt writing for different tasks; content and style are inappropriate for the given discipline.","Demonstrates little adaptation to different tasks; struggles to align content and style with the discipline.","Shows some awareness of adapting writing to different tasks, but execution is inconsistent.","Adapts writing adequately for various discipline-specific tasks, with appropriate content and style adjustments.","Effectively tailors writing to suit the demands of different tasks, demonstrating a strong understanding of disciplinary conventions.","Masterfully adapts writing across a range of tasks, showcasing nuanced understanding of disciplinary expectations and superior stylistic control."],["Fails to consider the purpose or audience; writing is generic and lacks direction.","Demonstrates limited awareness of purpose and audience; struggles to adjust writing accordingly.","Shows some consideration for purpose and audience, but adjustments are superficial or inconsistent.","Tailors writing appropriately for different purposes and audiences with reasonable effectiveness.","Effectively crafts writing to suit specific purposes and engage target audiences, demonstrating a clear understanding of rhetorical strategies.","Demonstrates exceptional skill in tailoring writing to achieve specific purposes and captivate diverse audiences, showcasing mastery of rhetorical techniques."]]}