{"criteria":["Focus and Clarity of Research Question","Use of Sources","Evidence and Support","Organization and Structure","Refocusing and Adaptability"],"points":[0,1,2,3,4,5],"descriptions":[["The research question is missing or completely unclear. There is no discernible focus.","The research question is very vague and lacks focus. The purpose of the research is unclear.","The research question is somewhat unclear and lacks a strong focus. The purpose of the research is partially evident.","The research question is generally clear and focused, with an identifiable purpose.","The research question is clear, focused, and appropriately narrow, with a well-defined purpose.","The research question is exceptionally clear, sharply focused, and insightful, demonstrating a sophisticated understanding of the research's purpose."],["No sources are used or the sources used are completely irrelevant.","Very few sources are used, and they are largely irrelevant or unreliable.","Some sources are used, but their relevance or reliability is questionable.","An adequate number of sources are used, and they are generally relevant and reliable.","A variety of relevant and reliable sources are used effectively to support the research.","An impressive array of highly relevant and authoritative sources are used skillfully and strategically to enhance the research."],["No evidence is presented, or the evidence is completely unrelated to the research question.","Very little evidence is presented, and it is largely unrelated or inaccurate.","Some evidence is presented, but it is weak, insufficient, or poorly connected to the research question.","Adequate evidence is presented, and it generally supports the research question.","Strong evidence is presented, and it clearly and effectively supports the research question.","Compelling and insightful evidence is presented, and it powerfully and persuasively supports the research question."],["The research project is completely disorganized and lacks any discernible structure.","The research project is very disorganized and difficult to follow. Structure is minimal.","The research project is somewhat disorganized, with a weak or inconsistent structure.","The research project is generally well-organized and follows a logical structure.","The research project is well-organized, flows smoothly, and follows a clear and logical structure.","The research project is exceptionally well-organized, demonstrating a sophisticated and seamless flow of ideas with a highly effective structure."],["There is no evidence of refocusing the inquiry, even when necessary.","There is minimal evidence of refocusing the inquiry, and the attempts are ineffective.","There is some evidence of refocusing the inquiry, but it is limited or not well-executed.","The inquiry is refocused when appropriate, demonstrating some adaptability.","The inquiry is skillfully refocused when necessary, demonstrating adaptability and critical thinking.","The inquiry is seamlessly and strategically refocused as needed, demonstrating exceptional adaptability, insight, and critical thinking."]]}