{"criteria":["Planning and Organization","Revising and Editing","Command of Language Standards (Grades 1-6)","Use of Feedback and Support"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence of planning or organization is present.","Minimal planning is evident; the organization is weak and unclear.","Some planning is evident, but the organization is inconsistent.","Adequate planning is demonstrated; the organization is generally clear but may have minor inconsistencies.","Well-developed plan is evident; the organization is logical and supports the writing effectively.","Thorough and thoughtful planning is evident; the organization is seamless and enhances the writing significantly."],["No revisions or edits are made to the original writing.","Minimal revisions are attempted; edits are superficial and do not address significant issues.","Some revisions are made, but key areas for improvement are missed.","Adequate revisions and edits are made to improve clarity and coherence.","Thoughtful revisions and edits are made, demonstrating attention to detail and a commitment to improvement.","Extensive and insightful revisions and edits are made, resulting in a polished and refined piece of writing."],["Numerous errors in grammar, punctuation, and sentence structure are present, indicating a lack of command of basic language standards.","Frequent errors in grammar, punctuation, and sentence structure impede understanding.","Several errors in grammar, punctuation, and sentence structure are present, but the overall meaning is still discernible.","Occasional errors in grammar, punctuation, and sentence structure do not significantly detract from the overall quality of the writing.","Few errors in grammar, punctuation, and sentence structure demonstrate a solid command of language standards.","Virtually no errors in grammar, punctuation, and sentence structure demonstrate a strong command of language standards."],["No attempt is made to incorporate feedback or seek support from peers or adults.","Minimal attempt is made to incorporate feedback or seek support; the impact on the writing is negligible.","Some feedback is incorporated, but key suggestions are overlooked.","Feedback and support are adequately utilized to improve the writing.","Feedback and support are thoughtfully integrated, resulting in noticeable improvements to the writing.","Feedback and support are skillfully utilized, leading to significant enhancements and a polished final product."]]}