{
  "criteria": [
    "Identifying and Citing Evidence",
    "Analysis and Interpretation",
    "Reflection and Connection to Broader Themes",
    "Application of Reading Standards"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student demonstrates no ability to identify or cite evidence from the text.",
      "The student attempts to identify evidence but is unsuccessful or cites irrelevant information.",
      "The student identifies some evidence from the text but struggles to cite it correctly or completely.",
      "The student identifies and cites evidence from the text, but the connection to the analysis is weak or unclear.",
      "The student effectively identifies and cites relevant evidence from the text to support their analysis.",
      "The student skillfully identifies and cites compelling evidence from the text, enhancing the depth and clarity of their analysis."
    ],
    [
      "The student provides no analysis or interpretation of the text.",
      "The student offers a superficial or inaccurate interpretation of the text.",
      "The student provides a basic analysis of the text, but it lacks depth or insight.",
      "The student analyzes the text and offers a reasonable interpretation, but there may be gaps in their reasoning.",
      "The student provides a thoughtful and well-supported analysis of the text, demonstrating a clear understanding of its meaning.",
      "The student offers a nuanced and insightful analysis of the text, revealing a deep understanding of its complexities and subtleties."
    ],
    [
      "The student does not reflect on the text or connect it to broader themes.",
      "The student attempts to reflect on the text, but their connections are vague or unsupported.",
      "The student makes some connections between the text and broader themes, but the reflection is limited.",
      "The student reflects on the text and connects it to relevant broader themes, but the connection could be stronger.",
      "The student thoughtfully reflects on the text and connects it to broader themes, enhancing their analysis and understanding.",
      "The student provides profound reflections on the text, skillfully connecting it to broader themes and offering original insights."
    ],
    [
      "The student demonstrates no understanding of the relevant reading standards.",
      "The student shows limited awareness of the relevant reading standards.",
      "The student attempts to apply the reading standards, but the application is inaccurate or incomplete.",
      "The student applies the reading standards to the text, but the connection may be superficial.",
      "The student effectively applies the reading standards to the text, demonstrating a clear understanding of their relevance.",
      "The student skillfully applies the reading standards to the text, enhancing their analysis and revealing a sophisticated understanding of literary or informational techniques."
    ]
  ]
}