{"criteria":["Narrative Structure and Clarity: Assesses the clarity, organization, and sequencing of events in the narration.","Event Focus and Connection: Evaluates the narration's ability to focus on a single event or loosely linked events.","Reaction to Events: Assesses the quality and depth of the student's reaction to the narrated events.","Use of Drawing, Dictating, and Writing: Evaluates the effective and correct use of drawing, dictating, and writing in the narration."],"points":[0,1,2,3,4,5],"descriptions":[["The narration is absent or completely incomprehensible. There is no discernible sequence of events, and no reaction is provided.","The narration is very limited and difficult to follow. The sequence of events is unclear, and the reaction is vague or missing.","The narration is somewhat understandable but lacks detail. The sequence of events is not always clear, and the reaction is superficial.","The narration is generally clear and presents a sequence of events, but some details are missing. The reaction is present but could be more developed.","The narration is clear, detailed, and presents a logical sequence of events. The reaction is thoughtful and relevant.","The narration is vivid, engaging, and presents a well-organized sequence of events. The reaction is insightful and adds depth to the narrative."],["No events are mentioned, or the connection between them is nonexistent. The narration does not focus on a single event or loosely linked events.","The narration attempts to describe an event or events, but the connection is unclear. The focus is weak.","The narration mentions a single event or loosely linked events, but the description lacks coherence.","The narration effectively describes a single event or several loosely linked events, maintaining some focus.","The narration clearly focuses on a single event or several loosely linked events, providing a coherent and engaging account.","The narration masterfully weaves together a single event or several loosely linked events, creating a compelling and cohesive narrative."],["There is no discernible reaction to the narrated events.","The reaction is vague, irrelevant, or illogical.","The reaction is present but lacks depth and relevance.","The reaction is appropriate and somewhat insightful.","The reaction is thoughtful, relevant, and adds to the narrative's impact.","The reaction is insightful, profound, and significantly enhances the narrative's meaning and emotional impact."],["The narration is incomprehensible due to significant errors in drawing, dictating, and writing.","The narration contains numerous errors in drawing, dictating, and writing, making it difficult to understand.","The narration has some errors in drawing, dictating, and writing that occasionally interfere with comprehension.","The narration is generally clear, with minor errors in drawing, dictating, and writing that do not significantly impede understanding.","The narration is clear and well-constructed, with few errors in drawing, dictating, and writing.","The narration is exceptionally clear, creative, and error-free in drawing, dictating, and writing, enhancing the overall quality of the narrative."]]}