{"criteria":["Effectiveness of topic naming and information supply","Integration of drawing, dictating, and writing","Clarity and explanatory content of the text"],"points":[0,1,2,3,4,5],"descriptions":[["The student's work shows no attempt to name the topic or supply any information.","The student attempts to name the topic, but it is unclear or inaccurate, and no relevant information is provided.","The student names the topic, but the information provided is minimal, vague, or unrelated to the topic.","The student names the topic and supplies some information, but the details are limited and may lack clarity or accuracy.","The student clearly names the topic and provides relevant information with some detail and accuracy. The combination of drawing, dictating, and writing is somewhat effective.","The student effectively uses a combination of drawing, dictating, and writing to clearly name the topic and supply detailed, accurate, and relevant information in an informative\/explanatory text."],["The student's work demonstrates no use of drawing, dictating, or writing to compose the text.","The student attempts to use one mode of communication (drawing, dictating, or writing), but it is largely ineffective.","The student uses one or two modes of communication, but they are not well-integrated, and the text lacks coherence.","The student uses a combination of drawing, dictating, and writing, but the integration is basic, and the modes do not fully complement each other.","The student effectively combines drawing, dictating, and writing to compose the text, showing a good understanding of how these modes can complement each other.","The student expertly integrates drawing, dictating, and writing to create a cohesive and informative\/explanatory text, demonstrating a sophisticated understanding of multimodal communication."],["The text is completely unclear and fails to provide any explanatory content.","The text is difficult to understand, with little to no explanatory content provided.","The text provides some explanatory content, but it is poorly organized and lacks clarity.","The text is mostly explanatory, with some organization and clarity, but could be improved.","The text is clear, well-organized, and provides a good explanation of the topic.","The text is exceptionally clear, well-organized, and provides a comprehensive and insightful explanation of the topic, demonstrating a strong understanding of informative writing."]]}