{"criteria":["Effective Use of Digital Tools","Organization and Focus","Collaboration Skills"],"points":[0,1,2,3,4,5],"descriptions":[["Student demonstrates no attempt to use digital tools for writing or collaboration.","Student attempts to use a digital tool but struggles significantly with its basic functions, hindering writing or collaboration.","Student uses a digital tool with some difficulty, requiring frequent guidance and producing limited or flawed writing.","Student independently uses a digital tool to produce writing with minor errors, demonstrating basic collaboration skills.","Student proficiently uses a variety of digital tools to produce clear and effective writing, collaborating effectively with peers.","Student expertly uses diverse digital tools to produce sophisticated writing, enhancing collaboration and demonstrating innovation in presentation and content."],["Student's writing is disorganized and lacks a clear purpose or focus.","Student's writing shows minimal organization and struggles to maintain a consistent purpose.","Student's writing demonstrates some organization but may lack clarity or focus in certain areas.","Student's writing is generally organized with a discernible purpose and focus, but may have minor inconsistencies.","Student's writing is well-organized, demonstrating a clear purpose and maintaining a consistent focus throughout.","Student's writing is exceptionally organized, with a compelling purpose and seamless focus that captivates the reader."],["Student's collaboration lacks any meaningful contribution or engagement with peers.","Student's collaboration is minimal and ineffective, showing little engagement with peers.","Student collaborates with some effort but struggles to contribute effectively to the group's writing process.","Student collaborates adequately, contributing to the group's writing process with occasional insights or suggestions.","Student actively and effectively collaborates, making valuable contributions to the group's writing process and outcomes.","Student expertly leads and facilitates collaboration, inspiring peers to produce exceptional writing through insightful contributions and guidance."]]}