{"criteria":["Ability to Recall and Gather Information","Relevance and Accuracy of Response"],"points":[0,1,2,3,4,5],"descriptions":[["The student demonstrates no ability to recall information or gather information from provided sources to answer a question, even with guidance and support.","The student attempts to recall information or gather information from provided sources but struggles significantly, even with extensive guidance and support.","With considerable guidance and support, the student can recall some information from experiences or gather a limited amount of information from provided sources to attempt to answer a question. The answer is incomplete or inaccurate.","With moderate guidance and support, the student can recall information from experiences or gather information from provided sources to answer a question. The answer may lack detail or clarity.","With minimal guidance and support, the student effectively recalls information from experiences or gathers information from provided sources to answer a question. The answer is generally clear and relevant.","Independently and proficiently, the student recalls detailed and relevant information from experiences or gathers comprehensive information from provided sources to answer a question thoroughly and accurately. Demonstrates a clear understanding of the information."],["The student's response is completely irrelevant or missing, showing no connection to the question or sources provided.","The student's response shows a minimal connection to the question and may misinterpret the sources provided. The answer is largely unclear and off-topic.","The student's response shows a vague connection to the question, but the interpretation of sources is superficial or partially inaccurate. The answer lacks focus and clarity.","The student's response is relevant to the question, demonstrating a basic interpretation of the sources. The answer could benefit from more specific details and enhanced clarity.","The student's response is clearly relevant to the question, demonstrating a solid interpretation of the sources. The answer is coherent, well-organized, and effectively addresses the question.","The student's response is exceptionally relevant, insightful, and thoroughly answers the question, demonstrating a sophisticated interpretation of the sources. The answer is presented with clarity, depth, and originality."]]}