{"criteria":["Clarity and Strength of Claim\/Thesis","Quality of Evidence and Support","Organization and Coherence","Grammar, Mechanics, and Spelling"],"points":[0,1,2,3,4,5],"descriptions":[["The writing provides no discernible claim or thesis.","The writing provides a weak or unclear claim or thesis that is difficult to identify.","The writing provides a claim or thesis, but it is simplistic, lacks nuance, or is not consistently maintained throughout the writing.","The writing provides a clear claim or thesis that is adequately maintained throughout the writing, but it may lack depth or originality.","The writing provides a clear and well-developed claim or thesis that is consistently maintained throughout the writing and demonstrates some insight.","The writing provides a compelling and insightful claim or thesis that is masterfully maintained throughout the writing and demonstrates a sophisticated understanding of the subject matter."],["The writing provides no evidence or support for the claim or thesis.","The writing provides minimal or irrelevant evidence or support for the claim or thesis.","The writing provides some evidence or support for the claim or thesis, but it is weak, underdeveloped, or not effectively integrated into the writing.","The writing provides adequate evidence or support for the claim or thesis, but it may lack depth, relevance, or analysis.","The writing provides strong and relevant evidence or support for the claim or thesis, with clear analysis and explanation.","The writing provides compelling and insightful evidence or support for the claim or thesis, with sophisticated analysis and explanation that demonstrates a deep understanding of the subject matter."],["The writing demonstrates no organization or coherence.","The writing demonstrates minimal organization or coherence, with ideas presented in a random or illogical order.","The writing demonstrates some organization and coherence, but transitions are weak or lacking, and ideas may not flow smoothly.","The writing demonstrates adequate organization and coherence, with clear transitions and a logical flow of ideas.","The writing demonstrates strong organization and coherence, with seamless transitions and a clear, logical progression of ideas.","The writing demonstrates masterful organization and coherence, with sophisticated transitions and a seamless, compelling progression of ideas that enhances the overall impact of the writing."],["The writing contains pervasive errors in grammar, mechanics, and spelling that impede understanding.","The writing contains numerous errors in grammar, mechanics, and spelling that distract from the content and clarity of the writing.","The writing contains some errors in grammar, mechanics, and spelling, but they do not significantly impede understanding.","The writing demonstrates adequate control of grammar, mechanics, and spelling, with only minor errors that do not distract from the content.","The writing demonstrates strong control of grammar, mechanics, and spelling, with few or no errors.","The writing demonstrates masterful control of grammar, mechanics, and spelling, with flawless execution that enhances the overall quality and impact of the writing."]]}