{"criteria":["Planning and Organization","Revisions and Editing","Purpose and Audience Awareness"],"points":[0,1,2,3,4,5],"descriptions":[["No discernible plan; writing lacks direction and organization.","Minimal planning evident; organization is weak with unclear connections between ideas.","Some planning is evident; organization is basic but may lack coherence in places.","Adequate planning; organization is generally clear with mostly logical progression of ideas.","Thoughtful planning; well-organized with clear and logical progression of ideas, effectively addressing the purpose.","Comprehensive planning; exceptionally well-organized with seamless and compelling progression of ideas, fully addressing the purpose and enhancing the writing's impact."],["No revisions or editing evident; numerous errors in grammar and mechanics.","Minimal revisions or editing; significant errors that impede understanding.","Basic revisions and editing; some errors remain that may occasionally distract the reader.","Adequate revisions and editing; most errors have been corrected, and the writing is generally clear.","Thoughtful revisions and editing; few errors, and the writing is polished and easy to understand.","Comprehensive revisions and editing; virtually error-free, demonstrating a high level of attention to detail and enhancing the clarity and impact of the writing."],["No awareness of purpose or audience; writing is irrelevant and confusing.","Minimal awareness of purpose or audience; writing is somewhat off-topic and may not resonate with the intended reader.","Basic awareness of purpose and audience; writing is generally on-topic but may not fully engage the reader.","Adequate awareness of purpose and audience; writing is appropriate for the intended reader and conveys the intended message.","Thoughtful awareness of purpose and audience; writing is tailored to the intended reader and effectively achieves its purpose.","Comprehensive awareness of purpose and audience; writing is expertly crafted to resonate with the intended reader, achieving its purpose with exceptional clarity and impact."]]}