{"criteria":["Ability to write routinely for various tasks","Effectiveness in writing for different purposes","Adaptation to different audiences","Use of time for reflection and revision"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not write routinely or engage with discipline-specific tasks.","Student attempts to write routinely, but struggles with task engagement.","Student writes routinely with some discipline-specific tasks, but lacks consistency.","Student writes routinely for multiple discipline-specific tasks with moderate consistency.","Student writes routinely and consistently across a range of discipline-specific tasks.","Student excels in writing routinely for various discipline-specific tasks with strong engagement and consistency."],["Student struggles to write for any specific purpose.","Student attempts to write for a purpose, but it's unclear or ineffective.","Student writes for a limited range of purposes with some effectiveness.","Student writes for a variety of purposes with moderate effectiveness.","Student writes purposefully and effectively for a range of tasks.","Student demonstrates exceptional skill in writing effectively for various purposes, adapting style as needed."],["Student shows no awareness of audience when writing.","Student attempts to tailor writing to an audience, but is largely unsuccessful.","Student shows some awareness of audience, but adaptation is limited.","Student adapts writing for different audiences with moderate success.","Student effectively tailors writing style and content to suit different audiences.","Student demonstrates a sophisticated understanding of audience, adapting writing seamlessly to maximize impact and engagement."],["Student does not reflect on or revise their writing.","Student minimally reflects on their writing but does not revise.","Student attempts reflection and revision, but it has little impact on the final product.","Student reflects on their writing and makes some revisions, improving the quality.","Student engages in thoughtful reflection and revision, significantly enhancing the writing.","Student demonstrates a deep commitment to reflection and revision, resulting in polished and highly effective written work."]]}