{"criteria":["Effective Use of Technology for Writing","Clarity and Efficiency of Information Presentation","Effective Use of the Internet for Research and Information Gathering"],"points":[0,1,2,3,4,5],"descriptions":[["Student does not use technology in the writing process.","Student attempts to use technology but struggles to integrate it effectively; minimal use of digital tools.","Student uses basic technology tools (e.g., word processor) but does not explore advanced features for writing and publishing.","Student uses technology for basic writing and publishing tasks; demonstrates some understanding of digital tools.","Student effectively uses technology to enhance writing and presentation; explores various digital tools and features.","Student expertly uses technology to produce and publish writing, demonstrating a sophisticated understanding of digital tools and their impact on communication."],["Information is presented unclearly and inefficiently, making it difficult to understand the relationships between ideas.","Information is presented with limited clarity; the relationships between ideas are vague or confusing.","Information is presented with some clarity, but the relationships between ideas could be more efficiently conveyed.","Information is presented clearly and efficiently, with a reasonable understanding of the relationships between ideas.","Information is presented clearly and efficiently, effectively conveying the relationships between ideas and supporting the overall message.","Information is presented with exceptional clarity and efficiency, masterfully conveying the relationships between ideas and creating a compelling and impactful presentation."],["Student does not use the Internet for research or information gathering.","Student attempts to use the Internet but struggles to find relevant or reliable information.","Student uses the Internet for basic research but does not critically evaluate sources or synthesize information effectively.","Student uses the Internet for research and gathers relevant information; demonstrates some ability to evaluate sources and synthesize information.","Student effectively uses the Internet for research, gathering credible sources and synthesizing information to support writing.","Student expertly uses the Internet for research, demonstrating a sophisticated understanding of online resources and synthesizing information to create compelling and well-supported writing."]]}