{"criteria":["Introduction and Organization","Development of Topic","Use of Transitions","Language and Vocabulary","Style and Tone","Conclusion"],"points":[0,1,2,3,4,5],"descriptions":[["The introduction is missing or unclear. There is no discernible organization of ideas.","The introduction is weak and does not adequately preview the text. The organization is unclear and difficult to follow.","The introduction is present but lacks clarity. The organization is basic, with some attempt to categorize information.","The introduction clearly states the topic and provides a preview of the text. Ideas are organized into appropriate categories with the use of headings and formatting.","The introduction is engaging and effectively previews the text. Ideas are logically organized into well-defined categories with effective use of headings, graphics, and multimedia to enhance comprehension.","The introduction is compelling and insightful, providing a clear roadmap for the text. Ideas are masterfully organized into categories, with seamless integration of headings, graphics, and multimedia to maximize comprehension."],["The topic is not developed with relevant facts, definitions, or details.","The topic is superficially developed with few relevant facts, definitions, or details.","The topic is developed with some relevant facts, definitions, or details; however, there are gaps in the information.","The topic is developed with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples.","The topic is thoroughly developed with a variety of relevant and compelling evidence, including facts, definitions, concrete details, quotations, and examples that enrich the text.","The topic is expertly developed with a comprehensive and insightful array of evidence, demonstrating a deep understanding of the subject matter. The details provided are highly relevant and impactful."],["Transitions are missing, making the text disjointed and difficult to follow.","Transitions are minimal or inappropriate, resulting in a lack of cohesion.","Transitions are used inconsistently, creating some connections between ideas but lacking clarity.","Appropriate and varied transitions are used to create cohesion and clarify the relationships among ideas and concepts.","Transitions are skillfully used to create a seamless flow between ideas and concepts, enhancing the overall clarity and coherence of the text.","Transitions are artfully employed to create a sophisticated and nuanced flow, demonstrating a masterful command of language and enhancing the reader's understanding."],["The language is imprecise and lacks domain-specific vocabulary.","The language is general and contains limited domain-specific vocabulary.","The language is generally precise, with some attempt to use domain-specific vocabulary.","Precise language and domain-specific vocabulary are used to inform about or explain the topic.","Precise and sophisticated language, along with a wide range of domain-specific vocabulary, is used to effectively inform and explain the topic.","The writing demonstrates a masterful command of language, using precise and nuanced vocabulary to convey complex information with exceptional clarity and depth."],["The style is informal and lacks an objective tone.","The style is inconsistent and the tone is not consistently objective.","The style is somewhat formal, and the tone is mostly objective.","A formal style and objective tone are established and maintained.","A consistently formal style and objective tone enhance the credibility and impact of the text.","The writing exemplifies a refined and authoritative style, maintaining an impeccable objective tone that lends significant weight to the information presented."],["A concluding statement or section is missing or does not follow from the information presented.","The conclusion is weak and does not adequately support the information or explanation presented.","The conclusion is present but lacks clarity and connection to the information presented.","A concluding statement or section follows from and supports the information or explanation presented.","The conclusion effectively summarizes the main points and provides a clear and insightful resolution to the text.","The conclusion provides a powerful synthesis of the information, leaving the reader with a lasting impression and a deeper understanding of the topic."]]}