{"criteria":["Selection of Evidence","Quality of Analysis, Reflection, or Research","Clarity and Organization"],"points":[0,1,2,3,4,5],"descriptions":[["No evidence is drawn from the text.","Evidence is limited and\/or irrelevant to the analysis, reflection, or research.","Evidence is selected but may lack clear connection to the analysis, reflection, or research.","Relevant evidence is selected to support the analysis, reflection, or research.","Evidence is thoughtfully selected and clearly supports the analysis, reflection, or research, enhancing the overall argument.","Evidence is expertly selected and integrated to provide compelling support for the analysis, reflection, or research, demonstrating a deep understanding of the text."],["Analysis, reflection, or research is absent or demonstrates no understanding of the text.","Analysis, reflection, or research is superficial and lacks depth.","Analysis, reflection, or research is present but may be underdeveloped or unclear.","Analysis, reflection, or research demonstrates a basic understanding of the text and its implications.","Analysis, reflection, or research is insightful and demonstrates a strong understanding of the text and its connections.","Analysis, reflection, or research is sophisticated and demonstrates a comprehensive understanding of the text, offering original insights and perspectives."],["Response is unclear, disorganized, and difficult to follow.","Response lacks clarity and organization, making it challenging to understand the analysis, reflection, or research.","Response demonstrates some organization but may lack coherence or clarity in certain areas.","Response is generally clear and organized, presenting the analysis, reflection, or research in a logical manner.","Response is clear, well-organized, and coherent, enhancing the effectiveness of the analysis, reflection, or research.","Response is exceptionally clear, organized, and coherent, demonstrating mastery of communication skills and enhancing the impact of the analysis, reflection, or research."]]}