{
  "criteria": [
    "Ability to write routinely for extended time frames, demonstrating reflection and revision.",
    "Adaptability to different discipline-specific tasks.",
    "Understanding and addressing the intended purpose of the writing.",
    "Awareness of and appropriate writing for the intended audience."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "No evidence of routine writing practice or extended engagement with the task.",
      "Minimal engagement with writing over time; little to no evidence of reflection or revision.",
      "Some attempt to write over an extended time frame, but reflection and revision are superficial.",
      "Writes routinely with some reflection and revision evident in the work.",
      "Consistently writes over extended time frames, showing clear evidence of thoughtful reflection and meaningful revisions.",
      "Demonstrates a sophisticated approach to writing routinely, using extended time for deep reflection and substantial revision, resulting in a polished piece."
    ],
    [
      "Unable to adapt writing to the specific demands of the discipline.",
      "Struggles to adjust writing style or content to fit the discipline-specific task.",
      "Makes a limited attempt to tailor writing to the specific task, but with uneven results.",
      "Adapts writing to suit the discipline-specific task with moderate success.",
      "Effectively tailors writing to the specific demands of different discipline-specific tasks.",
      "Demonstrates mastery in adapting writing style, tone, and content to excel in a variety of discipline-specific tasks."
    ],
    [
      "Fails to identify or address the intended purpose of the writing.",
      "Demonstrates a limited understanding of the writing's purpose.",
      "Acknowledges the purpose but struggles to align writing with it effectively.",
      "Understands and generally addresses the intended purpose of the writing.",
      "Clearly demonstrates an understanding of the writing's purpose and effectively addresses it throughout the piece.",
      "Masterfully crafts writing to fulfill its intended purpose, demonstrating a deep understanding of audience and context."
    ],
    [
      "Shows no awareness of the intended audience.",
      "Demonstrates minimal consideration of the audience's needs or expectations.",
      "Attempts to address the audience, but the approach is inconsistent or ineffective.",
      "Generally writes in a manner appropriate for the intended audience.",
      "Consistently writes with a clear understanding of the audience, tailoring language and style accordingly.",
      "Demonstrates exceptional skill in engaging the intended audience, using sophisticated techniques to connect and communicate effectively."
    ]
  ]
}