{"criteria":["Introduction and Claim","Support and Reasoning","Cohesion and Clarity","Formal Style","Concluding Statement"],"points":[0,1,2,3,4,5],"descriptions":[["No clear claim or introduction is present.","Claim is unclear or weakly introduced; no opposing claims acknowledged.","Claim is identifiable but lacks clarity; opposing claims are mentioned but not distinguished.","Clear claim presented; opposing claims acknowledged but connection to argument is superficial.","Well-defined claim that addresses a topic or issue, recognizes opposing claims, and organizes reasons logically.","Compelling introduction with a sophisticated claim that deftly acknowledges and distinguishes opposing claims, setting up a logical argument."],["No evidence or reasoning provided.","Reasoning is illogical or absent; evidence is irrelevant or missing.","Weak reasoning and insufficient evidence that demonstrates little understanding of the topic or text.","Adequate reasoning and some relevant evidence that shows a basic understanding of the topic or text.","Logical reasoning with relevant and accurate data or evidence, demonstrating a good understanding of the topic from credible sources.","Cogent reasoning and compelling evidence from highly credible sources, demonstrating a deep and nuanced understanding of the topic."],["No transitions or connections between ideas.","Transitions are lacking and the connections between ideas are unclear.","Few transitions used, making relationships between claims, counterclaims, reasons, and evidence somewhat unclear.","Some transitions are present, but clarity is inconsistent.","Effective use of transitions to clarify the relationships among claim(s), counterclaims, reasons, and evidence.","Masterful use of words, phrases, and clauses to create seamless cohesion and illuminate the complex relationships among ideas."],["Inappropriate or informal style used.","Style is largely informal with inappropriate elements.","Style is inconsistently formal.","Mainly maintains a formal style with occasional lapses.","Maintains a consistently formal and academic style.","Exemplary use of formal style enhancing the tone and credibility of the argument."],["No conclusion is present, or it is irrelevant.","Conclusion is abrupt or does not follow from the argument.","Conclusion is weak and only loosely connected to the argument.","Conclusion summarizes the argument but does not offer a new perspective.","Provides a concluding statement that logically follows from and supports the argument presented.","Offers a compelling and insightful conclusion that not only supports the argument but also extends its implications."]]}