{"criteria":["Clarity and Focus","Development and Elaboration","Organization and Structure","Language and Style"],"points":[0,1,2,3,4,5],"descriptions":[["The purpose of the writing is unclear, and the writing lacks focus. The central idea is missing or vague.","The purpose is somewhat unclear, and the writing lacks focus in some areas. The central idea is present but not well-defined.","The purpose is generally clear, and the writing maintains focus in most areas. The central idea is adequately defined.","The purpose is clear, and the writing maintains focus. The central idea is clearly defined and guides the writing.","The purpose is very clear, and the writing is sharply focused throughout. The central idea is compelling and effectively guides the writing.","The purpose is exceptionally clear and engaging, and the writing is impeccably focused. The central idea is insightful and masterfully guides the writing."],["Ideas are not developed or elaborated. There is a lack of supporting evidence or examples.","Ideas are underdeveloped and lack sufficient elaboration. Supporting evidence is minimal or irrelevant.","Ideas are adequately developed with some elaboration. Supporting evidence is present but may lack depth or relevance.","Ideas are well-developed and elaborated with relevant supporting evidence. Examples are used effectively to illustrate points.","Ideas are thoroughly developed and richly elaborated with compelling supporting evidence. Examples are skillfully used to enhance understanding.","Ideas are exceptionally developed and profoundly elaborated with insightful supporting evidence. Examples are masterfully integrated to create a rich and nuanced understanding."],["The writing lacks organization and structure. Ideas are presented randomly and without coherence.","The writing is poorly organized and lacks a clear structure. Transitions are missing or ineffective.","The writing is adequately organized with a discernible structure. Transitions are present but may be weak or awkward.","The writing is well-organized with a clear and logical structure. Transitions are smooth and effectively connect ideas.","The writing is thoughtfully organized with a coherent and compelling structure. Transitions are seamless and enhance the flow of ideas.","The writing is masterfully organized with an innovative and sophisticated structure. Transitions are artfully crafted to create a seamless and engaging reading experience."],["The writing contains numerous errors in grammar, mechanics, and usage. The language is simplistic and lacks variety.","The writing contains frequent errors in grammar, mechanics, and usage. The language is basic and lacks sophistication.","The writing contains some errors in grammar, mechanics, and usage. The language is adequate but may be repetitive or uninspired.","The writing is generally free of errors in grammar, mechanics, and usage. The language is clear, precise, and appropriate for the audience and purpose.","The writing is polished and demonstrates a strong command of grammar, mechanics, and usage. The language is vivid, engaging, and enhances the effectiveness of the writing.","The writing is flawless and showcases exceptional skill in grammar, mechanics, and usage. The language is elegant, evocative, and elevates the writing to a high level of artistry."]]}