{"criteria":["Clarity and Coherence","Development of Ideas","Organization","Style and Tone"],"points":[0,1,2,3,4,5],"descriptions":[["The writing is incomprehensible and lacks any discernible organization. Ideas are presented randomly.","The writing is mostly unclear and lacks coherence. Organization is attempted but ineffective.","The writing is somewhat clear but coherence is inconsistent. Organization is present but needs improvement.","The writing is generally clear and coherent with a recognizable organizational structure.","The writing is clear, coherent, and logically organized, enhancing the overall message.","The writing is exceptionally clear, coherent, and logically structured, creating a seamless and engaging reading experience."],["Ideas are absent or completely undeveloped.","Ideas are superficial and lack development.","Ideas are present but underdeveloped with minimal supporting details.","Ideas are adequately developed with some supporting details.","Ideas are well-developed with relevant and sufficient supporting details.","Ideas are thoroughly and insightfully developed with compelling and comprehensive supporting details."],["No organizational strategy is evident.","The organizational strategy is unclear and ineffective.","The organizational strategy is weak and inconsistently applied.","The organizational strategy is evident and mostly maintained.","The organizational strategy is well-organized and consistently applied.","The organizational strategy is sophisticated and enhances the overall effectiveness of the writing."],["The style is inappropriate and the tone is inconsistent or absent.","The style is somewhat inappropriate for the task, purpose, and audience. The tone is weak or inconsistent.","The style is generally appropriate for the task, purpose, and audience. The tone is somewhat maintained.","The style is appropriate for the task, purpose, and audience. The tone is consistent.","The style is engaging and well-suited for the task, purpose, and audience. The tone is effective.","The style is compelling and enhances the message for the task, purpose, and audience. The tone is masterfully crafted."]]}