{"criteria":["Gathering Relevant Information","Assessing Credibility and Accuracy","Quoting, Paraphrasing, and Avoiding Plagiarism","Following a Standard Format for Citation"],"points":[0,1,2,3,4,5],"descriptions":[["Does not gather information or uses irrelevant sources.","Gathers some information, but it is limited and not always relevant.","Gathers mostly relevant information from a limited number of sources.","Gathers relevant information from a variety of sources.","Gathers comprehensive and relevant information from a variety of sources, demonstrating effective search strategies.","Gathers exceptionally comprehensive and relevant information from a wide range of sources, demonstrating sophisticated search strategies and resourcefulness."],["Does not assess the credibility or accuracy of sources.","Attempts to assess credibility, but lacks understanding of relevant criteria.","Identifies some aspects of credibility and accuracy in sources.","Adequately assesses the credibility and accuracy of most sources.","Thoroughly assesses the credibility and accuracy of all sources, using appropriate criteria.","Critically and insightfully assesses the credibility and accuracy of all sources, demonstrating a nuanced understanding of bias and reliability."],["Plagiarizes or incorrectly uses sources.","Has difficulty quoting and paraphrasing correctly; plagiarism is evident.","Quotes and paraphrases with some errors; plagiarism is occasionally evident.","Generally quotes and paraphrases accurately while avoiding plagiarism.","Consistently quotes and paraphrases accurately, effectively integrates sources, and avoids plagiarism.","Skillfully integrates quotations and paraphrases, enhancing the impact of writing while avoiding plagiarism through meticulous citation."],["Does not follow a standard citation format.","Attempts to follow a citation format but makes numerous errors.","Follows a citation format with some inconsistencies and errors.","Generally follows a standard citation format with minor errors.","Accurately follows a standard citation format consistently throughout the work.","Exemplifies mastery of a standard citation format, with impeccable consistency and attention to detail."]]}