{
  "criteria": [
    "Identification of Cultural Elements",
    "Explanation of Similarities and Differences",
    "Use of Target Language",
    "Reflection on the Nature of Culture"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "The student fails to identify any cultural products, practices, or perspectives in the US, their own culture, or the target culture.",
      "The student identifies cultural elements but struggles to accurately describe them.",
      "The student identifies and describes some cultural elements, but the descriptions lack depth or accuracy.",
      "The student accurately identifies and describes several cultural elements in the US, their own culture, and the target culture.",
      "The student thoroughly identifies and accurately describes a variety of cultural elements, demonstrating a good understanding of each.",
      "The student comprehensively identifies and insightfully describes a wide range of cultural elements with nuanced understanding and accurate detail."
    ],
    [
      "The student does not attempt to explain any similarities or differences between the cultures.",
      "The student attempts to explain similarities and differences but does so superficially or inaccurately.",
      "The student identifies some similarities and differences but struggles to explain the reasons behind them.",
      "The student explains several similarities and differences between the cultures, demonstrating some understanding of cultural context.",
      "The student clearly and thoughtfully explains a variety of similarities and differences, showing a solid understanding of the cultural nuances involved.",
      "The student provides insightful and nuanced explanations of a wide range of similarities and differences, demonstrating a deep understanding of cultural contexts and perspectives."
    ],
    [
      "The student does not use the target language or uses it incorrectly.",
      "The student uses minimal target language, and the language used contains significant errors that impede understanding.",
      "The student uses some target language, but errors are frequent and sometimes interfere with communication.",
      "The student uses the target language adequately, with some errors that do not significantly impede understanding.",
      "The student uses the target language effectively and accurately, with only minor errors.",
      "The student uses the target language fluently and accurately, demonstrating excellent command of vocabulary and grammar."
    ],
    [
      "The student shows no evidence of reflection on the nature of culture.",
      "The student attempts to reflect on culture, but reflections are shallow and lack insight.",
      "The student provides some reflections on culture, but they are simplistic or based on stereotypes.",
      "The student reflects on the nature of culture with some understanding of the complexities involved.",
      "The student demonstrates thoughtful reflection on the nature of culture, showing an awareness of different perspectives and biases.",
      "The student engages in profound and insightful reflection on the nature of culture, demonstrating a sophisticated understanding of cultural dynamics and their impact on individuals and societies."
    ]
  ]
}