{
  "criteria": [
    "Understanding of Cultural Products, Practices, and Perspectives: Assesses the student's ability to identify and explain cultural products (e.g., tools, books), practices (e.g., social customs, traditions), and perspectives (e.g., values, beliefs) within the target language's cultures and their interactions.",
    "Analysis of Cultural Change: Evaluates the student's capacity to analyze how cultural products, practices, and perspectives change when cultures come into contact, demonstrating an understanding of intercultural dynamics.",
    "Use of Target Language: Assesses the student's proficiency in using the target language to discuss and analyze cultural topics, demonstrating effective communication skills.",
    "Hypothesizing about Cultural Interactions: Assesses the student's ability to formulate hypotheses about potential cultural interactions and their outcomes, demonstrating critical thinking and intercultural competence."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Demonstrates no understanding of cultural products, practices, or perspectives.",
      "Struggles to identify or explain any cultural products, practices, or perspectives.",
      "Identifies basic cultural elements but provides superficial explanations.",
      "Explains cultural elements with some depth, showing a moderate understanding of their significance.",
      "Demonstrates a strong understanding of cultural elements, explaining their significance and providing relevant examples.",
      "Exhibits a comprehensive understanding of cultural elements, explaining their significance, providing insightful examples, and demonstrating nuanced comprehension."
    ],
    [
      "Shows no awareness of cultural change or intercultural dynamics.",
      "Unable to identify any instances of cultural change or intercultural influence.",
      "Identifies basic instances of cultural change but offers no analysis of the causes or effects.",
      "Analyzes cultural changes with some insight, explaining potential causes and effects.",
      "Provides a thorough analysis of cultural changes, explaining the causes, effects, and significance of intercultural dynamics.",
      "Demonstrates exceptional analytical skills, providing nuanced insights into the complex causes, effects, and significance of cultural change, considering multiple perspectives."
    ],
    [
      "Unable to use the target language to communicate about cultural topics.",
      "Uses the target language with significant difficulty, hindering communication.",
      "Communicates basic ideas in the target language, but with frequent errors and limited vocabulary.",
      "Effectively communicates ideas in the target language, with occasional errors that do not impede understanding.",
      "Communicates complex ideas fluently and accurately in the target language, demonstrating strong language skills.",
      "Communicates with exceptional fluency, accuracy, and sophistication in the target language, demonstrating mastery and effective communication of nuance."
    ],
    [
      "Unable to formulate any hypotheses about cultural interactions.",
      "Struggles to develop any reasonable hypotheses about cultural interactions.",
      "Formulates basic hypotheses about cultural interactions with limited supporting evidence.",
      "Formulates reasonable hypotheses about cultural interactions, providing some supporting evidence and logical reasoning.",
      "Develops well-reasoned hypotheses about cultural interactions, providing substantial supporting evidence and clear logical reasoning.",
      "Demonstrates exceptional ability to formulate insightful and nuanced hypotheses about cultural interactions, providing comprehensive supporting evidence, rigorous logical reasoning, and consideration of alternative perspectives."
    ]
  ]
}