{
  "criteria": [
    "Recognition of Opportunities in Daily Settings",
    "Application of Language Skills in Real-World Contexts",
    "Engagement and Initiative in Language Use Outside the Classroom"
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Student does not recognize any opportunities to use target language in daily settings.",
      "Student recognizes very few opportunities to use target language in highly predictable daily settings.",
      "Student recognizes some opportunities to use target language in highly predictable common daily settings.",
      "Student recognizes opportunities to use age-appropriate language in most common daily settings within target-language communities.",
      "Student recognizes opportunities to use age-appropriate, culturally authentic language in common daily settings within target-language communities.",
      "Student consistently recognizes opportunities to use age-appropriate, culturally authentic, real-world, and academic language in highly predictable common daily settings within target-language communities."
    ],
    [
      "Student does not apply any language skills in real-world contexts.",
      "Student attempts to apply language skills but struggles significantly in real-world contexts.",
      "Student applies basic language skills with limited success in real-world contexts.",
      "Student applies age-appropriate language skills in some real-world contexts, but with inconsistencies.",
      "Student effectively uses age-appropriate and culturally authentic language skills in various real-world contexts.",
      "Student expertly uses age-appropriate, culturally authentic, real-world, and academic language skills effectively in various real-world contexts."
    ],
    [
      "Student shows no engagement or initiative in using the target language outside the classroom.",
      "Student shows minimal engagement and requires significant prompting to use the target language outside the classroom.",
      "Student occasionally participates in language use opportunities outside the classroom when prompted.",
      "Student participates in some language use opportunities outside the classroom and reflects on progress with guidance.",
      "Student initiates and actively participates in language use opportunities outside the classroom, setting goals and reflecting on progress.",
      "Student consistently initiates and sustains language use opportunities outside the classroom, sets ambitious goals, and critically reflects on progress, using language for enjoyment, enrichment, and advancement."
    ]
  ]
}