{
  "criteria": [
    "Demonstrates understanding of cultural nuances and adjusts communication accordingly.",
    "Uses appropriate language and tone for the context (informal, formal, academic, professional).",
    "Responds effectively and respectfully in unfamiliar and unpredictable situations."
  ],
  "points": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "descriptions": [
    [
      "Shows no awareness of cultural differences and makes no attempt to adjust communication.",
      "Shows limited awareness of cultural differences and struggles to adjust communication appropriately.",
      "Recognizes some cultural nuances and makes basic attempts to adjust communication, but with limited success.",
      "Demonstrates a good understanding of cultural nuances and adjusts communication appropriately in most situations.",
      "Demonstrates a strong understanding of cultural nuances and effectively adjusts communication in diverse situations.",
      "Masterfully navigates cultural nuances, adapting communication with exceptional skill and sensitivity in complex and unpredictable scenarios."
    ],
    [
      "Uses inappropriate language and tone, demonstrating no awareness of the context.",
      "Struggles to use appropriate language and tone, with frequent lapses in judgment.",
      "Uses generally appropriate language and tone, but with occasional inconsistencies.",
      "Consistently uses appropriate language and tone for the given context.",
      "Demonstrates skillful use of language and tone, enhancing communication in various contexts.",
      "Exhibits mastery in language and tone, using them strategically to achieve communication goals in any context."
    ],
    [
      "Unable to respond or responds inappropriately and disrespectfully in unfamiliar situations.",
      "Struggles to respond effectively and respectfully in unfamiliar situations, showing signs of discomfort or confusion.",
      "Responds adequately in unfamiliar situations, but may lack confidence or finesse.",
      "Responds effectively and respectfully in most unfamiliar situations, demonstrating adaptability.",
      "Responds confidently and skillfully in unfamiliar situations, demonstrating poise and cultural sensitivity.",
      "Demonstrates exceptional resourcefulness and grace under pressure, turning unpredictable situations into opportunities for positive interaction and understanding."
    ]
  ]
}